{'status': 'ok', 'totalResults': 14504, 'articles': [{'source': {'id': 'spiegel-online', 'name': 'Spiegel Online'}, 'author': 'SPIEGEL ONLINE', 'title': 'Fall Khashoggi: US-Demokraten wollen Aufklärung über Trumps Geschäfte mit Saudis', 'description': 'US-Präsident Trump hat im Fall des verschwundenen Journalisten Khashoggi angekündigt, von den Saudis Auskunft zu bekommen. Demokraten wollen von ihm nun Aufklärung über seine finanziellen Verbindungen zum Königreich.', 'url': 'http://www.spiegel.de/politik/ausland/fall-khashoggi-us-demokraten-fordern-aufklaerung-von-donald-trump-a-1233852.html', 'urlToImage': 'http://cdn4.spiegel.de/images/image-1309633-860_poster_16x9-zbye-1309633.jpg', 'publishedAt': '2018-10-18T06:20:21Z', 'content': 'Donnerstag, 18.10.2018 08:20 Uhr Elf Senatoren der oppositionellen Demokraten versuchen Donald Trump im Fall des verschwundenen saudischen Journalisten Jamal Khashoggi unter Druck zu setzen. Sie fordern vom US-Präsidenten und von der von seinen Söhnen geführt… [+2977 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "Trump gives Saudi Arabia benefit of doubt in journalist's disappearance", 'description': '"I think we have to find out what happened first," Trump told the Associated Press in an interview on Tuesday. Earlier in a Twitter post, Trump said Saudi Arabia\'s Crown Prince Mohammed bin Salman denied knowing what happened in the Saudi consulate in Istanbu…', 'url': 'https://www.yahoo.com/news/trump-gives-saudi-arabia-benefit-doubt-journalists-disappearance-000409288--finance.html', 'urlToImage': 'https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png', 'publishedAt': '2018-10-17T00:04:09Z', 'content': 'By Makini Brice and Leah Millis WASHINGTON/RIYADH (Reuters) - U.S. President Donald Trump gave Saudi Arabia the benefit of the doubt in the disappearance of journalist Jamal Khashoggi even as U.S. lawmakers pointed the finger at the Saudi leadership and Weste… [+7786 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "Turkey obtains recordings of Saudi journalist's purported killing: paper", 'description': 'The report in the pro-government Sabah daily, which could not immediately be verified, emerged after a delegation from Saudi Arabia arrived in Turkey for a joint investigation into his disappearance. "The moments when Khashoggi was interrogated, tortured and …', 'url': 'https://www.yahoo.com/news/turkey-obtains-recordings-saudi-journalists-purported-killing-paper-081631845--sector.html', 'urlToImage': 'https://s.yimg.com/ny/api/res/1.2/6H2VTHjdR2imkobeb9UIGg--~A/YXBwaWQ9aGlnaGxhbmRlcjt3PTQ1MDtoPTI4MTtzbT0xO2lsPXBsYW5l/http://media.zenfs.com/en_us/News/Reuters/2018-10-13T104931Z_1_LYNXNPEE9C06R_RTROPTP_2_SAUDI-POLITICS-DISSIDENT.JPG.cf.jpg', 'publishedAt': '2018-10-13T11:07:40Z', 'content': "By Daren Butler ISTANBUL (Reuters) - Turkey's investigation into the disappearance of prominent Saudi journalist Jamal Khashoggi has revealed recordings made on his Apple Watch purportedly indicating he was tortured and killed, a Turkish newspaper reported on… [+3192 chars]"}, {'source': {'id': 'spiegel-online', 'name': 'Spiegel Online'}, 'author': 'Maria Stöhr', 'title': 'Der Tag kompakt: Was passierte hinter diesen Türen?', 'description': 'hier finden Sie die wichtigsten Nachrichten des Tages, die beliebtesten Geschichten von SPIEGEL+ und Tipps für Ihren Feierabend. DAS THEMA DES TAGES Update im Fall Khashoggi Die Welt fragt sich, wer die Autoren dieses Krimis sind. Zwei Wochen...', 'url': 'http://www.spiegel.de/politik/deutschland/news-des-tages-was-hinter-saudi-arabiens-erklaerung-im-fall-khashoggi-steckt-a-1233481.html', 'urlToImage': 'http://cdn2.spiegel.de/images/image-1351125-860_poster_16x9-ctai-1351125.gif', 'publishedAt': '2018-10-16T15:19:49Z', 'content': 'hier finden Sie die wichtigsten Nachrichten des Tages, die beliebtesten Geschichten von SPIEGEL+ und Tipps für Ihren Feierabend. DAS THEMA DES TAGES Update im Fall Khashoggi Die Welt fragt sich, wer die Autoren dieses Krimis sind. Zwei Wochen demonstrierten F… [+3224 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Germany delays decision on ministerial trip to Saudi', 'description': "Germany's Foreign Minister Heiko Maas said he would delay a decision on whether to go through with a planned visit to Saudi Arabia until Riyadh had given more clarity on the disappearance of journalist Jamal Khashoggi. Maas said the trip, which had been inten…", 'url': 'https://www.yahoo.com/news/germany-delays-decision-ministerial-trip-saudi-113253072.html', 'urlToImage': None, 'publishedAt': '2018-10-17T11:32:53Z', 'content': None}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Saudi Arabia drops Francophonie bid as journalist uproar grows', 'description': "Saudi Arabia has dropped a bid to join the world's club of French-speaking countries, officials said Thursday, as the Gulf monarchy faces criticism over the disappearance of a critical Saudi journalist. The International Organisation of the Francophonie (OIF)…", 'url': 'https://www.yahoo.com/news/saudi-arabia-drops-francophonie-bid-journalist-uproar-grows-155218951.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/U9mszAJcWEA.MvTsl0zKyA--~B/aD02ODI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/f27e6aa79895da47977c819065cb7860bbc46c6b.jpg', 'publishedAt': '2018-10-11T15:52:18Z', 'content': "Yerevan (AFP) - Saudi Arabia has dropped a bid to join the world's club of French-speaking countries, officials said Thursday, as the Gulf monarchy faces criticism over the disappearance of a critical Saudi journalist. The International Organisation of the Fr… [+1264 chars]"}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Trump wary of halting Saudi arms sales over journalist', 'description': 'Trump also said the United States may be closer to finding out what happened to Khashoggi, a prominent critic of Saudi policies who was last seen entering the Saudi consulate in Istanbul on Oct. 2. Turkish sources have said they believe Khashoggi was killed i…', 'url': 'https://www.yahoo.com/news/turkey-cannot-remain-silent-over-khashoggis-disappearance-erdogan-071111772.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/rB5YnnVtEzgL6uNn6lZ4RA--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2018-10-11T200640Z_2_LYNXNPEE9A0J2_RTROPTP_2_SAUDI-POLITICS-DISSIDENT.JPG', 'publishedAt': '2018-10-11T23:07:40Z', 'content': 'By Jeff Mason and Stephen Kalin WASHINGTON/ISTANBUL (Reuters) - U.S. President Donald Trump said on Thursday that he saw no reason to cut off arms sales to Saudi Arabia because of the disappearance of Saudi journalist Jamal Khashoggi, possibly setting up a cl… [+5725 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Trump says Saudi should be presumed innocent over missing journalist: report', 'description': 'US President Donald Trump pushed back Tuesday at global condemnation of Saudi Arabia over the disappearance and suspected murder of journalist Jamal Khashoggi, saying the kingdom deserved to be presumed innocent. In an interview with the Associated Press, Tru…', 'url': 'https://www.yahoo.com/news/trump-says-saudi-presumed-innocent-over-missing-journalist-230228170.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/90SKjZdgkIfIpPWJwPD_IA--~B/aD02Nzg7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/12fea3869aaf690653f2e0cc55150e003bdffa2e.jpg', 'publishedAt': '2018-10-16T23:02:28Z', 'content': 'Washington (AFP) - US President Donald Trump pushed back Tuesday at global condemnation of Saudi Arabia over the disappearance and suspected murder of journalist Jamal Khashoggi, saying the kingdom deserved to be presumed innocent. In an interview with the As… [+1575 chars]'}, {'source': {'id': 'politico', 'name': 'Politico'}, 'author': 'Kristian Ulrichsen', 'title': 'The Tragedy of Jamal Khashoggi', 'description': 'The sad irony of the Saudi journalist’s disappearance: His fate may seal that of the reckless monarch he criticized.', 'url': 'https://www.politico.com/magazine/story/2018/10/12/the-tragedy-of-jamal-khashoggi-221306', 'urlToImage': 'https://static.politico.com/92/bf/bdda25f44355b3e58c78e16e0fa3/getty-khashoogi-773.jpg', 'publishedAt': '2018-10-12T15:13:47Z', 'content': 'Its not just Jamal Khashoggi. The disappearance and reported killing of the reform-minded Saudi journalist at a consulate in Istanbul is only the latest in a succession of developments that have cast serious doubt upon the trajectory of Saudi Arabia under Cro… [+9715 chars]'}, {'source': {'id': None, 'name': 'Boingboing.net'}, 'author': 'Xeni Jardin', 'title': "Artist hand writes entire 'Jurassic Park' script, creates line-art of a scene from the movie", 'description': "Now that's dedication. IMGURian Mike Matola is a wonderful weird genius. He hand-copied the entire Jurassic Park script, line by line, to create this line art of a scene from the Steven Spielberg dinosaur movie. You can buy his art! Find him at linebylinepost…", 'url': 'https://boingboing.net/2018/10/12/artist-hand-writes-entire-ju.html', 'urlToImage': 'https://media.boingboing.net/wp-content/uploads/2018/10/5KxzVS5.jpg', 'publishedAt': '2018-10-12T23:30:56Z', 'content': 'Because of course they would. President Donald Trump’s son Don Jr., along with pro-Trump extreme right wing media, are exploiting Washington Post contributing journalist Jamal Khashoggis interviews with Osama bin Laden to imply that he supported Islamic terro… [+1496 chars]'}, {'source': {'id': None, 'name': 'Boingboing.net'}, 'author': 'Xeni Jardin', 'title': "Trump denies promising $1M to Elizabeth Warren's charity pick if DNA test proved Native American ancestry", 'description': 'Alert the media. President Donald Trump has lied again. Senator Elizabeth Warren brought the genetic receipts. Trump denied making a statement that he did, in fact, make -- despite knowing there is documentation to the contrary. A lot of things are at play he…', 'url': 'https://boingboing.net/2018/10/15/trump-denies-promising-1m-to.html', 'urlToImage': 'https://media.boingboing.net/wp-content/uploads/2018/10/warren-1.jpg', 'publishedAt': '2018-10-15T13:44:36Z', 'content': "US Senator David Purdue (R-GA/@sendavidperdue), a grown-ass human being elected to high office in the most powerful nation in the land, was asked a question about Brian Kemp, who is both a (monumentally unhinged) candidate for governor of Georgia and Georgia'… [+1743 chars]"}, {'source': {'id': 'cnn', 'name': 'CNN'}, 'author': 'Pat Wiedenkeller, CNN', 'title': 'Opinion: A tale of two first ladies', 'description': "A Taylor Swift bump, a Nikki Haley bombshell, some bad-new polls for Republicans about women voters. Women (and girls!) dominated the week's news. But Melania Trump and Michelle Obama had the most arresting turns in the spotlight, showing just how different t…", 'url': 'https://www.cnn.com/2018/10/14/opinions/a-tale-of-two-first-ladies-opinion-wrapup-column/index.html', 'urlToImage': 'https://cdn.cnn.com/cnnnext/dam/assets/181012141921-20181011-first-ladies-sunday-opinion-column-super-tease.jpg', 'publishedAt': '2018-10-14T12:37:39Z', 'content': "In a new series of weekly columns (available soon as a newsletter), we're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets. (CNN) A Taylor Swift bump, a Nikki Haley bombshell, some bad-new polls for Republicans abou… [+8761 chars]"}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "Donald Trump vows 'severe punishment' if Saudi Arabia murdered journalist Jamal Khashoggi", 'description': 'Donald Trump has vowed “severe punishment” for Saudi Arabia if it is proven that the kingdom was responsible for murdering Jamal Khashoggi, the missing journalist. The US president said he was “very upset and angry” about the case and indicated that he was no…', 'url': 'https://www.yahoo.com/news/donald-trump-vows-apos-severe-143448823.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/csCopzwvm65RsJqiKQkf5A--~B/aD01MzY7dz04NTg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-GB/homerun/the_telegraph_258/f2bb6038963c1dd9f52d10ceb33d727c', 'publishedAt': '2018-10-13T14:34:48Z', 'content': 'Donald Trump has vowed severe punishment for Saudi Arabia if it is proven that the kingdom was responsible for murdering Jamal Khashoggi, the missing journalist. The US president said he was very upset and angry about the case and indicated that he was not fu… [+5836 chars]'}, {'source': {'id': None, 'name': 'Theatlantic.com'}, 'author': 'Krishnadev Calamur', 'title': 'Saudi Arabia Does a Big Favor For Iran', 'description': 'With its alleged hand in the disappearance of a dissident journalist, the kingdom stands accused of the sort of actions it usually calls out the\xa0Islamic Republic for carrying out.', 'url': 'https://www.theatlantic.com/international/archive/2018/10/iran-saudi-arabia-jamal-khashoggi/572953/', 'urlToImage': 'https://cdn.theatlantic.com/assets/media/img/mt/2018/10/RTX6EVRE/facebook.jpg?1539427393', 'publishedAt': '2018-10-15T13:44:26Z', 'content': 'When the Trump administration talks about “ severe punishment ” for a country in the Middle East, it is generally referring to Iran, a country whose regional influence troubles both its Arab neighbors as well as the United States. Yet on Sunday, President Tru… [+5962 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "'Complicit' Mike Pence Blasted Over 'Freedom Of The Press' Defense Tweet", 'description': 'Vice President Mike Pence faced accusations of hypocrisy on Monday night after', 'url': 'https://www.yahoo.com/news/apos-complicit-apos-mike-pence-075028263.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/rON71MMqplFmkrxrigtRZg--~B/aD0yNTQyO3c9NDUzODtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/the_huffington_post_584/af8c9815711153154e8fac24552e81a5', 'publishedAt': '2018-10-09T07:50:28Z', 'content': 'Vice President Mike Pence faced accusations of hypocrisy on Monday night after he tweeted about the importance of freedom of the press. Deeply troubled to hear reports about Saudi Arabian journalist Jamal Khashoggi. If true, this is a tragic day. Violence aga… [+2704 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "The Latest: IMF's Lagarde planning to attend Saudi meeting", 'description': 'NUSA DUA, Indonesia (AP) — The Latest on the annual meeting of the International Monetary Fund and World Bank in Bali, Indonesia (all times local):', 'url': 'https://www.yahoo.com/news/latest-imf-pledges-guard-growth-financial-stability-055314893.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/eK4EwQjMtrockIzCJk1JOg--~B/aD0zMTYwO3c9NDc5MztzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/79dcbaefac5444e685c05602436ed9f9.jpg', 'publishedAt': '2018-10-13T07:55:18Z', 'content': 'NUSA DUA, Indonesia (AP) The Latest on the annual meeting of the International Monetary Fund and World Bank in Bali, Indonesia (all times local): 3:55 p.m. The managing director of the International Monetary Fund, Christine Lagarde, has said she still intends… [+2393 chars]'}, {'source': {'id': 'the-wall-street-journal', 'name': 'The Wall Street Journal'}, 'author': 'Rebecca Ballhaus, David Gauthier-Villars', 'title': 'The Wall Street Journal: Saudis weigh saying Khashoggi was killed by mistake', 'description': 'Saudi Arabia is weighing whether to say that rogue operatives killed a Saudi dissident journalist, people familiar with the matter said, a position that would help the royal family exonerate itself from direct responsibility for a matter that has roiled its r…', 'url': 'https://www.wsj.com/articles/turkey-to-inspect-saudi-consulate-where-khashoggi-went-missing-1539604362?mod=hp_lead_pos1', 'urlToImage': 'http://s.marketwatch.com/public/resources/MWimages/MW-GR807_khasho_ZG_20181015164102.jpg', 'publishedAt': '2018-10-15T20:42:49Z', 'content': 'Jamal Khashoggi in December 2014. Saudi Arabia is weighing whether to say that rogue operatives killed a Saudi dissident journalist, people familiar with the matter said, a position that would help the royal family exonerate itself from direct responsibility … [+777 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "The Latest: UN chief 'concerned' about missing Saudi writer", 'description': "ANKARA, Turkey (AP) — The Latest on the disappearance of a Saudi columnist, who went missing after visiting his country's consulate in Istanbul (all times local):", 'url': 'https://www.yahoo.com/news/latest-turkey-saudis-must-prove-writer-left-consulate-155354473.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/kHU53AnMK2KnNT42SndRYw--~B/aD0zNDU2O3c9NTE4NDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/a174e5938671427080403fe8e05627b5.jpg', 'publishedAt': '2018-10-08T18:02:58Z', 'content': "ANKARA, Turkey (AP) The Latest on the disappearance of a Saudi columnist, who went missing after visiting his country's consulate in Istanbul (all times local): 6:50 p.m. Turkish President Recep Tayyip Erdogan says Saudi Arabia has the responsibility to prove… [+1650 chars]"}, {'source': {'id': None, 'name': 'Marketwatch.com'}, 'author': 'Mike Murphy', 'title': 'Key Words: In final column, Khashoggi laments ‘Arab governments have been given free rein’ to silence media', 'description': 'Saudi journalist Jamal Khashoggi’s final column was published by the Washington Post late Wednesday.', 'url': 'https://www.marketwatch.com/story/in-final-column-khashoggi-laments-arab-governments-have-been-given-free-rein-to-silence-media-2018-10-17', 'urlToImage': 'http://s.marketwatch.com/public/resources/MWimages/MW-GR135_saudi1_ZG_20181003170226.jpg', 'publishedAt': '2018-10-18T00:46:27Z', 'content': 'These actions no longer carry the consequence of a backlash from the international community. Instead, these actions may trigger condemnation quickly followed by silence. As a result, Arab governments have been given free rein to continue silencing the media … [+2232 chars]'}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'DARLENE SUPERVILLE and ZEKE MILLER / AP', 'title': 'President Trump Celebrates as Pastor Andrew Brunson Returns From Turkey', 'description': 'President Trump welcomed American pastor Andrew Brunson to the Oval Office celebrating his release from two years of confinement in Turkey.', 'url': 'http://time.com/5424139/trump-andrew-brunson-turkey/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/10/trump-andrew-brunson-oval-office.jpg?quality=85', 'publishedAt': '2018-10-13T19:46:02Z', 'content': '(WASHINGTON) — President Donald Trump welcomed American pastor Andrew Brunson to the Oval Office on Saturday, celebrating his release from nearly two years of confinement in Turkey that had sparked a diplomatic row with a key ally and outcry from U.S. evangel… [+5710 chars]'}]}