{'status': 'ok', 'totalResults': 13924, 'articles': [{'source': {'id': 'the-new-york-times', 'name': 'The New York Times'}, 'author': None, 'title': 'Stocks, Saudi Arabia, Hurricane Michael: Your Thursday Briefing - New York Times', 'description': "New York Times Stocks, Saudi Arabia, Hurricane Michael: Your Thursday Briefing New York Times (Want to get this briefing by email? Here's the sign-up.) Good morning. Turkey names names, a fearsome hurricane makes landfall, and millennials revive the dirndl. H…", 'url': 'https://www.nytimes.com/2018/10/11/briefing/saudi-arabia-stocks-hurricane-michael.html', 'urlToImage': 'https://static01.nyt.com/images/2018/10/11/briefing/10112018ambriefing-euro-promo/10112018ambriefing-euro-promo-facebookJumbo.jpg', 'publishedAt': '2018-10-11T04:41:15Z', 'content': 'How does 19 hours on a plane sound? Singapore Airlines is bringing back the longest flight in the world this week, nonstop from Singapore to Newark on a brand new kind of Airbus A350. (From 2004 to 2013, Singapore flew the route with a less efficient A340. Ri… [+997 chars]'}, {'source': {'id': 'the-washington-post', 'name': 'The Washington Post'}, 'author': 'https://www.facebook.com/missy.ryan', 'title': "As crisis intensifies, what's at stake in America's military partnership with Saudi Arabia? - Washington Post", 'description': "Washington Post As crisis intensifies, what's at stake in America's military partnership with Saudi Arabia? Washington Post International concern over Saudi Arabia's suspected role in the disappearance of a prominent Saudi journalist has threatened to disrupt…", 'url': 'https://www.washingtonpost.com/world/national-security/as-crisis-intensifies-whats-at-stake-in-americas-military-partnership-with-saudi-arabia/2018/10/12/3ce0994e-cd75-11e8-a3e6-44daa3d35ede_story.html', 'urlToImage': 'https://www.washingtonpost.com/resizer/2IsKcf0DE2vGKwcHs8RPISNOY4s=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FVI5RQGOMYI6REQP3VJODLSFOA.jpg', 'publishedAt': '2018-10-12T21:59:39Z', 'content': 'International concern over Saudi Arabias suspected role in the disappearance of a prominent Saudi journalist has threatened to disrupt one of the United States most important security partnerships. Reports that Jamal Khashoggi, a Washington Post columnist and… [+7751 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "AP Explains: What's known about Saudi writer's disappearance", 'description': 'DUBAI, United Arab Emirates (AP) — Veteran Saudi journalist Jamal Khashoggi disappeared almost two weeks ago while on a visit to the Saudi Consulate in Istanbul, sparking an international uproar involving the kingdom, Turkey and the United States that remains…', 'url': 'https://www.yahoo.com/news/ap-explains-whats-known-saudi-writers-disappearance-055245233.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/sfA.MaSRpEKn9dPh7AiHug--~B/aD0zNzgwO3c9NTU4MDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/018e01961efc4865b72cdf3bdca661a2.jpg', 'publishedAt': '2018-10-15T05:52:45Z', 'content': 'DUBAI, United Arab Emirates (AP) Veteran Saudi journalist Jamal Khashoggi disappeared almost two weeks ago while on a visit to the Saudi Consulate in Istanbul, sparking an international uproar involving the kingdom, Turkey and the United States that remains u… [+6041 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Saudi consulate in Istanbul will be searched: Turkish foreign ministry', 'description': 'Turkey\'s Foreign Ministry said on Tuesday that the investigation into Saudi journalist Jamal Khashoggi, who has been missing since he entered the Saudi consulate in Istanbul a week ago, is "continuing intensively". Foreign Ministry spokesman Hami Aksoy said i…', 'url': 'https://www.yahoo.com/news/saudi-consulate-istanbul-searched-turkish-foreign-ministry-101745305.html', 'urlToImage': None, 'publishedAt': '2018-10-09T10:44:57Z', 'content': None}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "The Latest: Turkey's president says he hopes Saudi writer OK", 'description': 'ISTANBUL (AP) — The Latest on the disappearance of a Saudi writer in Istanbul (all times local):', 'url': 'https://www.yahoo.com/news/latest-turkeys-president-says-hopes-saudi-writer-ok-132943078.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/ugQVfkO6QOm.Nb7HAYQhbg--~B/aD0zMDE3O3c9NDUyNTtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/fa29fe06f2cf48b1b0c93fe4acff3639.jpg', 'publishedAt': '2018-10-07T13:29:53Z', 'content': "ISTANBUL (AP) The Latest on the disappearance of a Saudi writer in Istanbul (all times local): 4:25 Turkey's president says the Saudi Consulate and Istanbul's airports were being closely monitored for clues following a Saudi writer's disappearance. Recep Tayy… [+1352 chars]"}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Guardian staff', 'title': "John Oliver: Trump and Bin Salman are 'similar in some of the worst ways'", 'description': 'The Last Week Tonight host took aim at America’s ‘long and morally compromised history’ with Saudi Arabia John Oliver laid out the problematic relationship that Donald Trump shares with the Saudi prince Mohammed bin Salman, calling out their similarities. On …', 'url': 'https://www.theguardian.com/tv-and-radio/2018/oct/15/john-oliver-last-week-tonight-recap-trump-saudi-arabia-khashoggi', 'urlToImage': 'https://i.guim.co.uk/img/media/45581bf46b844d9368d9e9e2e1b06676e4dd2d9b/81_0_1618_971/master/1618.png?width=1200&height=630&quality=85&auto=format&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZDM1ODZhNWVmNTc4MTc1NmQyMWEzYjYzNWU1MTcxNDEvdGctZGVmYXVsdC5wbmc&s=137ad9ff5ea439c5e630d776dfe805ee', 'publishedAt': '2018-10-15T15:26:06Z', 'content': 'John Oliver laid out the problematic relationship that Donald Trump shares with the Saudi prince Mohammed bin Salman, calling out their similarities. On his HBO show Last Week Tonight, the comic talked about the absolutely horrific reports of the alleged murd… [+2709 chars]'}, {'source': {'id': 'the-washington-post', 'name': 'The Washington Post'}, 'author': None, 'title': 'Top banker Dimon drops out of Saudi conference as Treasury secretary Mnuchin weighs whether to attend - Washington Post', 'description': 'Washington Post Top banker Dimon drops out of Saudi conference as Treasury secretary Mnuchin weighs whether to attend Washington Post Jamie Dimon, chief executive of JPMorgan Chase & Co., is the latest and one of the most high-profile business executives to d…', 'url': 'https://www.washingtonpost.com/business/2018/10/15/top-banker-jamie-dimon-drops-out-saudi-conference-treasury-secretary-mnuchin-weighs-whether-attend/', 'urlToImage': 'https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png', 'publishedAt': '2018-10-15T01:52:36Z', 'content': 'Jamie Dimon, chief executive of JPMorgan Chase, is the latest and one of the most high-profile business executives to drop out of a Saudi investment conference in Riyadh this month, after allegations that Saudi agents killed the dissident journalist Jamal Kha… [+2861 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Moments in disappearance, alleged slaying of Jamal Khashoggi', 'description': "Saudi journalist Jamal Khashoggi, who wrote critically of the kingdom's policies and Saudi Crown Prince Mohammed bin Salman, disappeared earlier this month on a trip to the Saudi Consulate in Istanbul, where Turkish officials believe he was killed.", 'url': 'https://www.yahoo.com/news/moments-disappearance-alleged-slaying-jamal-khashoggi-113730949.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/5IwynjT8518BCLY8cGVJxw--~B/aD0zNDA1O3c9NTEwODtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/3469ae9839724697a6a39634adcd60d5.jpg', 'publishedAt': '2018-10-17T11:37:30Z', 'content': "Saudi journalist Jamal Khashoggi, who wrote critically of the kingdom's policies and Saudi Crown Prince Mohammed bin Salman, disappeared earlier this month on a trip to the Saudi Consulate in Istanbul, where Turkish officials believe he was killed. Here are s… [+5288 chars]"}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Donald Trump Jr. Peddles Tweet Linking Jamal Khashoggi To ‘Jihadists’', 'description': 'Donald Trump Jr. promoted a Twitter exchange on Friday that smeared Jamal', 'url': 'https://www.yahoo.com/news/donald-trump-jr-peddles-tweet-050112718.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/WGxtVFhYZVFkyO9rBXkHkg--~B/aD0xNzkyO3c9MzE5OTtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/the_huffington_post_584/a8b699e85c1d380e0279ad8712e647a1', 'publishedAt': '2018-10-13T05:01:12Z', 'content': 'Donald Trump Jr. promoted a Twitter exchange on Friday that smeared Jamal Khashoggi, the Saudi journalist and Washington Post columnist who disappeared in the Saudi consulate in Turkey earlier this month, as an ally of jihadists. Turkish officials say they ha… [+2839 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Saudi threatens to retaliate against any sanctions over Khashoggi disappearance', 'description': 'Turkey\'s government believes he was murdered inside the building and his body removed. Saudi Arabia has denied that. U.S. President Donald Trump has threatened "severe punishment" if it turned out Khashoggi was killed in the consulate, though he said Washingt…', 'url': 'https://www.yahoo.com/news/saudi-arabia-says-respond-economic-sanctions-spa-112824051.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/obS0m4a6aUknQ3cHQjXRRQ--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2018-10-14T143855Z_1_LYNXNPEE9D0H2_RTROPTP_2_SAUDI-POLITICS-DISSIDENT.JPG', 'publishedAt': '2018-10-14T14:38:55Z', 'content': 'By Andrew Torchia DUBAI (Reuters) - Saudi Arabia on Sunday warned against threats to punish it over the disappearance of journalist Jamal Khashoggi last week, saying it would retaliate against any sanctions with tougher measures, as international criticism in… [+3969 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'US stays cautious over Khashoggi as new killing claims emerge', 'description': 'Secretary of State Mike Pompeo on Wednesday refused to blame key US ally Saudi Arabia over the disappearance of journalist Jamal Khashoggi even as Riyadh faced new claims he was killed and tortured inside its Istanbul consulate. After talks with the Saudi lea…', 'url': 'https://www.yahoo.com/news/pompeo-turkey-saudi-faces-claims-over-khashoggi-080032521.html', 'urlToImage': 'https://s.yimg.com/ny/api/res/1.2/droZ0oj11a8Xm1SNn7jJ1w--~A/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD03MDg7c209MTtpbD1wbGFuZQ--/http://media.zenfs.com/en_us/News/afp.com/db89800f2ff3ecef5671d4d5145ebf7c6184ed39.jpg', 'publishedAt': '2018-10-17T11:00:01Z', 'content': 'Ankara (AFP) - Secretary of State Mike Pompeo on Wednesday refused to blame key US ally Saudi Arabia over the disappearance of journalist Jamal Khashoggi even as Riyadh faced new claims he was killed and tortured inside its Istanbul consulate. After talks wit… [+4469 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Top US senators scold Riyadh, vow action over Khashoggi debacle', 'description': 'An influential US Senate ally of President Donald Trump pledged Tuesday that Congress would take decisive action against Saudi Arabia over a missing writer, calling for the ouster of Crown Prince Mohammed bin Salman. The US president said Tuesday he had spoke…', 'url': 'https://www.yahoo.com/news/top-us-senators-scold-riyadh-vow-action-over-174744442.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/DD2jBnSE1oNZOSkLknHBCg--~B/aD03NjM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/Part-GTY-452613794-1-1-1.jpg', 'publishedAt': '2018-10-16T20:47:40Z', 'content': 'Washington (AFP) - An influential US Senate ally of President Donald Trump pledged Tuesday that Congress would take decisive action against Saudi Arabia over a missing writer, calling for the ouster of Crown Prince Mohammed bin Salman. "This guy is a wrecking… [+3256 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'U.N. rights chief urges waiving of immunity in Khashoggi case', 'description': 'Overnight, Turkish crime scene investigators entered the Saudi consulate in Istanbul, the last place Khashoggi was seen before vanishing on Oct. 2, for the first time and searched the premises for over nine hours, Reuters witnesses said. In a statement, Bache…', 'url': 'https://www.yahoo.com/news/u-n-rights-chief-bachelet-calls-lifting-immunity-085916558.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/6pUrsvzdUDmnOmzx0yo_OQ--~B/aD0zMDg7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2018-10-16T173255Z_3_LYNXNPEE9F0R2_RTROPTP_2_UN-RIGHTS.JPG', 'publishedAt': '2018-10-16T17:32:55Z', 'content': 'By Stephanie Nebehay GENEVA (Reuters) - U.N. human rights chief Michelle Bachelet called on Saudi Arabia and Turkey on Tuesday to reveal everything they know about the disappearance and possible murder of missing journalist Jamal Khashoggi and said Riyadh sho… [+1993 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'US treasury secretary wavers over Saudi trip after Khashoggi disappearance', 'description': 'US treasury secretary Steve Mnuchin on Sunday was second-guessing his stated intention to attend an economic conference in Saudi Arabia, following the disappearance of journalist Jamal Khashoggi inside the Saudi consulate in Istanbul. Mnuchin’s wavering, whic…', 'url': 'https://www.yahoo.com/news/us-treasury-secretary-wavers-over-165321526.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/nemZJK33OUiBiozah8V6ww--~B/aD0zMDA7dz01MDA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/the_guardian_765/b3aa67dd9da3565c40becfe855c79adc', 'publishedAt': '2018-10-14T16:53:21Z', 'content': 'Steve Mnuchin is second-guessing attending economic conference after claims that Saudi assassins killed journalist US treasury secretary Steven Mnuchin. Photograph: Frederic J/AFP/Getty Images More US treasury secretary Steve Mnuchin on Sunday was second-gues… [+3430 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "IMF chief 'horrified' by Khashoggi case, still plans Saudi trip", 'description': 'IMF chief Christine Lagarde said Saturday she was "horrified" by reports about the fate of Saudi dissident Jamal Khashoggi but still plans to attend an economic meeting in Riyadh this month. As questions swirl over the fate of Khashoggi -- a Saudi critic who …', 'url': 'https://www.yahoo.com/news/mnuchin-still-attending-saudi-davos-desert-042854795.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/TG5Ynry.gdWpn2V5u2IV0w--~B/aD03MTI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/61f7156672aae35c0e2d6a4b55999784bfdaf520.jpg', 'publishedAt': '2018-10-13T10:47:19Z', 'content': 'Nusa Dua (Indonesia) (AFP) - IMF chief Christine Lagarde said Saturday she was "horrified" by reports about the fate of Saudi dissident Jamal Khashoggi but still plans to attend an economic meeting in Riyadh this month. As questions swirl over the fate of Kha… [+2721 chars]'}, {'source': {'id': 'spiegel-online', 'name': 'Spiegel Online'}, 'author': 'SPIEGEL ONLINE', 'title': 'Verschwundener Journalist: Saudi-Arabien erlaubt Durchsuchung des Istanbuler Konsulats', 'description': 'Immer noch ist unklar, wie der saudi-arabische Journalist Jamal Khashoggi in der Türkei verschwunden ist. Ermittler dürfen nun das saudi-arabische Konsulat in Istanbul durchsuchen.', 'url': 'http://www.spiegel.de/politik/ausland/jamal-khashoggi-saudi-arabien-erlaubt-durchsuchung-des-istanbuler-konsulats-a-1232332.html', 'urlToImage': 'http://cdn1.spiegel.de/images/image-1348408-860_poster_16x9-pdti-1348408.jpg', 'publishedAt': '2018-10-09T12:15:34Z', 'content': 'Dienstag, 09.10.2018 14:15 Uhr Der regimekritische Journalist Jamal Khashoggi hatte die Politik seiner Heimat Saudi-Arabien kritisiert und fürchtete nach eigenen Angaben Vergeltung. Seit einer Woche gilt er als vermisst. Bewahrheitet sich seine Befürchtung? U… [+1770 chars]'}, {'source': {'id': 'spiegel-online', 'name': 'Spiegel Online'}, 'author': 'Maximilian Popp', 'title': 'Verschwundener Journalist Khashoggi: Mit Trump und Erdogan für die Meinungsfreiheit', 'description': 'Die Indizien verdichten sich, dass das saudi-arabische Regime den Journalisten Jamal Khashoggi hat verschwinden lassen. Der Westen sollte der Türkei gegenüber Riad beistehen.', 'url': 'http://www.spiegel.de/politik/ausland/jamal-khashoggi-mit-trump-und-erdogan-fuer-die-meinungsfreiheit-kommentar-a-1232972.html', 'urlToImage': 'http://cdn3.spiegel.de/images/image-1350016-860_poster_16x9-dxxk-1350016.jpg', 'publishedAt': '2018-10-12T15:01:13Z', 'content': 'Freitag, 12.10.2018 17:01 Uhr "Das Schicksal Khashoggis ist ein Test für die gesamte Welt im Hinblick auf Meinungs- und Pressefreiheit. Einen Bürger nur wegen seiner kritischen Haltung zu bestrafen, verstößt gegen sämtliche humanistische Werte." Nicht US-Präs… [+2490 chars]'}, {'source': {'id': 'spiegel-online', 'name': 'Spiegel Online'}, 'author': 'SPIEGEL ONLINE', 'title': 'Verschwundener Journalist Khashoggi: Trump nimmt Saudi-Arabien in Schutz', 'description': 'Noch immer ist unklar, was mit dem Journalisten Jamal Khashoggi geschah. Die G7 wollen die Verantwortlichen zur Rechenschaft ziehen. Der US-Präsident betont: Auch für Saudi-Arabien solle die Unschuldsvermutung gelten.', 'url': 'http://www.spiegel.de/politik/ausland/jamal-khashoggi-donald-trump-nimmt-saudi-arabien-in-schutz-g7-wollen-aufklaerung-a-1233659.html', 'urlToImage': 'http://cdn3.spiegel.de/images/image-1351236-860_poster_16x9-tkou-1351236.jpg', 'publishedAt': '2018-10-17T03:02:49Z', 'content': 'Mittwoch, 17.10.2018 05:02 Uhr Der amerikanische Präsident Donald Trump hat die Führung in Riad im Fall des verschwundenen Journalisten und Regimekritikers Jamal Khashoggi in Schutz genommen: Auch für Saudi-Arabien müsse die Unschuldsvermutung gelten. "Jetzt … [+3907 chars]'}, {'source': {'id': 'usa-today', 'name': 'USA Today'}, 'author': 'USA TODAY, Mike James, USA TODAY', 'title': 'Missing Washington Post journalist tortured, dismembered in Saudi consulate, report says', 'description': 'Turkish officials have told the U.S. that they have proof that a missing Washington Post columnist was tortured, murdered and dismembered by Saudis', 'url': 'https://www.usatoday.com/story/news/2018/10/11/khashoggi-tortured-dismembered-saudi-embassy-turks-spying-consulate-middle-east/1608878002/?utm_source=google&utm_medium=amp&utm_campaign=speakable', 'urlToImage': 'https://www.gannett-cdn.com/-mm-/87986c8293138d4d6da7279010edb20442b8c822/c=0-349-4887-3110/local/-/media/2018/10/08/USATODAY/USATODAY/636745924195892005-AP-APTOPIX-Turkey-Saudi-Missing-Writer.jpg?width=3200&height=1680&fit=crop', 'publishedAt': '2018-10-12T01:02:37Z', 'content': 'Turkey said on Tuesday it will search the Saudi Consulate in Istanbul as part of an investigation into the disappearance of a missing Saudi contributor to The Washington Post, a week after he vanished during a visit there. (Oct. 9) AP Tawakkol Karman, the Nob… [+4656 chars]'}, {'source': {'id': 'spiegel-online', 'name': 'Spiegel Online'}, 'author': 'SPIEGEL ONLINE', 'title': 'Fall Khashoggi: Westliche Konzerne boykottieren Saudi-Arabiens Wirtschaftsgipfel', 'description': 'Im Fall des verschwundenen saudi-arabischen Journalisten Khashoggi gehen westliche Konzerne auf Distanz zu Riad und sagen ihre Teilnahme an einem Wirtschaftsgipfel ab. Siemens will kommen - noch.', 'url': 'http://www.spiegel.de/politik/ausland/fall-jamal-khashoggi-westliche-konzerne-boykottieren-saudi-arabiens-wirtschaftsgipfel-a-1233060.html', 'urlToImage': 'http://cdn2.spiegel.de/images/image-1350061-860_poster_16x9-stvz-1350061.jpg', 'publishedAt': '2018-10-13T05:33:56Z', 'content': 'Samstag, 13.10.2018 07:33 Uhr Nach dem Verschwinden des saudi-arabischen Journalisten Jamal Khashoggi im Istanbuler Konsulat seines Landes drohen Riad wirtschaftliche Konsequenzen. Angesichts des Verdachts, dass der mächtige Kronprinz Mohammed bin Salman den … [+4671 chars]'}]}