{'status': 'ok', 'totalResults': 13924, 'articles': [{'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "U.S. senator: journalist's death may merit sanctions at 'highest' level of Saudi government", 'description': 'The chairman of the U.S. Senate Foreign Relations Committee said on Thursday that sanctions would have to be imposed at the "highest levels" of the Saudi government if it were found that the government was behind the disappearance and reported death of Saudi …', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-senate/u-s-senator-journalists-death-may-merit-sanctions-at-highest-level-of-saudi-government-idUSKCN1ML2IM', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181011&t=2&i=1313693734&w=1200&r=LYNXNPEE9A1QF', 'publishedAt': '2018-10-11T17:17:30Z', 'content': 'WASHINGTON (Reuters) - The chairman of the U.S. Senate Foreign Relations Committee said on Thursday that sanctions would have to be imposed at the “highest levels” of the Saudi government if it were found that the government was behind the disappearance and r… [+901 chars]'}, {'source': {'id': 'cnn', 'name': 'CNN'}, 'author': 'Manu Raju, Ted Barrett and Jeremy Herb, CNN', 'title': "Senators warn Congress may block Trump's Saudi arms deals", 'description': 'President Donald Trump said Thursday he wants to move forward with major arms deals with Saudi Arabia, but senators from both parties are warning that Congress may block these accords from going forward.', 'url': 'https://www.cnn.com/2018/10/11/politics/senators-congress-could-block-saudi-arms-deals/index.html', 'urlToImage': 'https://cdn.cnn.com/cnnnext/dam/assets/181005103814-02-jamal-khashoggi-file-super-tease.jpg', 'publishedAt': '2018-10-11T20:17:51Z', 'content': '(CNN) President Donald Trump said Thursday he wants to move forward with major arms deals with Saudi Arabia, but senators from both parties are warning that Congress may block these accords from going forward. New Jersey Sen. Bob Menendez, the top Democrat on… [+3178 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "Top US diplomat wants 'thorough' Saudi probe of journalist disappearance", 'description': "US Secretary of State Mike Pompeo on Monday called for a thorough and open probe by Washington's ally Saudi Arabia into the disappearance of Riyadh critic Jamal Khashoggi, after President Donald Trump voiced concern for the journalist. Khashoggi, a Washington…", 'url': 'https://www.yahoo.com/news/trump-voices-concern-over-missing-saudi-journalist-225320444.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/cAsd9EKbegp8HWgjDRjkUw--~B/aD02ODE7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/8827f3072b0f3eec13a7382b6abecfce63325d78.jpg', 'publishedAt': '2018-10-09T03:52:50Z', 'content': "Washington (AFP) - US Secretary of State Mike Pompeo on Monday called for a thorough and open probe by Washington's ally Saudi Arabia into the disappearance of Riyadh critic Jamal Khashoggi, after President Donald Trump voiced concern for the journalist. Khas… [+3455 chars]"}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'JON GAMBRELL / AP', 'title': 'Saudi Arabia Threatens ‘Greater Action’ If Riyadh Is Punished Over Writer’s Disappearance', 'description': 'Turkish officials say they fear a Saudi hit team killed and dismembered Jamal Khashoggi', 'url': 'http://time.com/5424524/saudi-arabia-jamal-khashoggi-sanctions/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/10/gettyimages-1047989918.jpg?quality=85', 'publishedAt': '2018-10-15T09:28:34Z', 'content': '(DUBAI, United Arab Emirates) — Saudi Arabia has threatened to retaliate for any sanctions imposed against it after President Donald Trump said the oil-rich kingdom deserves “severe punishment” if it is responsible for the disappearance and suspected murder o… [+5551 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Exclusive: Turkish police believe Saudi journalist Khashoggi was killed in consulate - sources', 'description': '"The initial assessment of the Turkish police is that Mr. Khashoggi has been killed at the consulate of Saudi Arabia in Istanbul. The Turkish sources did not say how they believed the killing was carried out. A Saudi source at the consulate denied that Khasho…', 'url': 'https://www.yahoo.com/news/exclusive-turkish-police-believe-saudi-journalist-khashoggi-killed-002218977.html', 'urlToImage': 'https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png', 'publishedAt': '2018-10-07T00:22:18Z', 'content': "By Orhan Coskun ANKARA (Reuters) - Turkish authorities believe that prominent Saudi journalist Jamal Khashoggi, who disappeared four days ago after entering Saudi Arabia's consulate in Istanbul, was killed inside the consulate, two Turkish sources said on Sat… [+4927 chars]"}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'John Haltiwanger', 'title': 'Trump officials dodge questions on US support for Saudi Arabia amid Khashoggi crisis', 'description': 'Senior Trump administration officials dodged a question on US support for Saudi Arabia as they announced new sanctions against Iran. The developments came amid the ongoing investigation into the disappearance of Saudi journalist Jamal Khashoggi. The sanctions…', 'url': 'https://www.businessinsider.com/jamal-khashoggi-saudi-arabia-crisis-trump-officials-questions-2018-10', 'urlToImage': 'https://amp.businessinsider.com/images/5bbe194ca4cb6238a24666e9-1920-960.jpg', 'publishedAt': '2018-10-16T20:15:25Z', 'content': 'Senior Trump administration officials on Tuesday dodged a question on US support for Saudi Arabia as they announced new sanctions against Iran. The developments came amid the backdrop of an ongoing investigation into the disappearance of Saudi journalist Jama… [+3844 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Apple Watch, hired jet, mystery vehicle figure in search for missing Saudi dissident', 'description': "Khashoggi, a veteran Saudi journalist and newspaper editor, had lived in exile in Washington for more than a year, writing a column for the Washington Post in which he regularly criticized his country's crackdown on dissent, its war in Yemen and sanctions imp…", 'url': 'https://www.yahoo.com/news/apple-watch-hired-jet-mystery-vehicle-figure-search-142913744.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/hkVcHsTux.yFHl9iX_wYoQ--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2018-10-10T190223Z_4_LYNXNPEE9919S_RTROPTP_2_SAUDI-POLITICS-DISSIDENT.JPG', 'publishedAt': '2018-10-10T19:02:23Z', 'content': 'ISTANBUL (Reuters) - Jamal Khashoggi believed he was safe in Turkey. Khashoggi, a veteran Saudi journalist and newspaper editor, had lived in exile in Washington for more than a year, writing a column for the Washington Post in which he regularly criticized h… [+14039 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Trump: concerned about reports of Saudi journalist missing in Turkey', 'description': 'U.S. President Donald Trump said on Monday he was concerned about reports of Saudi Arabian journalist Jamal Khashoggi, who has been missing since last week and Turkish sources have said that authorities believe he was killed inside the Saudi consulate in Ista…', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-trump/trump-concerned-about-reports-of-saudi-journalist-missing-in-turkey-idUSKCN1MI298', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181008&t=2&i=1312643825&w=1200&r=LYNXNPEE971BG', 'publishedAt': '2018-10-08T21:27:03Z', 'content': 'WASHINGTON (Reuters) - U.S. President Donald Trump said on Monday he was concerned about reports of Saudi Arabian journalist Jamal Khashoggi, who has been missing since last week and Turkish sources have said that authorities believe he was killed inside the … [+283 chars]'}, {'source': {'id': 'the-washington-post', 'name': 'The Washington Post'}, 'author': 'https://www.facebook.com/PhilipRuckerWP, https://www.facebook.com/anne.gearan', 'title': "Two princes: Kushner now faces a reckoning for Trump's bet on the Saudi heir - Washington Post", 'description': "Washington Post Two princes: Kushner now faces a reckoning for Trump's bet on the Saudi heir Washington Post When President Trump chose Riyadh to make his debut on the world stage last year, he was placing a bet on Saudi Arabia, which serenaded him with milit…", 'url': 'https://www.washingtonpost.com/politics/two-princes-kushner-now-faces-a-reckoning-for-trumps-bet-on-the-saudi-heir/2018/10/14/6eaeaafc-ce46-11e8-a3e6-44daa3d35ede_story.html', 'urlToImage': 'https://www.washingtonpost.com/resizer/Hd2lwqkQOyFKazskX8L_FALLx-E=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JDZYCWRJK4I6RIRH7UVQBFDGXQ.jpg', 'publishedAt': '2018-10-14T21:48:19Z', 'content': 'When President Trump chose Riyadh to make his debut on the world stage last year, he was placing a bet on Saudi Arabia, which serenaded him with military bands, dazzled him with a flyover of fighter jets and regaled him with a traditional sword dance. The mas… [+11104 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Britain asks Saudis to explain what happened to missing journalist', 'description': "LONDON (Reuters) - Britain's foreign minister Jeremy Hunt called on Saudi Arabia to explain what happened to the journalist Jamal Khashoggi, who has been missing since he visited the Saudi consulate in Istanbul last week. The disappearance of Khashoggi, previ…", 'url': 'https://www.yahoo.com/news/britain-asks-saudis-explain-happened-missing-journalist-132233189.html', 'urlToImage': 'https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png', 'publishedAt': '2018-10-09T13:22:33Z', 'content': "LONDON (Reuters) - Britain's foreign minister Jeremy Hunt called on Saudi Arabia to explain what happened to the journalist Jamal Khashoggi, who has been missing since he visited the Saudi consulate in Istanbul last week. The disappearance of Khashoggi, previ… [+507 chars]"}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'U.S. Treasury Secretary Mnuchin still plans to attend upcoming Saudi summit', 'description': 'U.S. Treasury Secretary Steve Mnuchin is still planning to attend an upcoming summit in Saudi Arabia despite the controversy over the disappearance of Saudi journalist and political dissident Jamal Khashoggi, White House economic adviser Larry Kudlow said on …', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-mnuchin/u-s-treasury-secretary-mnuchin-still-plans-to-attend-upcoming-saudi-summit-idUSKCN1MO0K0', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181014&t=2&i=1314643659&w=1200&r=LYNXNPEE9D0GF', 'publishedAt': '2018-10-14T14:08:50Z', 'content': 'WASHINGTON (Reuters) - U.S. Treasury Secretary Steve Mnuchin is still planning to attend an upcoming summit in Saudi Arabia despite the controversy over the disappearance of Saudi journalist and political dissident Jamal Khashoggi, White House economic advise… [+336 chars]'}, {'source': {'id': 'bloomberg', 'name': 'Bloomberg'}, 'author': None, 'title': "Missing Saudi Dissident Puts Prince's US Rapport in Spotlight - Bloomberg", 'description': "Bloomberg Missing Saudi Dissident Puts Prince's US Rapport in Spotlight Bloomberg As the mystery continues to swirl around missing Saudi dissident Jamal Khashoggi, what's already become clear is how much is at stake for Saudi Arabia's young leader and a forei…", 'url': 'https://www.bloomberg.com/tosv2.html?vid=&uuid=de4fa220-cc9e-11e8-8841-27e0aa3e058a&url=L25ld3MvYXJ0aWNsZXMvMjAxOC0xMC0xMC9taXNzaW5nLXNhdWRpLWRpc3NpZGVudC1wdXRzLXByaW5jZS1zLXUtcy1yYXBwb3J0LWluLXNwb3RsaWdodA==', 'urlToImage': None, 'publishedAt': '2018-10-10T14:31:53Z', 'content': "To continue, please click the box below to let us know you're not a robot."}, {'source': {'id': 'the-washington-post', 'name': 'The Washington Post'}, 'author': None, 'title': 'Trump reluctant to curb arms sales to Saudi Arabia in response to missing journalist - Washington Post', 'description': 'Washington Post Trump reluctant to curb arms sales to Saudi Arabia in response to missing journalist Washington Post President Trump on Wednesday appeared reluctant to consider blocking arms sales to Saudi Arabia in response to the disappearance last week of …', 'url': 'https://www.washingtonpost.com/politics/trump-reluctant-to-curb-arm-sales-to-saudi-arabia-in-response-to-missing-journalist/2018/10/11/85c71212-cd4a-11e8-a360-85875bac0b1f_story.html', 'urlToImage': 'https://www.washingtonpost.com/resizer/Qr1W56Tkjo2kjSKgPBcwc7c4amM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6YA2WJWLLUI6RLIKBYA67OR4YE.jpg', 'publishedAt': '2018-10-11T12:18:32Z', 'content': 'President Trump on Wednesday appeared reluctant to consider blocking arms sales to Saudi Arabia in response to the disappearance last week of a Washington Post columnist after he entered the Saudi Consulate in Istanbul. The Washington Post reported Wednesday … [+2348 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'The Latest: Pompeo, Saudi crown prince meet over Khashoggi', 'description': 'ISTANBUL (AP) — The Latest on the disappearance of a Saudi writer who Turkish officials fear was killed inside the Saudi Consulate in Istanbul (all times local):', 'url': 'https://www.yahoo.com/news/latest-pompeo-lands-saudi-arabia-meet-king-065733720.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/IeZ.kkUYIbivz6x8dn8azw--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/9a765e9331aa48d79d79ac23c5f6f2f6.jpg', 'publishedAt': '2018-10-16T12:19:44Z', 'content': 'ISTANBUL (AP) The Latest on the disappearance of a Saudi writer who Turkish officials fear was killed inside the Saudi Consulate in Istanbul (all times local): 3:10 p.m. U.S. Secretary of State Mike Pompeo has met with Saudi Crown Prince Mohammed bin Salman o… [+6952 chars]'}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Emma Graham-Harrison', 'title': 'Jamal Khashoggi: Labour slams government’s response as ‘too little, too late’', 'description': 'Emily Thornberry ramps up pressure on government as officials head for conference in Saudi Arabia Britain must hold the Saudis to account for Jamal Khashoggi | Emily Thornberry Labour has launched a blistering attack on the government over its response to the…', 'url': 'https://www.theguardian.com/world/2018/oct/13/labour-slams-government-over-khashoggi-response-emily-thornberry', 'urlToImage': 'https://i.guim.co.uk/img/media/e60a840f9ac0824c544a3df3cacc8b7a447e0e26/0_234_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZjZlYzA2YWNlZGUwZWRmMDNiMDM3MmE1Y2VkZWJmZTIvdG8tZGVmYXVsdC5wbmc&s=8ed7339a0f022e007687a710c7267435', 'publishedAt': '2018-10-13T17:17:40Z', 'content': 'Labour has launched a blistering attack on the government over its response to the presumed murder of Saudi journalist Jamal Khashoggi, as pressure mounts on officials heading to Saudi Arabia for a conference. US President Donald Trump vowed severe punishment… [+3899 chars]'}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'Fay Abuelgasim, SUZAN FRASER and JON GAMBRELL / AP', 'title': 'Turkey and Saudi Arabia to Conduct a Joint ‘Inspection’ of the Consulate Where Journalist Jamal Khashoggi Went Missing', 'description': 'Turkey and Saudi Arabia will conduct a joint "inspection" of the Saudi Consulate in Istanbul, where journalist Jamal Khashoggi went missing', 'url': 'http://time.com/5424750/turkey-saudi-arabia-consulate-inspection/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/10/saudi-arabia-turkey-consulate-inspection.jpg?quality=85', 'publishedAt': '2018-10-15T14:49:43Z', 'content': '(ISTANBUL) — Turkey and Saudi Arabia are expected to conduct a joint “inspection” on Monday of the Saudi Consulate in Istanbul, where Saudi journalist Jamal Khashoggi went missing nearly two weeks ago, Turkish authorities said. The announcement from an offici… [+6038 chars]'}, {'source': {'id': 'the-washington-post', 'name': 'The Washington Post'}, 'author': 'https://www.facebook.com/erinmichellecunningham, https://www.facebook.com/byaaroncdavis, https://www.facebook.com/tamer.elghobashy', 'title': 'Suspects in disappearance of Khashoggi linked to Saudi security services - Washington Post', 'description': 'Washington Post Suspects in disappearance of Khashoggi linked to Saudi security services Washington Post Three days before Saudi Crown Prince Mohammed bin Salman arrived in the United States earlier this year for a nationwide tour, another Saudi traveler who …', 'url': 'https://www.washingtonpost.com/world/suspects-in-disappearance-of-khashoggi-linked-to-saudi-security-services/2018/10/16/8171e734-d199-11e8-a4db-184311d27129_story.html', 'urlToImage': 'https://www.washingtonpost.com/resizer/pLPCG3goyiehLrDtXp_EFxdIQoI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NI2ER6WRW4I6RA6WFEP45LJKWE.jpg', 'publishedAt': '2018-10-17T02:44:35Z', 'content': 'Three days before Saudi Crown Prince Mohammed bin Salman arrived in the United States earlier this year for a nationwide tour, another Saudi traveler who identifies online as a member of the Saudi Royal Guard also arrived in Washington, passport records show.… [+7599 chars]'}, {'source': {'id': None, 'name': 'Boingboing.net'}, 'author': 'Xeni Jardin', 'title': 'Saudi prince MBS ordered operation to lure and detain Jamal Khashoggi, U.S. intelligence intercepts reveal', 'description': "Saudi Arabia's Crown Prince Mohammed bin Salman ordered an operation to lure Washington Post contributing journalist Jamal Khashoggi back to Saudi Arabia where he was to be detained, U.S. intercepts show. The whole torture, dismemberment, and death inside the…", 'url': 'https://boingboing.net/2018/10/10/saudi-prince-mbs-ordered-opera.html', 'urlToImage': 'https://media.boingboing.net/wp-content/uploads/2018/10/kh.jpg', 'publishedAt': '2018-10-11T00:29:47Z', 'content': "Saudi Arabia's Crown Prince Mohammed bin Salman ordered an operation to lure Washington Post contributing journalist Jamal Khashoggi back to Saudi Arabia where he was to be detained, U.S. intercepts show. The whole torture, dismemberment, and death inside the… [+4123 chars]"}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'Associated Press', 'title': 'Trump Says He Will Speak With Saudi Arabia’s King Salman About Missing Journalist Jamal Khashoggi', 'description': "President Donald Trump says he will speak with Saudi Arabia's King Salman about the missing journalist and U.S. resident, Jamal Khashoggi.", 'url': 'http://time.com/5423878/trump-saudi-arabia/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/10/trump-king-salman-jamal-khashoggi.jpg?quality=85', 'publishedAt': '2018-10-12T21:44:49Z', 'content': '(ANKARA, Turkey) — President Donald Trump says he will soon speak with Saudi Arabia’s King Salman about the disappearance of journalist and U.S. resident Jamal Khashoggi. Khashoggi, a critic of the Saudi government, went missing more than a week ago after ent… [+555 chars]'}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'FAY ABUELGASIM, SUZAN FRASER and JON GAMBRELL / AP', 'title': 'Turkish Official Says Police Found Evidence of Jamal Khashoggi’s Death at Saudi Consulate', 'description': 'Police searching the Saudi Consulate found evidence that Saudi writer Jamal Khashoggi was killed there, said a high-level Turkish official.', 'url': 'http://time.com/5426328/turkey-evidence-jamal-khashoggi-death/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/10/saudi-consulate-istanbul.jpg?quality=85', 'publishedAt': '2018-10-16T18:39:47Z', 'content': '(ISTANBUL) — Police searching the Saudi Consulate found evidence that Saudi writer Jamal Khashoggi was killed there, a high-level Turkish official said Tuesday, and authorities appeared ready to also search the nearby residence of the consul general after the… [+5639 chars]'}]}