{'status': 'ok', 'totalResults': 14504, 'articles': [{'source': {'id': None, 'name': 'Qz.com'}, 'author': 'Natasha Frost', 'title': 'Recordings may prove Jamal Khashoggi was killed inside Saudi consulate', 'description': 'Saudi dissident Jamal Khashoggi went into his country’s consulate in Istanbul to get the paperwork that he needed to marry his Turkish fiancée, Hatice Cengiz.…', 'url': 'https://qz.com/1422564/audio-and-video-indicate-jamal-khashoggi-was-killed-in-saudi-consulate/', 'urlToImage': 'https://cms.qz.com/wp-content/uploads/2018/10/Jamal-Khashoggi-feared-murdered-in-Turkey.jpg?quality=75&strip=all&w=1400', 'publishedAt': '2018-10-12T16:35:53Z', 'content': 'Saudi dissident Jamal Khashoggi went into his countrys consulate in Istanbul to get the paperwork that he needed to marry his Turkish fiancée, Hatice Cengiz. He hasnt been seen since. The mystery of the disappearance of the Washington Post columnist has spark… [+1810 chars]'}, {'source': {'id': 'the-telegraph', 'name': 'The Telegraph'}, 'author': 'Raf Sanchez', 'title': "The theory is dubious - but blaming Jamal Khashoggi's death on a botched interrogation is a convenient way out", 'description': 'For the first 13 days of Jamal Khashoggi&rsquo;s disappearance, Saudi Arabia held fast to its official position:', 'url': 'https://www.telegraph.co.uk/news/2018/10/16/theory-dubious-blaming-jamal-khashoggis-death-botched-interrogation/', 'urlToImage': 'https://www.telegraph.co.uk/content/dam/news/2018/10/16/TELEMMGLPICT000177458172-xlarge_trans_NvBQzQNjv4Bq1TJOa7BZ2Re4vzncv8bVr5IJUf7Hyxq67IAaSz0vTU0.jpeg', 'publishedAt': '2018-10-16T10:48:21Z', 'content': 'F or the first 13 days of Jamal Khashoggis disappearance, Saudi Arabia held fast to its official position: We had no involvement; he left the consulate safely; any suggestion we are responsible is a political smear. But last night things began to shift. Under… [+441 chars]'}, {'source': {'id': 'the-times-of-india', 'name': 'The Times of India'}, 'author': None, 'title': "'Turkey to search Saudi consulate on Monday'", 'description': 'The development comes after a Saudi delegation of a dozen officials arrived in Turkey while Saudi King Salman and Turkish President Recep Tayyip Erdogan at the weekend discussed the case in their first telephone talks on the controversy.', 'url': 'https://timesofindia.indiatimes.com/world/middle-east/jamal-khashoggi-case-turkey-to-search-saudi-arabia-consulate-on-monday-diplomatic-source-says/articleshow/66216895.cms', 'urlToImage': 'https://static.toiimg.com/thumb/msid-66216961,width-1070,height-580,imgsize-1278478,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg', 'publishedAt': '2018-10-15T10:45:03Z', 'content': 'ANKARA: Turkey will search the Saudi consulate in Istanbul later on Monday as part of an investigation into the disappearance of prominent journalist Jamal Khashoggi, a Turkish diplomatic source said. "It is expected that a search will take place towards the … [+1640 chars]'}, {'source': {'id': None, 'name': 'Vox.com'}, 'author': 'Alexia Underwood', 'title': 'All the companies that have cut ties with Saudi Arabia over Khashoggi’s disappearance', 'description': 'The journalist disappeared last week after entering the Saudi Consulate in Istanbul.', 'url': 'https://www.vox.com/2018/10/12/17967492/jamal-khashoggi-saudi-arabia-journalist-disappeared-companies', 'urlToImage': 'https://cdn.vox-cdn.com/thumbor/W9ojmhbQh41UojLwLb-mXLjiPIs=/0x104:4701x2565/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13260835/GettyImages_1051869750.jpg', 'publishedAt': '2018-10-12T17:00:03Z', 'content': 'Richard Branson has pulled out of several projects. Last Tuesday, a well-known Saudi Arabian journalist and columnist for the Washington Post walked into the Saudi Consulate in Istanbul, Turkey. No one has seen him since. Jamal Khashoggi was an outspoken crit… [+2376 chars]'}, {'source': {'id': None, 'name': 'Qz.com'}, 'author': 'John Detrixhe', 'title': 'These columns allegedly spurred Saudi Arabia to kill journalist Jamal Khashoggi', 'description': 'Turkish officials say Washington Post contributor Jamal Khashoggi—a high-profile critic of Saudi crown prince Mohammed bin Salman—was murdered while visiting the kingdom’s consulate in Istanbul,…', 'url': 'https://qz.com/1416307/khashoggis-columns-allegedly-spurred-saudi-arabia-to-murder-him/', 'urlToImage': 'https://cms.qz.com/wp-content/uploads/2018/10/Jamal-Khashoggi-feared-murdered-in-Turkey.jpg?quality=75&strip=all&w=1400', 'publishedAt': '2018-10-07T14:39:45Z', 'content': 'Turkish officials say Washington Post contributor Jamal Khashoggia high-profile critic of Saudi crown prince Mohammed bin Salman was murdered while visiting the kingdoms consulate in Istanbul, according to multiple news outlets. Saudi Arabia has denied the al… [+3417 chars]'}, {'source': {'id': None, 'name': 'Qz.com'}, 'author': 'Hanna Kozlowska', 'title': 'Here are the apps you use every day that are backed by Saudi money', 'description': 'With the disappearance of Saudi journalist Jamal Khashoggi, the world’s eyes are turned to Saudi Arabia and its ruling royal family, who are suspected of…', 'url': 'https://qz.com/1423634/apps-you-use-every-day-that-are-backed-by-saudi-money/', 'urlToImage': 'https://cms.qz.com/wp-content/uploads/2018/10/RTS231TY-e1539540923840.jpg?quality=75&strip=all&w=1400', 'publishedAt': '2018-10-14T19:06:39Z', 'content': 'With the disappearance of Saudi journalist Jamal Khashoggi, the worlds eyes are turned to Saudi Arabia and its ruling royal family, who are suspected of ordering his assassination earlier this month. Beyond its strong ties to the United States government, Sau… [+2177 chars]'}, {'source': {'id': None, 'name': 'Qz.com'}, 'author': 'Nikhil Sonnad', 'title': 'The plausible, wild theory of how Jamal Khashoggi could have recorded his own death', 'description': 'Earlier today (Oct. 13) Sabah, a pro-government Turkish newspaper, reported that Turkish officials have an audio recording of the torture and murder of Jamal Khashoggi,…', 'url': 'https://qz.com/1423401/jamal-khashoggi-the-plausible-wild-theory-of-how-the-journalist-could-have-recorded-his-own-death/', 'urlToImage': 'https://cms.qz.com/wp-content/uploads/2018/10/Jamal-Khashoggi-cctv.jpg?quality=75&strip=all&w=1400', 'publishedAt': '2018-10-13T16:30:47Z', 'content': 'Earlier today (Oct. 13) Sabah, a pro-government Turkish newspaper, reported that Turkish officials have an audio recording of the torture and murder of Jamal Khashoggi, a Saudi journalist who has gone missing. The source of that audio, the newspaper says, is … [+2733 chars]'}, {'source': {'id': None, 'name': 'Qz.com'}, 'author': 'Natasha Frost', 'title': 'The full timeline of Jamal Khashoggi’s disappearance and the morphing Saudi response', 'description': 'Just over two weeks ago, Saudi dissident and Washington Post journalist Jamal Khashoggi vanished after going into the Saudi consulate in Istanbul. His disappearance has…', 'url': 'https://qz.com/1427352/the-timeline-of-jamal-khashoggis-disappearance-and-alleged-murder/', 'urlToImage': 'https://cms.qz.com/wp-content/uploads/2018/10/Jamal-Khashoggi-feared-murdered-in-Turkey.jpg?quality=75&strip=all&w=1400', 'publishedAt': '2018-10-17T22:15:37Z', 'content': 'Just over two weeks ago, Saudi dissident and Washington Post journalist Jamal Khashoggi vanished after going into the Saudi consulate in Istanbul. His disappearance has now evolved into a full-blown international crisis. Throughout it all, the Saudi governmen… [+11010 chars]'}, {'source': {'id': 'al-jazeera-english', 'name': 'Al Jazeera English'}, 'author': 'Alan Fisher', 'title': 'Major business leaders boycott Saudi summit over Khashoggi case', 'description': "The World Bank president, the head of Uber and CNN all withdraw from 'Davos in the Desert' conference, but the US treasury secretary still plans to attend, for now.", 'url': 'https://www.aljazeera.com/news/2018/10/major-business-leaders-boycott-saudi-summit-khashoggi-case-181013121304654.html', 'urlToImage': '/mritems/images/2018/10/13/665003303001_5848345119001_5848337300001-th.jpg', 'publishedAt': '2018-10-13T12:13:04Z', 'content': 'A growing number of business figures and companies have said they will boycott an important investor conference in Saudi Arabia later this month in reaction to the disappearance of Saudi dissident and journalist, Jamal Khashoggi. The World Bank president, Ube… [+286 chars]'}, {'source': {'id': 'al-jazeera-english', 'name': 'Al Jazeera English'}, 'author': None, 'title': 'Where does the Jamal Khashoggi case leave Saudi Arabia?', 'description': 'Reports say Turkey and US have video and audio recordings that prove Saudi journalist was murdered in Saudi consulate.', 'url': 'https://www.aljazeera.com/programmes/insidestory/2018/10/jamal-khashoggi-case-leave-saudi-arabia-181012181318138.html', 'urlToImage': None, 'publishedAt': '2018-10-12T19:44:30Z', 'content': None}, {'source': {'id': 'al-jazeera-english', 'name': 'Al Jazeera English'}, 'author': 'Jamal Elshayyal', 'title': 'Missing Saudi journalist Khashoggi supporters rally in Turkey', 'description': "Supporters call for the Washington Post columnist's release outside Saudi Arabia's consulate in Istanbul from where he went missing on Tuesday.", 'url': 'https://www.aljazeera.com/news/2018/10/missing-saudi-journalist-khashoggi-supporters-rally-turkey-181006111842938.html', 'urlToImage': '/mritems/images/2018/10/6/665003303001_5845258203001_5845256871001-th.jpg', 'publishedAt': '2018-10-06T11:18:42Z', 'content': "Supporters of missing Saudi journalist Jamal Khashoggi have rallied outside Saudi Arabia's consulate in Istanbul and called for his release. Khashoggi disappeared on Tuesday after entering the compound - but there are conflicting reports about where he is. Sa… [+144 chars]"}, {'source': {'id': 'al-jazeera-english', 'name': 'Al Jazeera English'}, 'author': None, 'title': 'US steps up pressure on Saudi Arabia over Khashoggi disappearance', 'description': 'Will the Turkish allegations of murder be a turning point in relations between the allies?', 'url': 'https://www.aljazeera.com/programmes/insidestory/2018/10/steps-pressure-saudi-arabia-khashoggi-disappearance-181009165604148.html', 'urlToImage': None, 'publishedAt': '2018-10-09T20:41:07Z', 'content': None}, {'source': {'id': 'al-jazeera-english', 'name': 'Al Jazeera English'}, 'author': 'William Roberts', 'title': 'US outcry grows over Khashoggi with lawmakers demanding action', 'description': "Analysts say Saudi journalist's suspected assassination likely to mark a turning point in US-Saudi relations.", 'url': 'https://www.aljazeera.com/news/2018/10/outcry-grows-khashoggi-lawmakers-demanding-action-181011044018573.html', 'urlToImage': 'https://www.aljazeera.com/mritems/Images/2018/10/9/538a6f411f9f4e44b70b791df7650a9b_18.jpg', 'publishedAt': '2018-10-11T04:59:58Z', 'content': 'Washington, DC - A bipartisan and influential group of US senators called on President Donald Trump to investigate and potentially sanction Saudi Arabia under US human rights law for the disappearance and alleged murder of Saudi journalist Jamal Khashoggi. In… [+8652 chars]'}, {'source': {'id': 'al-jazeera-english', 'name': 'Al Jazeera English'}, 'author': 'Al Jazeera', 'title': "UK, France and Germany call for 'credible' Khashoggi probe", 'description': "Three countries say those responsible for Khashoggi's disappearance and suspected death must be 'held to account.'", 'url': 'https://www.aljazeera.com/news/2018/10/uk-france-germany-call-credible-khashoggi-probe-181014152935691.html', 'urlToImage': 'https://www.aljazeera.com/mritems/Images/2018/10/12/9b67f02d4c384e15803f5bc9323e9d0a_18.jpg', 'publishedAt': '2018-10-14T16:53:17Z', 'content': 'The United Kingdom, France and Germany have called on Saudi and Turkish authorities "to provide a complete and detailed response" to the disappearance of prominent Saudi journalist and critic Jamal Khashoggi, foreign ministers from the three countries said in… [+2224 chars]'}, {'source': {'id': None, 'name': 'Marketwatch.com'}, 'author': 'MarketWatch', 'title': 'NewsWatch: Here’s why stock-market investors suddenly freaked out over rising bond yields this week', 'description': 'Rising bond yields appear to have given stock-market investors a fright this week. There may be good reason, says one economist, in our call of the day.', 'url': 'https://www.marketwatch.com/story/heres-why-stock-market-investors-suddenly-freaked-out-over-rising-bond-yields-this-week-2018-10-12', 'urlToImage': 'https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png', 'publishedAt': '2018-10-12T13:00:15Z', 'content': 'Rising bond yields appear to have given stock-market investors a fright this week. There may be good reason, says one economist, in our call of the day. See full story. During a stock-market selloff, how would you invest $100,000? Should you consider stocks, … [+841 chars]'}, {'source': {'id': None, 'name': 'Marketwatch.com'}, 'author': 'MarketWatch', 'title': 'NewsWatch: Forget the Wall Street carnage. To read the economy, look at how much Americans are eating out', 'description': 'The carnage on Wall Street last week surely rattled investors, but on Main Street the good times aren’t about to end. Why it’s not time to panic.', 'url': 'https://www.marketwatch.com/story/forget-the-wall-street-carnage-to-read-the-economy-look-at-how-much-americans-are-eating-out-2018-10-14', 'urlToImage': 'https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png', 'publishedAt': '2018-10-14T13:00:09Z', 'content': 'The carnage on Wall Street last week surely rattled investors, but on Main Street the good times arent about to end. Why its not time to panic. See full story. Trump says cancelling Saudi arms order over Khashoggi affair would be punishing ourselves President… [+834 chars]'}, {'source': {'id': None, 'name': 'Qz.com'}, 'author': 'Kabir Chibber', 'title': 'Investigators are focusing on Jamal Khashoggi’s Apple Watch', 'description': 'Jamal Khashoggi was wearing his black Apple Watch, which was connected to a mobile phone held by his fiancé, who was waiting outside the Saudi embassy in Istanbul.', 'url': 'https://qz.com/1420892/jamal-khashoggis-apple-watch-is-a-focus-of-his-murder-investigation/', 'urlToImage': 'https://cms.qz.com/wp-content/uploads/2018/10/RTS21TV5.jpg?quality=75&strip=all&w=1400', 'publishedAt': '2018-10-11T17:19:57Z', 'content': 'The Saudi dissident Jamal Khashoggi was living in Turkey in self-imposed exile when he walked into his countrys embassy in Istanbul on Oct. 2 and never walked out again. Turkish authorities think Khashoggi was murdered inside the embassy, which the Saudis dis… [+1944 chars]'}, {'source': {'id': None, 'name': 'Qz.com'}, 'author': 'Annabelle Timsit', 'title': 'The disappearance of Jamal Khashoggi highlights a horrible month for press freedom', 'description': 'This has been a bad month for press freedom around the world. Last week, prominent Saudi journalist Jamal Khashoggi went missing after entering the Saudi…', 'url': 'https://qz.com/1416852/the-disappearance-of-jamal-khashoggi-highlights-a-horrible-month-for-press-freedom/', 'urlToImage': 'https://cms.qz.com/wp-content/uploads/2018/10/This-has-been-a-horrible-year-for-press-freedom--e1538990387956.jpg?quality=75&strip=all&w=1400', 'publishedAt': '2018-10-08T11:29:13Z', 'content': 'This has been a bad month for press freedom around the world. Last week, prominent Saudi journalist Jamal Khashoggi went missing after entering the Saudi Arabian Consulate in Istanbul. Now Turkish officials say they believe that Khashoggi was murdered on the … [+3023 chars]'}, {'source': {'id': None, 'name': 'Qz.com'}, 'author': 'Annalisa Merelli', 'title': 'Saudi Arabia’s other critics are still at risk', 'description': 'The recent disappearance of Saudi journalist Jamal Khashoggi has sparked boycotts and upset statements from business and political leaders around the world. Emmanuel Macron expressed…', 'url': 'https://qz.com/1422350/jamal-khashoggi-and-saudi-arabias-imprisoned-dissidents/', 'urlToImage': 'https://cms.qz.com/wp-content/uploads/2018/10/RTX2AU5R-e1539370972711.jpg?quality=75&strip=all&w=1400', 'publishedAt': '2018-10-13T11:00:15Z', 'content': 'The recent disappearance of Saudi journalist Jamal Khashoggi has sparked boycotts and upset statements from business and political leaders around the world. Emmanuel Macron expressed concern, and Donald Trump told Fox, We dont like it. I dont like. No good. S… [+3630 chars]'}, {'source': {'id': None, 'name': 'Lefigaro.fr'}, 'author': 'Delphine Minoui', 'title': 'Jamal Khashoggi : Erdogan veut des explications de Riyad', 'description': "Pour la police turque, le journaliste saoudien aurait été tué dans le consulat d'Arabie saoudite à Istanbul.", 'url': 'http://www.lefigaro.fr/international/2018/10/07/01003-20181007ARTFIG00144-jamal-khashoggi-erdogan-veut-des-explications-de-riyad.php', 'urlToImage': 'https://i.f1g.fr/media/figaro/805x453_crop/2018/10/07/XVM7dc97a48-ca46-11e8-896c-7d05c73a49da.jpg', 'publishedAt': '2018-10-07T16:58:18Z', 'content': "Pour la police turque, le journaliste saoudien aurait été tué dans le consulat d'Arabie saoudite à Istanbul. Jamal Khashoggi a-t-il été assassiné dans l'enceinte du consulat saoudien d'Istanbul? Cinq jours après la mystérieuse disparition du journaliste saoud… [+824 chars]"}]}