{'status': 'ok', 'totalResults': 13924, 'articles': [{'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Turkish newspaper names 15 Saudis in missing journalist case', 'description': 'Turkish pro-government newspaper Sabah said on Wednesday it had identified a 15-member intelligence team it said was involved in the disappearance of prominent Saudi journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-turkey/turkish-newspaper-names-15-saudis-in-missing-journalist-case-idUSKCN1MK0J0', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181010&t=2&i=1313129755&w=1200&r=LYNXNPEE990DT', 'publishedAt': '2018-10-10T11:40:12Z', 'content': 'ISTANBUL (Reuters) - Turkish pro-government newspaper Sabah said on Wednesday it had identified a 15-member intelligence team it said was involved in the disappearance of prominent Saudi journalist Jamal Khashoggi. Khashoggi was last seen a week ago entering … [+1786 chars]'}, {'source': {'id': 'cbc-news', 'name': 'CBC News'}, 'author': 'Reuters', 'title': 'Jamal Khashoggi: Turkish paper claims audio exists of purported killing', 'description': 'A published report out of Turkey says missing journalist Jamal Khashoggi may have recorded on his Apple watch what happened after he entered the Saudi consulate in Istanbul earlier this month.', 'url': 'https://www.cbc.ca/news/world/saudi-khashoggi-missing-journalist-saudi-consulate-apple-watch-1.4861906', 'urlToImage': 'https://i.cbc.ca/1.4861909.1539430946!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/missing-writer-fearful-dissidents.jpg', 'publishedAt': '2018-10-13T11:44:14Z', 'content': "Turkey's investigation into the disappearance of prominent Saudi journalist Jamal Khashoggi has revealed recordings made on his Apple Watch purportedly indicating he was tortured and killed, a Turkish newspaper reported on Saturday. The report in the pro-gove… [+3096 chars]"}, {'source': {'id': 'cbc-news', 'name': 'CBC News'}, 'author': 'The Associated Press', 'title': "'High probability' journalist killed at Saudi consulate in Istanbul, Turkish official says", 'description': 'A friend of a prominent Saudi journalist who went missing in Istanbul said Sunday that officials told him to "make your funeral preparations" as the Washington Post contributor "was killed" at the Saudi consulate.', 'url': 'https://www.cbc.ca/news/world/jamal-khashoggi-killing-1.4854018', 'urlToImage': 'https://i.cbc.ca/1.4854034.1538928361!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/saudi-politics-dissident.jpg', 'publishedAt': '2018-10-07T18:34:15Z', 'content': 'A friend of a prominent Saudi journalist who went missing in Istanbul said Sunday that officials told him to "make your funeral preparations" as the Washington Post contributor "was killed" at the Saudi consulate. A Turkish official separately told The Associ… [+3627 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Turkey's Erdogan tells Saudis to prove missing journalist left Istanbul consulate", 'description': 'Turkish President Tayyip Erdogan on Monday called on Riyadh to prove its claim that Saudi Arabian journalist Jamal Khashoggi, who has been missing since last week, left the Saudi consulate in Istanbul.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident/turkeys-erdogan-tells-saudis-to-prove-missing-journalist-left-istanbul-consulate-idUSKCN1MI0X5', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181008&t=2&i=1312498219&w=1200&r=LYNXNPEE970JK', 'publishedAt': '2018-10-08T22:04:00Z', 'content': 'BUDAPEST/ANKARA (Reuters) - Turkish President Tayyip Erdogan on Monday called on Riyadh to prove its claim that Saudi Arabian journalist Jamal Khashoggi, who has been missing since last week, left the Saudi consulate in Istanbul. The disappearance of Khashogg… [+3147 chars]'}, {'source': {'id': None, 'name': 'Talkingpointsmemo.com'}, 'author': 'John Light', 'title': 'Today’s Agenda: Trump Tours Hurricane Damage, Faces Questions About Khashoggi', 'description': 'President Trump is in the Florida panhandle today, touring damage from Hurricane Michael; meanwhile, Secretary of State Pompeo is headed...', 'url': 'https://talkingpointsmemo.com/prime-beta/todays-agenda-trump-tours-hurricane-damage-faces-questions-about-khashoggi', 'urlToImage': '', 'publishedAt': '2018-10-15T14:08:19Z', 'content': 'Already a member? sign in What is Prime? Prime is the complete TPM experience. It brings you inside the newsroom with exclusive insights, updates and analysis behind the headlines and the bylines. In addition to exclusive content, members get access to our me… [+391 chars]'}, {'source': {'id': None, 'name': 'Estadao.com.br'}, 'author': None, 'title': 'Turquia tem provas obtidas por espionagem de que jornalista saudita foi morto, dizem jornais', 'description': "Jornal americano 'Washington Post' afirma que existência das evidências explica porque Ancara acusou tão rapidamente a família real saudita de ter assassinado jornalista crítico a ela em seu consulado em Istambul", 'url': 'https://internacional.estadao.com.br/noticias/geral,turquia-tem-provas-obtidas-por-espionagem-de-que-jornalista-saudita-foi-morto-dizem-jornais,70002545214', 'urlToImage': 'https://img.estadao.com.br/resources/jpg/6/0/1539178528506.jpg', 'publishedAt': '2018-10-12T19:23:00Z', 'content': 'ANCARA - O governo turco tem provas sobre a tortura e morte do jornalista saudita desaparecido Jamal Khashoggi, mas revelá-las acabaria por expor sua prática de espionagem a representações diplomáticas estrangeiras em seu território, segundo veículos de impre… [+4084 chars]'}, {'source': {'id': 'abc-news', 'name': 'ABC News'}, 'author': None, 'title': "Here's the news you missed this weekend - ABC News", 'description': "ABC News Here's the news you missed this weekend ABC News Hurricane Michael's death toll climbed to 17 on Saturday. First lady Melania Trump described her life inside the White House with her husband. President Trump calls for 'severe punishment' if Saudi Ara…", 'url': 'https://abcnews.go.com/US/news-missed-weekend/story?id%3D58493846', 'urlToImage': None, 'publishedAt': '2018-10-14T21:38:00Z', 'content': None}, {'source': {'id': None, 'name': 'Sueddeutsche.de'}, 'author': 'Süddeutsche.de GmbH, Munich, Germany', 'title': 'Verschwundener Journalist Khashoggi: Trump schickt Außenminister Pompeo zu saudischem König', 'description': 'Der Ton zwischen den USA und Saudi Arabien wird schärfer. Mike Pompeo soll nun persönlich bei König Salman vorsprechen und auf Aufklärung im Fall Khashoggi drängen.', 'url': 'https://www.sueddeutsche.de/politik/verschwundener-journalist-khashoggi-trump-schickt-aussenminister-pompeo-zu-saudischem-koenig-1.4171383', 'urlToImage': 'https://media-cdn.sueddeutsche.de/image/sz.1.4171406/1200x675?v=1539611657', 'publishedAt': '2018-10-15T13:39:26Z', 'content': 'US-Außenminister Pompeo soll persönlich beim saudischen König Salman vorsprechen, um zu klären, was mit dem Journalisten Jamal Khashoggi geschehen ist. Khashoggi, der als Kolumnist für die Washington Post gearbeitet hatte, hatte am 2. Oktober das saudische Ko… [+1262 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Turkey investigates disappearance of Saudi journalist, vows to find him', 'description': 'Turkish prosecutors have begun investigating the disappearance of prominent Saudi commentator Jamal Khashoggi, who has been missing for four days after entering the Saudi Consulate in Istanbul, and Ankara has vowed to uncover his whereabouts.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident/turkey-investigates-disappearance-of-saudi-journalist-vows-to-find-him-idUSKCN1MG0HU', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181006&t=2&i=1311932299&w=1200&r=LYNXNPEE950GR', 'publishedAt': '2018-10-06T17:12:12Z', 'content': 'ANKARA (Reuters) - Turkish prosecutors have begun investigating the disappearance of prominent Saudi commentator Jamal Khashoggi, who has been missing for four days after entering the Saudi Consulate in Istanbul, and Ankara has vowed to uncover his whereabout… [+2060 chars]'}, {'source': {'id': None, 'name': 'Indianexpress.com'}, 'author': 'Express Web Desk', 'title': 'Kim Jong Un, China trade war, Vladimir Putin and more: What Donald Trump told CBS News', 'description': 'Donald Trump touched upon topics like the case of missing Saudi journalist Jamal Khashoggi and his life as POTUS among other issues in his interview to CBS 60 Minutes.', 'url': 'https://indianexpress.com/article/world/kim-jong-un-china-trade-war-vladimir-putin-and-more-what-donald-trump-told-cbs-news-5402267/', 'urlToImage': 'https://images.indianexpress.com/2018/09/donald-trump-ap-759.jpg?w=759', 'publishedAt': '2018-10-15T05:13:48Z', 'content': 'The last time Trump appeared on the program, he had just been elected to the presidency in 2016 (File) “It was a little surreal to say I’m the president of the United States, but I think that’s true with everybody,” US President Donald Trump said during an in… [+3956 chars]'}, {'source': {'id': None, 'name': 'Indianexpress.com'}, 'author': 'AP', 'title': '‘I love the Saudis’: Donald Trump’s business ties to kingdom run deep', 'description': "Trump's ties to Saudi Arabia run long and deep, however, now those ties are under scrutiny as the president faces calls for a tougher response to the kingdom's govt. following the disappearance, and possible killing, of journalist Jamal Khashoggi.", 'url': 'https://indianexpress.com/article/world/i-love-the-saudis-donald-trumps-business-ties-to-kingdom-run-deep-5400282/', 'urlToImage': 'https://images.indianexpress.com/2018/10/trump-and-saudi-crown-prince-759.jpg?w=759', 'publishedAt': '2018-10-13T05:23:11Z', 'content': 'By: AP | New York | Published: October 13, 2018 10:53:11 am Donald Trump holds a chart of military hardware sales as he welcomes Saudi Arabia’s Crown Prince Mohammed bin Salman in the Oval Office earlier this year. (REUTERS) He’s booked hotel rooms and meetin… [+5812 chars]'}, {'source': {'id': None, 'name': 'Sueddeutsche.de'}, 'author': 'Süddeutsche.de GmbH, Munich, Germany', 'title': 'Saudischer Prinz in Deutschland: Dissident wirft Saudi-Arabien versuchte Verschleppung vor', 'description': 'Prinz Chalid bin Farhan al-Saud sagt, seine Regierung habe ihn in eine Botschaft in Ägypten locken wollen. Sie habe ihm ausrichten lassen, dort erwarte ihn ein Scheck.', 'url': 'https://www.sueddeutsche.de/politik/saudischer-prinz-in-deutschland-dissident-wirft-saudi-arabien-versuchte-verschleppung-vor-1.4171996', 'urlToImage': 'https://media-cdn.sueddeutsche.de/image/sz.1.4172000/1200x675?v=1539678675', 'publishedAt': '2018-10-16T09:33:17Z', 'content': 'Der in Deutschland lebende Dissident aus Saudi-Arabien Prinz Chalid bin Farhan al-Saud sagt der dpa, die saudische Regierung habe ihn in eine Botschaft in Ägypten locken wollen. Brisant ist diese Aussage, weil in der Türkei der kritische saudische Journalist … [+2586 chars]'}, {'source': {'id': None, 'name': 'Courrierinternational.com'}, 'author': None, 'title': 'Portrait. Jamal Khashoggi, un Saoudien à part', 'description': 'L’opposant saoudien qui aurait été tué dans le consulat de son pays à Istanbul était un véritable démocrate. Son meurtre n’aurait pas eu lieu, si Donald Trump n’était pas au pouvoir aux États-Unis, affirme le journaliste britannique David Hearst.', 'url': 'https://www.courrierinternational.com/article/portrait-jamal-khashoggi-un-saoudien-part', 'urlToImage': 'https://www.courrierinternational.com/sites/ci_master/files/styles/image_940/public/illustrations/thumbnails/rts248ss.jpg?itok=BH5rHrQE', 'publishedAt': '2018-10-08T14:13:57Z', 'content': 'Lopposant saoudien qui aurait été tué dans le consulat de son pays à Istanbul était un véritable démocrate. Son meurtre naurait pas eu lieu, si Donald Trump nétait pas au pouvoir aux États-Unis, affirme le journaliste britannique David Hearst. Jamal Khashoggi… [+1072 chars]'}, {'source': {'id': None, 'name': 'Indianexpress.com'}, 'author': 'AP', 'title': 'Mike Pompeo heads to Turkey as probe into Jamal Khashoggi case heats up', 'description': 'Saudi officials have called Turkish allegations that a team of 15 Saudi agents killed Khashoggi "baseless," but US media reports suggested that the kingdom may acknowledge the writer was killed at the consulate, as part of a botched interrogation.', 'url': 'https://indianexpress.com/article/world/mike-pompeo-heads-to-turkey-as-probe-into-jamal-khashoggi-case-heats-up-5405711/', 'urlToImage': 'https://images.indianexpress.com/2018/10/mike-759.jpg?w=759', 'publishedAt': '2018-10-17T05:54:30Z', 'content': 'By: AP | Ankara | Published: October 17, 2018 11:24:30 am US Secretary of State Mike Pompeo walks to the plane before leaving Riyadh, Saudi Arabia. (Source: Reuters) Police searching the Saudi Consulate found evidence that Saudi writer Jamal Khashoggi was kil… [+6782 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Image seen at risk over missing critic...', 'description': "The disappearance of a prominent critic of Saudi Arabia's rulers after entering the kingdom's Istanbul consulate risks severely tarnishing the reformist image of its de facto leader Crown Prince Mohammed bin Salman, experts say.  Riyadh has denied allegations…", 'url': 'https://www.yahoo.com/news/saudi-princes-image-seen-risk-over-missing-critic-004002173.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/68qaGeIEBzSh1L_HhSaOGQ--~B/aD03MTI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/77b4b9a378adb4dd9af1ac36c246f3c9474272cd.jpg', 'publishedAt': '2018-10-07T20:40:37Z', 'content': "Dubai (AFP) - The disappearance of a prominent critic of Saudi Arabia's rulers after entering the kingdom's Istanbul consulate risks severely tarnishing the reformist image of its de facto leader Crown Prince Mohammed bin Salman, experts say. Riyadh has denie… [+4854 chars]"}, {'source': {'id': 'associated-press', 'name': 'Associated Press'}, 'author': 'Jon Gambrell', 'title': "Turkey says joint 'inspection' planned at Consulate...", 'description': "DUBAI, United Arab Emirates (AP) — Saudi media on Monday echoed the kingdom's hard-line threat of retaliation for any sanctions over the disappearance and alleged death of Washington Post columnist Jamal Khashoggi, as demands grew for boycotts of the same int…", 'url': 'https://www.apnews.com/77d9ab2ec56f4de09290b86118511d98', 'urlToImage': 'https://storage.googleapis.com/afs-prod/media/media:dbb53bba78a8433d90d6aebbd88603b7/3000.jpeg', 'publishedAt': '2018-10-15T10:34:37Z', 'content': 'DUBAI, United Arab Emirates (AP) Saudi media on Monday echoed the kingdoms hard-line threat of retaliation for any sanctions over the disappearance and alleged death of Washington Post columnist Jamal Khashoggi, as demands grew for boycotts of the same intern… [+4647 chars]'}, {'source': {'id': None, 'name': 'Estadao.com.br'}, 'author': None, 'title': 'TV turca divulga imagens de jornalista saudita pouco antes de desaparecer em Istambul', 'description': 'Vídeos foram registrados por câmeras de segurança e mostram movimentações suspeitas ao redor do consulado da Arábia Saudita na capital turca; Riad nega alegações de que ordenou a morte do jornalista', 'url': 'https://internacional.estadao.com.br/noticias/geral,tv-turca-divulga-imagens-de-jornalista-saudita-pouco-antes-de-desaparecer-em-istambul,70002542156', 'urlToImage': 'https://img.estadao.com.br/resources/jpg/4/9/1539189181094.jpg', 'publishedAt': '2018-10-10T17:18:00Z', 'content': 'ISTAMBUL - O canal estatal turco TRT divulgou imagens nesta quarta-feira, 10, do grupo de inteligência saudita que acusa de ter assassinado o jornalista crítico a Riad Jamal Khashoggi, aumentando a pressão sobre a Arábia Saudita e a preocupação internacional … [+4589 chars]'}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Martin Chulov in Istanbul', 'title': 'Khashoggi case: CCTV disappears from Saudi consulate in Turkey', 'description': 'Security footage removed and Turkish staff told to go home on day missing journalist visits Security camera footage was removed from the Saudi consulate in Istanbul and Turkish staff were abruptly told to take a holiday on the day the dissident journalist Jam…', 'url': 'https://www.theguardian.com/world/2018/oct/09/khashoggi-case-cctv-disappears-from-saudi-consulate-in-turkey', 'urlToImage': 'https://i.guim.co.uk/img/media/d90ab85ab649ed97dc0f79deda418a68245b9c79/214_0_3270_1963/master/3270.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZDM1ODZhNWVmNTc4MTc1NmQyMWEzYjYzNWU1MTcxNDEvdGctZGVmYXVsdC5wbmc&s=2979cc6654661ec6fc3a487f75fdeefe', 'publishedAt': '2018-10-09T17:48:27Z', 'content': 'Security camera footage was removed from the Saudi consulate in Istanbul and Turkish staff were abruptly told to take a holiday on the day the dissident journalist Jamal Khashoggi disappeared while inside the building, it has emerged. A week after Khashoggi v… [+5770 chars]'}, {'source': {'id': None, 'name': 'Theblaze.com'}, 'author': 'Mike Ciandella', 'title': 'US intelligence intercepts suggest that Saudi Crown Prince was behind disappearance of journalist', 'description': "U.S. intelligence intercepts of Saudi officials suggested that Saudi Crown Prince Mohammed bin Salman was behind the disappearance of Washington Post columnist Jamal Khashoggi and that Khashoggi may have been killed during a botched kidnapping attempt.\r\nHere'…", 'url': 'https://www.theblaze.com/news/2018/10/11/us-intelligence-intercepts-suggest-that-saudi-crown-prince-was-behind-disappearance-of-journalist', 'urlToImage': 'https://www.theblaze.com/wp-content/uploads/2018/10/gettyimages-1047468404-1280x720.jpg', 'publishedAt': '2018-10-11T17:35:04Z', 'content': 'U.S. intelligence intercepts of Saudi officials suggested that Saudi Crown Prince Mohammed bin Salman was behind the disappearance of Washington Post columnist Jamal Khashoggi and that Khashoggi may have been killed during a botched kidnapping attempt. Here’s… [+2715 chars]'}, {'source': {'id': 'el-mundo', 'name': 'El Mundo'}, 'author': 'EFE', 'title': 'El reloj del periodista y disidente saudí Khashoggi grabó su asesinato', 'description': 'El reloj inteligente que llevaba el desaparecido periodista y disidente saudí Jamal Khashoggi cuando acudió al consulado de su país en Estambul el pasado día 2 grabó su asesinato,', 'url': 'http://www.elmundo.es/internacional/2018/10/13/5bc1c0d346163fc2318b457c.html', 'urlToImage': 'https://e00-elmundo.uecdn.es/assets/multimedia/imagenes/2018/10/13/15394245356515.jpg', 'publishedAt': '2018-10-13T10:02:20Z', 'content': 'Jamal Khashoggi, asesinado el pasao día 2, en una imagen tomada en 2014. MOHAMMED AL-SHAIKH / AFP 0 comentarios Comentar El reloj inteligente que llevaba el desaparecido periodista y disidente saudí Jamal Khashoggi cuando acudió al consulado de su país en Est… [+2711 chars]'}]}