{'status': 'ok', 'totalResults': 13924, 'articles': [{'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Trump says Saudi Arabia faces 'severe punishment' if Khashoggi was killed", 'description': 'U.S. President Donald Trump said in a CBS interview on Saturday that there would be "severe punishment" for Saudi Arabia if it turns out that missing journalist Jamal Khashoggi was killed in the Saudi consulate in Istanbul.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-trump/trump-says-saudi-arabia-faces-severe-punishment-if-khashoggi-was-killed-idUSKCN1MN0HJ', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181013&t=2&i=1314322790&w=1200&r=LYNXNPEE9C099', 'publishedAt': '2018-10-13T12:32:52Z', 'content': 'WASHINGTON (Reuters) - U.S. President Donald Trump said in a CBS interview on Saturday that there would be “severe punishment” for Saudi Arabia if it turns out that missing journalist Jamal Khashoggi was killed in the Saudi consulate in Istanbul. Khashoggi, a… [+357 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Turkish police leave Saudi consulate in Istanbul: witness', 'description': 'A team of Turkish police investigating the disappearance of Saudi journalist Jamal Khashoggi has left the Saudi consulate building in Istanbul, a Reuters witness said on Tuesday.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-investigatio/turkish-police-leave-saudi-consulate-in-istanbul-witness-idUSKCN1MQ05C', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315164148&w=1200&r=LYNXNPEE9F03Z', 'publishedAt': '2018-10-16T02:15:13Z', 'content': 'ISTANBUL (Reuters) - A team of Turkish police investigating the disappearance of Saudi journalist Jamal Khashoggi has left the Saudi consulate building in Istanbul, a Reuters witness said on Tuesday. Turkish police investigators had entered the consulate late… [+237 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Turkey's Erdogan says some material at Saudi consulate painted over", 'description': "Some materials at the Saudi consulate in Istanbul where journalist Jamal Khashoggi disappeared two weeks ago have been painted over, Turkey's President Tayyip Erdogan said on Tuesday.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-erdogan/turkeys-erdogan-says-some-material-at-saudi-consulate-painted-over-idUSKCN1MQ1CT', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315289728&w=1200&r=LYNXNPEE9F0W8', 'publishedAt': '2018-10-16T10:27:48Z', 'content': 'ANKARA (Reuters) - Some materials at the Saudi consulate in Istanbul where journalist Jamal Khashoggi disappeared two weeks ago have been painted over, Turkey’s President Tayyip Erdogan said on Tuesday. Speaking after Turkish police entered the consulate for … [+1111 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Saudi team probing journalist's disappearance leaves Istanbul consulate: witness", 'description': 'A Saudi team investigating the disappearance of journalist Jamal Khashoggi has left the Saudi consulate building in Istanbul, a Reuters witness said on Tuesday.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-team/saudi-team-probing-journalists-disappearance-leaves-istanbul-consulate-witness-idUSKCN1MQ0BH', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315193892&w=1200&r=LYNXNPEE9F09H', 'publishedAt': '2018-10-16T04:14:48Z', 'content': 'ISTANBUL (Reuters) - A Saudi team investigating the disappearance of journalist Jamal Khashoggi has left the Saudi consulate building in Istanbul, a Reuters witness said on Tuesday. A team of around 10 Turkish police investigators and a prosecutor had already… [+298 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'John Haltiwanger', 'title': 'Missing journalist Jamal Khashoggi had a complicated past involving interviews with Osama bin Laden and close ties to the Saudi royal family', 'description': 'Saudi journalist Jamal Khashoggi had a long, complicated career before he went missing in early October after entering the Saudi consulate in Istanbul. Khashoggi went from interviewing Osama bin Laden in the 1980s to becoming one of the most prominent journal…', 'url': 'https://www.businessinsider.com/missing-saudi-journalist-jamal-khashoggi-ties-to-osama-bin-laden-islamists-2018-10', 'urlToImage': 'https://amp.businessinsider.com/images/5bc031198053836302721556-2732-1366.jpg', 'publishedAt': '2018-10-15T21:22:33Z', 'content': 'Saudi journalist Jamal Khashoggi had a long, complicated career before he went missing in early October. Khashoggi, who was a US resident and wrote for The Washington Post, disappeared on October 2 after entering the Saudi consulate in Istanbul to obtain docu… [+6432 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Trump says he talked to Saudis at highest levels about missing journalist', 'description': 'President Donald Trump said on Wednesday he has talked to officials in Saudi Arabia at the highest levels about the disappearance of Saudi journalist Jamal Khashoggi and wants the United States to get to the bottom of the matter.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-trump/trump-says-he-talked-to-saudis-at-highest-levels-about-missing-journalist-idUSKCN1MK27Y', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181010&t=2&i=1313306729&w=1200&r=LYNXNPEE991HL', 'publishedAt': '2018-10-10T17:16:37Z', 'content': 'WASHINGTON (Reuters) - President Donald Trump said on Wednesday he has talked to officials in Saudi Arabia at the highest levels about the disappearance of Saudi journalist Jamal Khashoggi and wants the United States to get to the bottom of the matter. Khasho… [+1515 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'U.N. urges Turkey, Saudi Arabia to investigate journalist disappearance', 'description': 'The United Nations human rights office voiced deep concern on Tuesday at the "apparent enforced disappearance" and possible murder of Saudi journalist Jamal Khashoggi a week ago and urged the two countries to investigate.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-un/u-n-urges-turkey-saudi-arabia-to-investigate-journalist-disappearance-idUSKCN1MJ0VZ', 'urlToImage': 'https://s1.reutersmedia.net/resources/r/?m=02&d=20181009&t=2&i=1312818205&w=1200&r=LYNXNPEE980L2', 'publishedAt': '2018-10-09T10:00:11Z', 'content': 'GENEVA (Reuters) - The United Nations human rights office voiced deep concern on Tuesday at the “apparent enforced disappearance” and possible murder of Saudi journalist Jamal Khashoggi a week ago and urged the two countries to investigate. Turkish President … [+1193 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Former UK PM Blair says the disappearance of Saudi journalist is extremely troubling', 'description': 'Former British Prime Minister Tony Blair said on Thursday that the disappearance of journalist Jamal Khashoggi was extremely troubling and went against the spirit of the reforms advocated by Saudi Crown Prince Mohammed bin Salman.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-blair/former-uk-pm-blair-says-the-disappearance-of-saudi-journalist-is-extremely-troubling-idUSKCN1ML16S', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181011&t=2&i=1313559890&w=1200&r=LYNXNPEE9A0RE', 'publishedAt': '2018-10-11T09:42:45Z', 'content': 'LONDON (Reuters) - Former British Prime Minister Tony Blair said on Thursday that the disappearance of journalist Jamal Khashoggi was extremely troubling and went against the spirit of the reforms advocated by Saudi Crown Prince Mohammed bin Salman. Khashoggi… [+728 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Trump vows 'severe punishment' for Saudi Arabia if Khashoggi was killed", 'description': 'U.S. President Donald Trump said in a CBS interview on Saturday that there would be "severe punishment" for Saudi Arabia if it turns out that missing Saudi journalist Jamal Khashoggi was killed in the Saudi consulate in Istanbul.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-trump/trump-vows-severe-punishment-for-saudi-arabia-if-khashoggi-was-killed-idUSKCN1MN0HJ', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181013&t=2&i=1314329065&w=1200&r=LYNXNPEE9C099', 'publishedAt': '2018-10-13T13:02:15Z', 'content': 'WASHINGTON (Reuters) - U.S. President Donald Trump said in a CBS interview on Saturday that there would be “severe punishment” for Saudi Arabia if it turns out that missing Saudi journalist Jamal Khashoggi was killed in the Saudi consulate in Istanbul. Khasho… [+966 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Erdogan tells Saudi officials to prove missing journalist left consulate in Turkey', 'description': 'Turkish President Tayyip Erdogan on Monday called on Riyadh to prove its claim that the Saudi Arabian journalist Jamal Khashoggi, who has been missing since last week, left the Saudi consulate in Istanbul.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident/erdogan-tells-saudi-officials-to-prove-missing-journalist-left-consulate-in-turkey-idUSKCN1MI0X5', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181008&t=2&i=1312498219&w=1200&r=LYNXNPEE970JK', 'publishedAt': '2018-10-08T17:44:06Z', 'content': 'BUDAPEST/ANKARA (Reuters) - Turkish President Tayyip Erdogan on Monday called on Riyadh to prove its claim that the Saudi Arabian journalist Jamal Khashoggi, who has been missing since last week, left the Saudi consulate in Istanbul. The disappearance of Khas… [+2701 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Turkey's Erdogan tells Saudis to prove missing journalist left Istanbul consulate", 'description': 'Turkish President Tayyip Erdogan on Monday called on Riyadh to prove its claim that Saudi Arabian journalist Jamal Khashoggi, who has been missing since last week, left the Saudi consulate in Istanbul.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident/turkeys-erdogan-tells-saudis-to-prove-missing-journalist-left-istanbul-consulate-idUSKCN1MI0X5', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181008&t=2&i=1312498219&w=1200&r=LYNXNPEE970JK', 'publishedAt': '2018-10-08T22:04:00Z', 'content': 'BUDAPEST/ANKARA (Reuters) - Turkish President Tayyip Erdogan on Monday called on Riyadh to prove its claim that Saudi Arabian journalist Jamal Khashoggi, who has been missing since last week, left the Saudi consulate in Istanbul. The disappearance of Khashogg… [+3147 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Turkey says authorities have concrete information on missing Saudi journalist', 'description': "Turkish authorities have concrete information on the disappearance of prominent Saudi journalist Jamal Khashoggi, who has been missing for six days, a deputy chairman of Turkey's ruling AK Party said on Sunday.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-turkey/turkey-says-authorities-have-concrete-information-on-missing-saudi-journalist-idUSKCN1MH0H0', 'urlToImage': 'https://s4.reutersmedia.net/resources_v2/images/rcom-default.png', 'publishedAt': '2018-10-07T10:37:14Z', 'content': 'ANKARA (Reuters) - Turkish authorities have concrete information on the disappearance of prominent Saudi journalist Jamal Khashoggi, who has been missing for six days, a deputy chairman of Turkey’s ruling AK Party said on Sunday. Yasin Aktay told broadcaster … [+504 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Turkey to search Saudi consulate in Istanbul for missing journalist on Monday: NTV', 'description': 'Turkish authorities will search the Saudi consulate in Istanbul on Monday afternoon as part of an investigation into the disappearance of prominent journalist Jamal Khashoggi, broadcaster NTV said, citing diplomatic sources.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-turkey/turkey-to-search-saudi-consulate-in-istanbul-for-missing-journalist-on-monday-ntv-idUSKCN1MP0Y6', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181015&t=2&i=1314909068&w=1200&r=LYNXNPEE9E0IW', 'publishedAt': '2018-10-15T09:42:02Z', 'content': 'ANKARA (Reuters) - Turkish authorities will search the Saudi consulate in Istanbul on Monday afternoon as part of an investigation into the disappearance of prominent journalist Jamal Khashoggi, broadcaster NTV said, citing diplomatic sources. Khashoggi, a U.… [+277 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Turkish police will search Saudi consul's residence in Istanbul: NTV", 'description': "Turkish police will search the Saudi consul's residence in Istanbul, Turkish broadcaster NTV said on Tuesday, as part of the probe into the disappearance of Saudi journalist Jamal Khashoggi.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-residence/turkish-police-will-search-saudi-consuls-residence-in-istanbul-ntv-idUSKCN1MQ141', 'urlToImage': 'https://s4.reutersmedia.net/resources_v2/images/rcom-default.png', 'publishedAt': '2018-10-16T09:16:23Z', 'content': 'ISTANBUL (Reuters) - Turkish police will search the Saudi consul’s residence in Istanbul, Turkish broadcaster NTV said on Tuesday, as part of the probe into the disappearance of Saudi journalist Jamal Khashoggi. NTV also said that investigators are expected t… [+177 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Pompeo says Saudis committed to complete probe into journalist's disappearance", 'description': 'Saudi Arabia has committed to conducting a complete investigation into the disappearance of journalist Jamal Khashoggi, U.S. Secretary of State Mike Pompeo said on Wednesday before departing the kingdom for Turkey.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident/pompeo-says-saudis-committed-to-complete-probe-into-journalists-disappearance-idUSKCN1MR0G6', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181017&t=2&i=1315575135&w=1200&r=LYNXNPEE9G0CK', 'publishedAt': '2018-10-17T05:15:46Z', 'content': 'ANKARA (Reuters) - Saudi Arabia has committed to conducting a complete investigation into the disappearance of journalist Jamal Khashoggi, U.S. Secretary of State Mike Pompeo said on Wednesday before departing the kingdom for Turkey. Pompeo said he would meet… [+2983 chars]'}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Martin Pengelly in New York', 'title': "Trump vows 'severe punishment' if Saudis killed Jamal Khashoggi", 'description': 'President speaks in CBS interview to be shown on Sunday ‘There’s a lot at stake … because this man was a reporter’ Donald Trump does not want to “hurt jobs” by sanctioning Saudi Arabia over the disappearance of Jamal Khashoggi, but has nonetheless promised “s…', 'url': 'https://www.theguardian.com/world/2018/oct/13/donald-trump-jamal-khashoggi-saudi-arabia-cbs-interview', 'urlToImage': 'https://i.guim.co.uk/img/media/847e2f55fce4f3d8ca2d0efe7d4c43c35ae411ce/0_371_5580_3347/master/5580.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZDM1ODZhNWVmNTc4MTc1NmQyMWEzYjYzNWU1MTcxNDEvdGctZGVmYXVsdC5wbmc&s=16a2070de1948cc76e041bb0a403b727', 'publishedAt': '2018-10-13T13:29:08Z', 'content': 'Donald Trump does not want to hurt jobs by sanctioning Saudi Arabia over the disappearance of Jamal Khashoggi, but has nonetheless promised severe punishment if regime involvement in the journalists death is confirmed. Trump also said the fact that Khashoggiw… [+3048 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Timothy Gardner', 'title': "Ex-U.S. energy head Moniz halts Saudi work over journalist's disappearance", 'description': "Former U.S. Energy Secretary Ernest Moniz said on Wednesday he has suspended his role on the board of Saudi Arabia's planned mega city NEOM until more is known about the journalist Jamal Khashoggi, who disappeared on Oct. 2 after visiting a Saudi consulate in…", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-neom/ex-u-s-energy-head-moniz-halts-saudi-work-over-journalists-disappearance-idUSKCN1MK2S2', 'urlToImage': 'https://s4.reutersmedia.net/resources_v2/images/rcom-default.png', 'publishedAt': '2018-10-10T21:23:14Z', 'content': 'WASHINGTON (Reuters) - Former U.S. Energy Secretary Ernest Moniz said on Wednesday he has suspended his role on the board of Saudi Arabia’s planned mega city NEOM until more is known about the journalist Jamal Khashoggi, who disappeared on Oct. 2 after visiti… [+1461 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Leah Millis', 'title': "Pompeo meets Saudi king over Khashoggi case, Turks to search consul's residence", 'description': "U.S. Secretary of State Mike Pompeo met Saudi Arabia's King Salman on Tuesday to discuss the disappearance of Saudi journalist Jamal Khashoggi, as Turkish police prepared to search the Saudi consul's residence in Istanbul in a widening probe.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-investigatio/pompeo-meets-saudi-king-over-khashoggi-case-turks-to-search-consuls-residence-idUSKCN1MQ05C', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315272945&w=1200&r=LYNXNPEE9F0SZ', 'publishedAt': '2018-10-16T10:08:39Z', 'content': 'RIYADH/ISTANBUL (Reuters) - U.S. Secretary of State Mike Pompeo met Saudi Arabia’s King Salman on Tuesday to discuss the disappearance of Saudi journalist Jamal Khashoggi, as Turkish police prepared to search the Saudi consul’s residence in Istanbul in a wide… [+5288 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Leah Millis', 'title': 'Saudi prince agrees to Khashoggi case investigation as Turks search consulate', 'description': "Saudi Arabia's crown prince agreed on Tuesday there must be a thorough investigation into the disappearance of journalist Jamal Khashoggi, the United States said, after media reports that Riyadh will acknowledge he was killed in a botched interrogation.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-investigatio/saudi-prince-agrees-to-khashoggi-case-investigation-as-turks-search-consulate-idUSKCN1MQ05C', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315313970&w=1200&r=LYNXNPEE9F11T', 'publishedAt': '2018-10-16T18:08:55Z', 'content': 'RIYADH/ISTANBUL (Reuters) - Saudi Arabia’s crown prince agreed on Tuesday there must be a thorough investigation into the disappearance of journalist Jamal Khashoggi, the United States said, after media reports that Riyadh will acknowledge he was killed in a … [+5672 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Trump says U.S. working with Turkey, Saudis on journalist probe', 'description': 'The United States has investigators overseas to assist Turkey in its probe over missing Saudi journalist Jamal Khashoggi, U.S. President Donald Trump said on Thursday, adding that they are also working with Saudi Arabia.', 'url': 'https://www.reuters.com/article/us-saudi-politics-trump/trump-says-u-s-working-with-turkey-saudis-on-journalist-probe-idUSKCN1ML1SU', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181011&t=2&i=1313636795&w=1200&r=LYNXNPEE9A17M', 'publishedAt': '2018-10-11T14:01:56Z', 'content': 'WASHINGTON (Reuters) - The United States has investigators overseas to assist Turkey in its probe over missing Saudi journalist Jamal Khashoggi, U.S. President Donald Trump said on Thursday, adding that they are also working with Saudi Arabia. Trump, in an in… [+1387 chars]'}]}