{'status': 'ok', 'totalResults': 13924, 'articles': [{'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Tulay Karadeniz', 'title': "Turkey hopes to enter Saudi consul's home Weds - minister", 'description': "Turkey hopes to enter the Saudi consul's residence in Istanbul on Wednesday in connection with the disappearance of Saudi journalist Jamal Khashoggi, Turkey's foreign minister said after meeting U.S. Secretary of State Mike Pompeo.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-turkey/turkey-hopes-to-enter-saudi-consuls-home-weds-minister-idUSKCN1MR159', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181017&t=2&i=1315656769&w=1200&r=LYNXNPEE9G0UP', 'publishedAt': '2018-10-17T10:37:04Z', 'content': 'ANKARA (Reuters) - Turkey hopes to enter the Saudi consul’s residence in Istanbul on Wednesday in connection with the disappearance of Saudi journalist Jamal Khashoggi, Turkey’s foreign minister said after meeting U.S. Secretary of State Mike Pompeo. Turkish … [+1801 chars]'}, {'source': {'id': None, 'name': 'Npr.org'}, 'author': 'Emily Sullivan', 'title': 'Pompeo Arrives In Saudi Arabia To Discuss Khashoggi Disappearance', 'description': 'President Trump dispatched Secretary of State Mike Pompeo to the kingdom amid international tension over the disappearance of journalist Jamal Khashoggi.', 'url': 'https://www.npr.org/2018/10/16/657735722/pompeo-arrives-in-saudi-arabia-to-discuss-khashoggi-disappearance', 'urlToImage': 'https://media.npr.org/assets/img/2018/10/16/ap_18289346588832_wide-7906e8fdad64c08275322dd7b197429329f5141d.jpg?s=1400', 'publishedAt': '2018-10-16T11:29:39Z', 'content': 'Secretary of State Mike Pompeo shakes hands with Saudi Foreign Minister Adel al-Jubeir in Riyadh, Saudi Arabia, on Tuesady. Leah Mills/AP Secretary of State Mike Pompeo has arrived in Saudi Arabia after being dispatched by President Trump to meet with members… [+2779 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Tulay Karadeniz', 'title': 'Trump sends Pompeo to Riyadh over Khashoggi; Saudis may blame official', 'description': 'Saudi Arabia is preparing to acknowledge the death of Saudi journalist Jamal Khashoggi in a botched interrogation, CNN and the New York Times said on Monday, after U.S. President Donald Trump speculated "rogue killers" may be responsible.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-turkey/trump-sends-pompeo-to-riyadh-over-khashoggi-saudis-may-blame-official-idUSKCN1MP0Y6', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181015&t=2&i=1315076274&w=1200&r=LYNXNPEE9E1DB', 'publishedAt': '2018-10-15T22:27:45Z', 'content': 'ANKARA/WASHINGTON (Reuters) - Saudi Arabia is preparing to acknowledge the death of Saudi journalist Jamal Khashoggi in a botched interrogation, CNN and the New York Times said on Monday, after U.S. President Donald Trump speculated “rogue killers” may be res… [+5396 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Senator Rubio says U.S. must take action over Saudi journalist', 'description': 'Republican U.S. Senator Marco Rubio said the United States must confront Saudi Arabia or risk losing credibility on human rights, if allegations are proven true that the Saudi government orchestrated the killing of journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-rubio/senator-rubio-says-u-s-must-take-action-over-saudi-journalist-idUSKCN1MO0JY', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181014&t=2&i=1314643667&w=1200&r=LYNXNPEE9D0GG', 'publishedAt': '2018-10-14T14:09:19Z', 'content': 'WASHINGTON (Reuters) - Republican U.S. Senator Marco Rubio said the United States must confront Saudi Arabia or risk losing credibility on human rights, if allegations are proven true that the Saudi government orchestrated the killing of journalist Jamal Khas… [+1803 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Roberta Rampton', 'title': 'Trump to discuss missing journalist with Saudis', 'description': 'U.S. President Donald Trump said on Tuesday he plans to speak with Saudi Arabian officials about the disappearance of prominent Saudi journalist Jamal Khashoggi, who went missing a week ago.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-trump/trump-to-discuss-missing-journalist-with-saudis-idUSKCN1MJ1X1', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181009&t=2&i=1312924091&w=1200&r=LYNXNPEE9818O', 'publishedAt': '2018-10-09T16:27:24Z', 'content': 'WASHINGTON (Reuters) - U.S. President Donald Trump said on Tuesday he plans to speak with Saudi Arabian officials about the disappearance of prominent Saudi journalist Jamal Khashoggi, who went missing a week ago. Trump, speaking at the White House, said he d… [+1771 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Ece Toksabay', 'title': 'Turkey says will search consulate where Saudi journalist vanished', 'description': 'Turkey said on Tuesday it would search Saudi Arabia\'s consulate in Istanbul where Saudi journalist Jamal Khashoggi vanished last week, and close ally Britain called on Riyadh to provide "urgent answers" over his disappearance.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-consulate/turkey-says-will-search-consulate-where-saudi-journalist-vanished-idUSKCN1MJ1E4', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181009&t=2&i=1312919554&w=1200&r=LYNXNPEE981AW', 'publishedAt': '2018-10-09T16:11:07Z', 'content': 'ANKARA (Reuters) - Turkey said on Tuesday it would search Saudi Arabia’s consulate in Istanbul where Saudi journalist Jamal Khashoggi vanished last week, and close ally Britain called on Riyadh to provide “urgent answers” over his disappearance. Khashoggi was… [+4122 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Leah Millis', 'title': "Pompeo meets Saudi king on Khashoggi case, Turks study 'toxic materials'", 'description': "U.S. Secretary of State Mike Pompeo met Saudi Arabia's King Salman on Tuesday to discuss the disappearance of Saudi journalist Jamal Khashoggi, as Turkish police prepared to search the Saudi consul's residence in Istanbul in a widening probe.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-investigatio/pompeo-meets-saudi-king-on-khashoggi-case-turks-study-toxic-materials-idUSKCN1MQ05C', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315272945&w=1200&r=LYNXNPEE9F0SZ', 'publishedAt': '2018-10-16T11:04:06Z', 'content': 'RIYADH/ISTANBUL (Reuters) - U.S. Secretary of State Mike Pompeo met Saudi Arabia’s King Salman on Tuesday to discuss the disappearance of Saudi journalist Jamal Khashoggi, as Turkish police prepared to search the Saudi consul’s residence in Istanbul in a wide… [+5572 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Trump says he will call Saudi King Salman about journalist Khashoggi', 'description': "President Donald Trump told reporters on Friday that he has not talked to Saudi Arabia's King Salman but will call the royal leader soon, as questions mount about the disappearance of prominent Saudi journalist Jamal Khashoggi.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-trump/trump-says-he-will-call-saudi-king-salman-about-journalist-khashoggi-idUSKCN1MM2K3', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181012&t=2&i=1314129167&w=1200&r=LYNXNPEE9B1PM', 'publishedAt': '2018-10-12T21:07:42Z', 'content': 'CINCINNATI (Reuters) - President Donald Trump told reporters on Friday that he has not talked to Saudi Arabia’s King Salman but will call the royal leader soon, as questions mount about the disappearance of prominent Saudi journalist Jamal Khashoggi. A delega… [+378 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Lisa Lambert', 'title': 'Trump says Saudi prince denies knowing what happened at consulate', 'description': "U.S. President Donald Trump said on Tuesday that Saudi Arabia's crown prince told him he did not know what had happened in the Saudi consulate in Istanbul where dissident journalist Jamal Khashoggi went missing two weeks ago.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-investigatio/trump-says-saudi-prince-denies-knowing-what-happened-at-consulate-idUSKCN1MQ05C', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315284288&w=1200&r=LYNXNPEE9F0VF', 'publishedAt': '2018-10-16T19:34:16Z', 'content': 'WASHINGTON/RIYADH (Reuters) - U.S. President Donald Trump said on Tuesday that Saudi Arabia’s crown prince told him he did not know what had happened in the Saudi consulate in Istanbul where dissident journalist Jamal Khashoggi went missing two weeks ago. “Ju… [+1915 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'JP Morgan CEO Dimon cancels plans to attend Saudi investor event', 'description': 'JP Morgan Chase & Co Chief Executive Jamie Dimon has canceled plans to attend a Saudi Arabian investor conference later this month, the company said on Sunday, the latest high-profile cancellation after the disappearance of Saudi journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-jpmorgan/jp-morgan-ceo-dimon-cancels-plans-to-attend-saudi-investor-event-idUSKCN1MO0YV', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181014&t=2&i=1314768499&w=1200&r=LYNXNPEE9D0SD', 'publishedAt': '2018-10-14T23:24:03Z', 'content': 'NEW YORK (Reuters) - JP Morgan Chase &amp; Co ( JPM.N ) Chief Executive Jamie Dimon has canceled plans to attend a Saudi Arabian investor conference later this month, the company said on Sunday, the latest high-profile cancellation after the disappearance of … [+313 chars]'}, {'source': {'id': 'the-new-york-times', 'name': 'The New York Times'}, 'author': None, 'title': 'The Disappearance of a Saudi Journalist - New York Times', 'description': "New York Times The Disappearance of a Saudi Journalist New York Times Listen and subscribe to our podcast from your mobile device: Via Apple Podcasts | Via RadioPublic | Via Stitcher. Saudi Arabia's crown prince has promoted himself to the West as a reformer …", 'url': 'https://www.nytimes.com/2018/10/11/podcasts/the-daily/jamal-khashoggi-saudi-arabia-turkey-disappearance.html', 'urlToImage': 'https://static01.nyt.com/images/2018/10/11/podcasts/the-daily/11daily1/11daily1-facebookJumbo.jpg', 'publishedAt': '2018-10-11T10:00:38Z', 'content': 'Carlotta Gall contributed reporting. The Disappearance of a Saudi Journalist was produced by Theo Balcomb, Rachel Quester and Alexandra Leigh Young, and edited by Paige Cowett and Lisa Tobin. The Daily is produced by Theo Balcomb, Annie Brown, Jessica Cheung,… [+436 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Rosie Perper', 'title': 'Report indicates the Saudi crown prince Mohammed bin Salman ordered operation to lure missing journalist Jamal Khashoggi into Saudi Arabia', 'description': 'Saudi crown prince Mohammed bin Salman may have been involved in a plot to lure journalist and prominent Saudi critic Jamal Khashoggi from his home in Virginia to Saudi Arabia, The Washington Post reported on Tuesday night, citing US intelligence intercepts. …', 'url': 'https://www.businessinsider.com/saudi-crown-prince-mohammed-bin-salman-jamal-khashoggi-disappearance-2018-10', 'urlToImage': 'https://amp.businessinsider.com/images/5bbdb9e119090733e7216494-1136-568.jpg', 'publishedAt': '2018-10-11T05:27:45Z', 'content': 'New reports published on Wednesday indicate that the Saudi crown prince Mohammed bin Salman may have been involved in a plot to lure journalist and prominent Saudi critic Jamal Khashoggi from Virginia back to Saudi Arabia. Khashoggi, a former adviser to senio… [+2943 chars]'}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Associated Press in Riyadh', 'title': 'Jamal Khashoggi: US secretary of state arrives in Saudi Arabia for crisis talks', 'description': 'Mike Pompeo to meet King Salman amid reports Riyadh may admit journalist was killed in Istanbul consulate The US secretary of state, Mike Pompeo, has arrived in Saudi Arabia for talks with King Salman over the disappearance of the journalist Jamal Khashoggi, …', 'url': 'https://www.theguardian.com/world/2018/oct/16/jamal-khashoggi-disappearance-mike-pompeo-saudi-arabia-salman', 'urlToImage': 'https://i.guim.co.uk/img/media/fa888691ce4377fb40d43bba3c1deca23626f176/0_199_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZDM1ODZhNWVmNTc4MTc1NmQyMWEzYjYzNWU1MTcxNDEvdGctZGVmYXVsdC5wbmc&s=5cd93ceb32449227e0d689c79b35d128', 'publishedAt': '2018-10-16T07:41:19Z', 'content': 'The US secretary of state, Mike Pompeo, has arrived in Saudi Arabia for talks with King Salman over the disappearance of the journalist Jamal Khashoggi, as reports emerged that Riyadh was poised to acknowledge that Khashoggi was killed in its consulate in Ist… [+4107 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Trump says he spoke with Saudi king, sending Pompeo for meeting', 'description': "U.S. President Donald Trump on Monday said he has spoken with Saudi Arabia's King Salman about missing Saudi journalist Jamal Khashoggi, and that he was sending U.S. Secretary of State Mike Pompeo to meet with the king immediately.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-trump/trump-says-he-spoke-with-saudi-king-sending-pompeo-for-meeting-idUSKCN1MP1IT', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181015&t=2&i=1314960204&w=1200&r=LYNXNPEE9E0UL', 'publishedAt': '2018-10-15T12:50:02Z', 'content': 'WASHINGTON (Reuters) - U.S. President Donald Trump on Monday said he has spoken with Saudi Arabia’s King Salman about missing Saudi journalist Jamal Khashoggi, and that he was sending U.S. Secretary of State Mike Pompeo to meet with the king immediately. Trum… [+255 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'U.S. Secretary of State to have dinner with Saudi crown prince: pool report', 'description': 'U.S. Secretary of State Mike Pompeo will have dinner with Crown Prince Mohammed bin Salman on Tuesday after meeting with King Salman in Riyadh, according to reporters traveling with him, to discuss the disappearance of Saudi journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-pompeo-princ/u-s-secretary-of-state-to-have-dinner-with-saudi-crown-prince-pool-report-idUSKCN1MQ0TF', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315243339&w=1200&r=LYNXNPEE9F0LH', 'publishedAt': '2018-10-16T07:41:20Z', 'content': 'RIYADH (Reuters) - U.S. Secretary of State Mike Pompeo will have dinner with Crown Prince Mohammed bin Salman on Tuesday after meeting with King Salman in Riyadh, according to reporters traveling with him, to discuss the disappearance of Saudi journalist Jama… [+338 chars]'}, {'source': {'id': 'cnn', 'name': 'CNN'}, 'author': "Michael D'Antonio", 'title': "Opinion: Trump on '60 Minutes': A master class in deception and denial", 'description': 'He delivered all the tired lines about "fake news" and the "very unfair" investigation into Russian election meddling. Once again, he complained about Barack Obama and Hillary Clinton and bragged that "I\'m president and you\'re not."', 'url': 'https://www.cnn.com/2018/10/15/opinions/trump-60-minutes-master-class-deception-denial-dantonio/index.html', 'urlToImage': 'https://cdn.cnn.com/cnnnext/dam/assets/181014204618-trump-60-minutes-1014-super-tease.jpg', 'publishedAt': '2018-10-15T15:41:39Z', 'content': 'Michael D\'Antonio is author of the book, "Never Enough: Donald Trump and the Pursuit of Success " (St. Martin\'s Press). The opinions expressed in this commentary are his. View more opinion articles on CNN. (CNN) He delivered all the tired lines about "fake ne… [+6833 chars]'}, {'source': {'id': 'the-washington-post', 'name': 'The Washington Post'}, 'author': None, 'title': 'The Latest: Pompeo, Saudi crown prince meet over Khashoggi - Washington Post', 'description': 'Washington Post The Latest: Pompeo, Saudi crown prince meet over Khashoggi Washington Post ISTANBUL — The Latest on the disappearance of a Saudi writer who Turkish officials fear was killed inside the Saudi Consulate in Istanbul (all times local):. 3:10 p.m..…', 'url': 'https://www.washingtonpost.com/world/middle_east/the-latest-pompeo-lands-in-saudi-arabia-to-meet-with-king/2018/10/16/2b91dbea-d111-11e8-a4db-184311d27129_story.html', 'urlToImage': 'https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png', 'publishedAt': '2018-10-16T12:11:15Z', 'content': 'ISTANBUL The Latest on the disappearance of a Saudi writer who Turkish officials fear was killed inside the Saudi Consulate in Istanbul (all times local): 3:10 p.m. U.S. Secretary of State Mike Pompeo has met with Saudi Crown Prince Mohammed bin Salman over t… [+7023 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Erdogan adviser Aktay says missing Saudi journalist killed in Istanbul consulate', 'description': 'An adviser to Turkish President Tayyip Erdogan said on Sunday he believed prominent Saudi journalist Jamal Khashoggi, who has been missing for six days, was killed in the Saudi Arabian consulate in Istanbul.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-adviser/erdogan-adviser-aktay-says-missing-saudi-journalist-killed-in-istanbul-consulate-idUSKCN1MH0JY', 'urlToImage': 'https://s4.reutersmedia.net/resources_v2/images/rcom-default.png', 'publishedAt': '2018-10-07T11:55:19Z', 'content': 'ANKARA (Reuters) - An adviser to Turkish President Tayyip Erdogan said on Sunday he believed prominent Saudi journalist Jamal Khashoggi, who has been missing for six days, was killed in the Saudi Arabian consulate in Istanbul. Yasin Aktay, who advises Erdogan… [+567 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Turkey's Erdogan says following case of missing Saudi journalist personally", 'description': 'Turkish President Tayyip Erdogan said on Sunday he was personally following the case of Saudi journalist Jamal Khashoggi, who disappeared last week, and added that he still hoped for a positive outcome to the matter.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-erdogan/turkeys-erdogan-says-following-case-of-missing-saudi-journalist-personally-idUSKCN1MH0MY', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181007&t=2&i=1312185145&w=1200&r=LYNXNPEE960SC', 'publishedAt': '2018-10-07T13:21:51Z', 'content': 'ANKARA (Reuters) - Turkish President Tayyip Erdogan said on Sunday he was personally following the case of Saudi journalist Jamal Khashoggi, who disappeared last week, and added that he still hoped for a positive outcome to the matter. On Saturday, Turkish so… [+498 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Turkish daily names Saudis in Khashoggi case, raising pressure on Riyadh', 'description': 'A pro-government Turkish daily on Wednesday published preliminary evidence from investigators it said identified a 15-member Saudi intelligence team involved in the unexplained disappearance of journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-turkey/turkish-daily-names-saudis-in-khashoggi-case-raising-pressure-on-riyadh-idUSKCN1MK0J0', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181010&t=2&i=1313129755&w=1200&r=LYNXNPEE990DT', 'publishedAt': '2018-10-10T14:56:45Z', 'content': 'ISTANBUL (Reuters) - A pro-government Turkish daily on Wednesday published preliminary evidence from investigators it said identified a 15-member Saudi intelligence team involved in the unexplained disappearance of journalist Jamal Khashoggi. The move added p… [+4700 chars]'}]}