{'status': 'ok', 'totalResults': 14504, 'articles': [{'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Roberta Rampton', 'title': "Trump says 'rogue killers' may be behind Khashoggi disappearance", 'description': 'U.S. President Donald Trump on Monday dispatched U.S. Secretary of State Mike Pompeo to meet with Saudi Arabia\'s King Salman over the unexplained disappearance of prominent Saudi journalist Jamal Khashoggi and raised the possibility that "rogue killers" could…', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-trump/trump-says-rogue-killers-may-be-behind-khashoggi-disappearance-idUSKCN1MP1IT', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181015&t=2&i=1314988477&w=1200&r=LYNXNPEE9E0UL', 'publishedAt': '2018-10-15T14:29:06Z', 'content': 'WASHINGTON (Reuters) - U.S. President Donald Trump on Monday dispatched U.S. Secretary of State Mike Pompeo to meet with Saudi Arabia’s King Salman over the unexplained disappearance of prominent Saudi journalist Jamal Khashoggi and raised the possibility tha… [+1831 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Britain, France, Germany call for 'credible investigation' into Khashoggi disappearance", 'description': 'Britain, France and Germany called on the Saudi and Turkish authorities on Sunday to mount a "credible investigation" into the disappearance of Saudi journalist Jamal Khashoggi, saying they were treating the incident with "the utmost seriousness".', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-jointstateme/britain-france-germany-call-for-credible-investigation-into-khashoggi-disappearance-idUSKCN1MO0KI', 'urlToImage': 'https://s4.reutersmedia.net/resources_v2/images/rcom-default.png', 'publishedAt': '2018-10-14T14:28:33Z', 'content': 'LONDON (Reuters) - Britain, France and Germany called on the Saudi and Turkish authorities on Sunday to mount a “credible investigation” into the disappearance of Saudi journalist Jamal Khashoggi, saying they were treating the incident with “the utmost seriou… [+678 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Saudi officials must prove Khashoggi left consulate: Erdogan', 'description': 'Saudi Arabian officials must prove that journalist Jamal Khashoggi, who has been missing since last week, had left the Istanbul consulate, Turkish President Tayyip Erdogan said on Monday.', 'url': 'https://www.reuters.com/article/us-saudi-journalist-dissident-erdogan/saudi-officials-must-prove-khashoggi-left-consulate-erdogan-idUSKCN1MI1R7', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181008&t=2&i=1312562312&w=1200&r=LYNXNPEE9710B', 'publishedAt': '2018-10-08T15:57:02Z', 'content': 'BUDAPEST (Reuters) - Saudi Arabian officials must prove that journalist Jamal Khashoggi, who has been missing since last week, had left the Istanbul consulate, Turkish President Tayyip Erdogan said on Monday. “We have to get an outcome from this investigation… [+481 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Qatari media group expresses concern over Khashoggi disappearance', 'description': 'Qatari media group The Qatar Press Centre said it is deeply concerned over the disappearance of Saudi journalist Jamal Khashoggi, the State news Agency (QNA) reported on Saturday.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-qatar/qatari-media-group-expresses-concern-over-khashoggi-disappearance-idUSKCN1MN0QT', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181013&t=2&i=1314392690&w=1200&r=LYNXNPEE9C0EZ', 'publishedAt': '2018-10-13T18:05:43Z', 'content': 'CAIRO (Reuters) - Qatari media group The Qatar Press Centre said it is deeply concerned over the disappearance of Saudi journalist Jamal Khashoggi, the State news Agency (QNA) reported on Saturday. The center said in a statement it was “following with great c… [+260 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Andrew Torchia', 'title': 'Saudi threatens to retaliate against any sanctions over Khashoggi disappearance', 'description': 'Saudi Arabia rejected threats to punish it over the disappearance of journalist Jamal Khashoggi in Istanbul, saying the kingdom would retaliate against any sanctions with tougher measures, the official state news agency said on Sunday.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-sanctions/saudi-threatens-to-retaliate-against-any-sanctions-over-khashoggi-disappearance-idUSKCN1MO0F1', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181014&t=2&i=1314618612&w=1200&r=LYNXNPEE9D0DT', 'publishedAt': '2018-10-14T12:23:05Z', 'content': 'DUBAI (Reuters) - Saudi Arabia rejected threats to punish it over the disappearance of journalist Jamal Khashoggi in Istanbul, saying the kingdom would retaliate against any sanctions with tougher measures, the official state news agency said on Sunday. The c… [+4148 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'CNBC pulls out of Saudi conference over Khashoggi', 'description': 'CNBC cable news network added its name on Friday to the growing list of media companies that have pulled out of a Saudi investment conference this month, citing the disappearance of dissident Saudi journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-cnbc/cnbc-pulls-out-of-saudi-conference-over-khashoggi-idUSKCN1MM1OZ', 'urlToImage': 'https://s4.reutersmedia.net/resources_v2/images/rcom-default.png', 'publishedAt': '2018-10-12T13:13:48Z', 'content': 'WASHINGTON (Reuters) - CNBC cable news network added its name on Friday to the growing list of media companies that have pulled out of a Saudi investment conference this month, citing the disappearance of dissident Saudi journalist Jamal Khashoggi. “CNBC will… [+189 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Stephanie Nebehay', 'title': 'U.N. rights chief urges waiving of immunity in Khashoggi case', 'description': 'U.N. human rights chief Michelle Bachelet called on Saudi Arabia and Turkey on Tuesday to reveal everything they know about the disappearance and possible murder of missing journalist Jamal Khashoggi and said Riyadh should waive immunity on its diplomatic pre…', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-un/u-n-rights-chief-urges-waiving-of-immunity-in-khashoggi-case-idUSKCN1MQ11K', 'urlToImage': 'https://s1.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315279194&w=1200&r=LYNXNPEE9F0R2', 'publishedAt': '2018-10-16T09:58:56Z', 'content': 'GENEVA (Reuters) - U.N. human rights chief Michelle Bachelet called on Saudi Arabia and Turkey on Tuesday to reveal everything they know about the disappearance and possible murder of missing journalist Jamal Khashoggi and said Riyadh should waive immunity on… [+1971 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Turkish newspaper names 15 Saudis in Khashoggi case', 'description': 'Turkish pro-government newspaper Sabah said on Wednesday it had identified a 15-member intelligence team it said was involved in the disappearance of prominent Saudi journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-turkey/turkish-newspaper-names-15-saudis-in-khashoggi-case-idUSKCN1MK0J0', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181010&t=2&i=1313129755&w=1200&r=LYNXNPEE990DT', 'publishedAt': '2018-10-10T07:17:46Z', 'content': 'ISTANBUL (Reuters) - Turkish pro-government newspaper Sabah said on Wednesday it had identified a 15-member intelligence team it said was involved in the disappearance of prominent Saudi journalist Jamal Khashoggi. Khashoggi was last seen a week ago entering … [+1786 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Saudi Arabia preparing to admit Khashoggi was killed: CNN', 'description': 'Saudi Arabia is preparing a report that would admit Saudi journalist Jamal Khashoggi was killed as the result of an interrogation that went wrong, CNN reported on Monday, citing two unnamed sources.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-report/saudi-arabia-preparing-to-admit-khashoggi-was-killed-cnn-idUSKCN1MP2DD', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181015&t=2&i=1315066780&w=1200&r=LYNXNPEE9E1CB', 'publishedAt': '2018-10-15T19:24:13Z', 'content': 'WASHINGTON (Reuters) - Saudi Arabia is preparing a report that would admit Saudi journalist Jamal Khashoggi was killed as the result of an interrogation that went wrong, CNN reported on Monday, citing two unnamed sources. One source cautioned that the report … [+289 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Bahrain minister backs boycott of Uber over Khashoggi case', 'description': "Bahrain's foreign minister called for a boycott of the ride-hailing company Uber Technologies [UBER.UL] after its chief executive officer said he will not attend a business conference in the kingdom's ally Saudi Arabia.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-uber/bahrain-minister-backs-boycott-of-uber-over-khashoggi-case-idUSKCN1MP0RC', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181015&t=2&i=1314890201&w=1200&r=LYNXNPEE9E0GD', 'publishedAt': '2018-10-15T08:31:11Z', 'content': 'DUBAI (Reuters) - Bahrain’s foreign minister called for a boycott of the ride-hailing company Uber Technologies [UBER.UL] after its chief executive officer said he will not attend a business conference in the kingdom’s ally Saudi Arabia. Uber’s CEO Dara Khosr… [+3142 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Associated Press', 'title': 'Saudi stock marke dives 6.8% after Trump threatens punishment over Khashoggi disappearance - Business Insider', 'description': 'Business Insider Saudi stock marke dives 6.8% after Trump threatens punishment over Khashoggi disappearance Business Insider The Saudi stock market has dropped more than 6.8 percent after President Donald Trump threatened "severe punishment" over the disappea…', 'url': 'https://www.businessinsider.com/khashoggi-case-saudi-markets-down68-after-trump-threatens-punishment-for-2018-10', 'urlToImage': 'https://amp.businessinsider.com/images/569b82fce6183e1c008ba10f-1334-667.jpg', 'publishedAt': '2018-10-14T09:27:30Z', 'content': 'DUBAI, United Arab Emirates (AP) — The Saudi stock market has dropped more than 6.8 percent after President Donald Trump threatened "severe punishment" over the disappearance of Washington Post columnist Jamal Khashoggi. The drop in the Tadawul exchange in Ri… [+701 chars]'}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Reuters', 'title': 'Turkey begins investigation into missing Saudi journalist', 'description': 'Jamal Khashoggi has not been seen since entering Saudi consulate in Istanbul four days ago Turkish prosecutors have begun investigating the disappearance of prominent Saudi Arabian commentator Jamal Khashoggi, who has been missing for four days after entering…', 'url': 'https://www.theguardian.com/world/2018/oct/06/turkey-investigation-missing-saudi-journalist-jamal-khashoggi', 'urlToImage': 'https://i.guim.co.uk/img/media/9c75e698003fbf8f70eea4112963059781e89fb1/393_0_4548_2729/master/4548.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZDM1ODZhNWVmNTc4MTc1NmQyMWEzYjYzNWU1MTcxNDEvdGctZGVmYXVsdC5wbmc&s=985c84b88ca1dec78e8140562c95846c', 'publishedAt': '2018-10-06T16:54:43Z', 'content': 'Turkish prosecutors have begun investigating the disappearance of prominent Saudi Arabian commentator Jamal Khashoggi, who has been missing for four days after entering the Saudi consulate in Istanbul, Turkish broadcaster NTV reported on Saturday. Khashoggi, … [+1544 chars]'}, {'source': {'id': None, 'name': 'Ibtimes.com'}, 'author': 'Susmitha Suresh', 'title': 'Jamal Khashoggi Disappearance: Trump Reluctant To Halt Saudi Arms Deal - International Business Times', 'description': 'International Business Times Jamal Khashoggi Disappearance: Trump Reluctant To Halt Saudi Arms Deal International Business Times President Donald Trump on Wednesday seemed reluctant to halt further arms deal with Saudi Arabia even as he faced increasing press…', 'url': 'https://www.ibtimes.com/jamal-khashoggi-disappearance-trump-reluctant-halt-saudi-arms-deal-2723991', 'urlToImage': 'https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2018/10/11/jamal-khashoggi-disappearance-trump-reluctant-halt-saudi-arms-deal.jpg', 'publishedAt': '2018-10-11T09:00:23Z', 'content': 'President Donald Trump on Wednesday seemed reluctant to halt further arms deal with Saudi Arabia even as he faced increasing pressure to respond to the disappearance of journalist Jamal Khashoggi and said calling off the deal could "hurt" the United States. T… [+5880 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Tulay Karadeniz', 'title': "Trump says 'rogue killers' may be behind Khashoggi disappearance", 'description': 'U.S. President Donald Trump said on Monday "rogue killers" may have been behind the disappearance of prominent Saudi journalist Jamal Khashoggi, and Saudi Arabia\'s King Salman ordered an internal investigation into the case.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-turkey/trump-says-rogue-killers-may-be-behind-khashoggi-disappearance-idUSKCN1MP0Y6', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181015&t=2&i=1314918706&w=1200&r=LYNXNPEE9E0IW', 'publishedAt': '2018-10-15T15:05:57Z', 'content': 'ANKARA/WASHINGTON (Reuters) - U.S. President Donald Trump said on Monday “rogue killers” may have been behind the disappearance of prominent Saudi journalist Jamal Khashoggi, and Saudi Arabia’s King Salman ordered an internal investigation into the case. Trum… [+5775 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Tulay Karadeniz', 'title': "Trump voices 'rogue killers' theory for Khashoggi incident", 'description': 'U.S. President Donald Trump speculated on Monday that "rogue killers" may have been behind the disappearance of prominent Saudi journalist Jamal Khashoggi and dispatched Secretary of State Mike Pompeo to meet King Salman over the case.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-turkey/trump-voices-rogue-killers-theory-for-khashoggi-incident-idUSKCN1MP0Y6', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181015&t=2&i=1315030609&w=1200&r=LYNXNPEE9E18B', 'publishedAt': '2018-10-15T19:17:56Z', 'content': 'ANKARA/WASHINGTON (Reuters) - U.S. President Donald Trump speculated on Monday that “rogue killers” may have been behind the disappearance of prominent Saudi journalist Jamal Khashoggi and dispatched Secretary of State Mike Pompeo to meet King Salman over the… [+5878 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Orhan Coskun', 'title': 'Saudi journalist Khashoggi was killed in consulate, Turkish sources say', 'description': "Turkish authorities believe Saudi journalist Jamal Khashoggi was killed inside his country's consulate in Istanbul last week, Turkish sources said, in what they described as the deliberate targeting of a prominent critic of the Gulf kingdom's rulers.", 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident/saudi-journalist-khashoggi-was-killed-in-consulate-turkish-sources-say-idUSKCN1MH0G0', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181007&t=2&i=1312138394&w=1200&r=LYNXNPEE960GW', 'publishedAt': '2018-10-07T10:04:40Z', 'content': 'ANKARA (Reuters) - Turkish authorities believe Saudi journalist Jamal Khashoggi was killed inside his country’s consulate in Istanbul last week, Turkish sources said, in what they described as the deliberate targeting of a prominent critic of the Gulf kingdom… [+4419 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'U.S. ready to assist on missing Saudi journalist Khashoggi: Pence', 'description': 'U.S. Vice President Mike Pence said on Wednesday the United States is ready to help in any way in the investigation of the disappearance of prominent Saudi journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-pence/u-s-ready-to-assist-on-missing-saudi-journalist-khashoggi-pence-idUSKCN1MK1LJ', 'urlToImage': 'https://s1.reutersmedia.net/resources/r/?m=02&d=20181010&t=2&i=1313229797&w=1200&r=LYNXNPEE9911A', 'publishedAt': '2018-10-10T12:34:46Z', 'content': 'WASHINGTON (Reuters) - U.S. Vice President Mike Pence said on Wednesday the United States is ready to help in any way in the investigation of the disappearance of prominent Saudi journalist Jamal Khashoggi. Pence was asked on the Hugh Hewitt syndicated radio … [+280 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Erdogan, Saudi king stress importance of Khashoggi working group: sources', 'description': 'Turkish President Tayyip Erdogan and King Salman of Saudi Arabia spoke by telephone on Sunday evening and discussed the investigation into the disappearance of Saudi journalist Jamal Khashoggi, Turkish presidential sources said.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-erdogan/erdogan-saudi-king-stress-importance-of-khashoggi-working-group-sources-idUSKCN1MO0UD', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20181014&t=2&i=1314726704&w=1200&r=LYNXNPEE9D0P5', 'publishedAt': '2018-10-14T20:25:52Z', 'content': 'ISTANBUL (Reuters) - Turkish President Tayyip Erdogan and King Salman of Saudi Arabia spoke by telephone on Sunday evening and discussed the investigation into the disappearance of Saudi journalist Jamal Khashoggi, Turkish presidential sources said. They said… [+199 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'U.S. says Pompeo, Saudi crown prince back journalist Khashoggi probe', 'description': 'U.S. Secretary of State Mike Pompeo and Saudi Crown Prince Mohammed bin Salman at their meeting on Tuesday "agreed on the importance of a thorough, transparent, and timely investigation that provides answers" over Saudi journalist Jamal Khashoggi, according t…', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-meeting-pomp/u-s-says-pompeo-saudi-crown-prince-back-journalist-khashoggi-probe-idUSKCN1MQ207', 'urlToImage': 'https://s1.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315351103&w=1200&r=LYNXNPEE9F1A2', 'publishedAt': '2018-10-16T14:11:11Z', 'content': 'WASHINGTON (Reuters) - U.S. Secretary of State Mike Pompeo and Saudi Crown Prince Mohammed bin Salman at their meeting on Tuesday “agreed on the importance of a thorough, transparent, and timely investigation that provides answers” over Saudi journalist Jamal… [+370 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Pompeo says Saudi leaders pledge thorough probe of Khashoggi disappearance', 'description': 'U.S. Secretary of State Mike Pompeo said on Tuesday that Saudi leaders strongly denied any knowledge of what took place in their Istanbul consulate during a visit by U.S.-based Saudi journalist Jamal Khashoggi and promised a serious and credible investigation.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-pompeo/pompeo-says-saudi-leaders-pledge-thorough-probe-of-khashoggi-disappearance-idUSKCN1MQ2Y6', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315471239&w=1200&r=LYNXNPEE9F1YE', 'publishedAt': '2018-10-16T21:40:49Z', 'content': 'WASHINGTON (Reuters) - U.S. Secretary of State Mike Pompeo said on Tuesday that Saudi leaders strongly denied any knowledge of what took place in their Istanbul consulate during a visit by U.S.-based Saudi journalist Jamal Khashoggi and promised a serious and… [+499 chars]'}]}