{'status': 'ok', 'totalResults': 17984, 'articles': [{'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Christopher Woody', 'title': "Saudi Arabia's ambitious new crown prince is reportedly hiding out on his superyacht, 'fearing for his security'", 'description': "Mohammed bin Salman, the 32-year-old crown prince of Saudi Arabia, has been touted as a reformer and embraced by the US. But Salman's policies at home and abroad have reportedly angered people inside the kingdom. Amid what is reported to be growing ire with t…", 'url': 'https://www.businessinsider.com/saudi-arabia-crown-prince-mohammed-bin-salman-yacht-security-2018-9', 'urlToImage': 'https://amp.businessinsider.com/images/5a9477d5aae6052f098b45e7-1920-960.jpg', 'publishedAt': '2018-09-24T18:06:37Z', 'content': "Saudi Arabian Prince Mohammed bin Salman's elevation to crown prince in 2017 set the stage for him to pursue aggressive policies that included confrontations with many rivals around the region. But changes to the royal line of succession and decisions by the … [+3775 chars]"}, {'source': {'id': 'the-washington-post', 'name': 'The Washington Post'}, 'author': None, 'title': 'Top banker Dimon drops out of Saudi conference as Treasury secretary Mnuchin weighs whether to attend - Washington Post', 'description': 'Washington Post Top banker Dimon drops out of Saudi conference as Treasury secretary Mnuchin weighs whether to attend Washington Post Jamie Dimon, chief executive of JPMorgan Chase & Co., is the latest and one of the most high-profile business executives to d…', 'url': 'https://www.washingtonpost.com/business/2018/10/15/top-banker-jamie-dimon-drops-out-saudi-conference-treasury-secretary-mnuchin-weighs-whether-attend/', 'urlToImage': 'https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png', 'publishedAt': '2018-10-15T01:52:36Z', 'content': 'Jamie Dimon, chief executive of JPMorgan Chase, is the latest and one of the most high-profile business executives to drop out of a Saudi investment conference in Riyadh this month, after allegations that Saudi agents killed the dissident journalist Jamal Kha… [+2861 chars]'}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Kevin Mitchell', 'title': 'Nadal and Djokovic need to break silence over Saudi exhibition | Kevin Mitchell', 'description': 'The two players appear to have remained deaf to growing clamour over seeming endorsement of Saudi Arabia amid outrage over disappearance of Jamal Khashoggi Rafael Nadal and Novak Djokovic, men of conscience and integrity, continue to risk their good name by a…', 'url': 'https://www.theguardian.com/sport/blog/2018/oct/17/nadal-and-djokovic-need-to-break-silence-over-saudi-exhibition', 'urlToImage': 'https://i.guim.co.uk/img/media/6cc455427e3f795a3c11dc86573c3a0138341b7d/934_139_3645_2187/master/3645.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&s=205f329478e824b66d174877138d8523', 'publishedAt': '2018-10-17T18:01:02Z', 'content': 'R afael Nadal and Novak Djokovic, men of conscience and integrity, continue to risk their good name by accepting an invitation to play in a meaningless exhibition in Saudi Arabia, a regime under critical scrutiny for the disappearance of the journalist Jamal … [+4015 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'U.S. ready to assist on missing Saudi journalist Khashoggi: Pence', 'description': 'U.S. Vice President Mike Pence said on Wednesday the United States is ready to help in any way in the investigation of the disappearance of prominent Saudi journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-pence/u-s-ready-to-assist-on-missing-saudi-journalist-khashoggi-pence-idUSKCN1MK1LJ', 'urlToImage': 'https://s1.reutersmedia.net/resources/r/?m=02&d=20181010&t=2&i=1313229797&w=1200&r=LYNXNPEE9911A', 'publishedAt': '2018-10-10T12:34:46Z', 'content': 'WASHINGTON (Reuters) - U.S. Vice President Mike Pence said on Wednesday the United States is ready to help in any way in the investigation of the disappearance of prominent Saudi journalist Jamal Khashoggi. Pence was asked on the Hugh Hewitt syndicated radio … [+280 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'U.S. Secretary of State to have dinner with Saudi crown prince: pool report', 'description': 'U.S. Secretary of State Mike Pompeo will have dinner with Crown Prince Mohammed bin Salman on Tuesday after meeting with King Salman in Riyadh, according to reporters traveling with him, to discuss the disappearance of Saudi journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-pompeo-princ/u-s-secretary-of-state-to-have-dinner-with-saudi-crown-prince-pool-report-idUSKCN1MQ0TF', 'urlToImage': 'https://s2.reutersmedia.net/resources/r/?m=02&d=20181016&t=2&i=1315243339&w=1200&r=LYNXNPEE9F0LH', 'publishedAt': '2018-10-16T07:41:20Z', 'content': 'RIYADH (Reuters) - U.S. Secretary of State Mike Pompeo will have dinner with Crown Prince Mohammed bin Salman on Tuesday after meeting with King Salman in Riyadh, according to reporters traveling with him, to discuss the disappearance of Saudi journalist Jama… [+338 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'UN rights council renews Yemen war crimes probe', 'description': 'The United Nations Human Rights Council voted to extend an international probe of alleged war crimes committed in Yemen despite strong opposition from Saudi Arabia and several of its allies. Last month, investigators detailed evidence of possible war crimes c…', 'url': 'https://www.yahoo.com/news/un-rights-council-renews-yemen-war-crimes-probe-004650400.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/IPMQc.RCrsgGyraisgkC4g--~B/aD02NTU7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/82b14e3b95ef9c86adb886afb03f91ca85584f17.jpg', 'publishedAt': '2018-09-28T14:10:37Z', 'content': 'Geneva (AFP) - The United Nations Human Rights Council voted to extend an international probe of alleged war crimes committed in Yemen despite strong opposition from Saudi Arabia and several of its allies. Nations voted 21 to 8, with 18 abstentions, in favour… [+2606 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Glencore chair Tony Hayward latest to drop out of Saudi conference', 'description': 'Glencore Plc said its chairman Tony Hayward will no longer be attending the Future Investment Initiative conference in Saudi Arabia, confirming a report in the Financial Times. Saudi Arabia has denied that. The investment summit, dubbed "Davos in the Desert",…', 'url': 'https://www.yahoo.com/news/glencore-chair-tony-hayward-latest-drop-saudi-conference-143739470--finance.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/sd3D0hCWPzOAVflQ8Iux7w--~B/aD0yODg7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2018-10-17T143739Z_1_LYNXNPEE9G1F9_RTROPTP_2_GENEL-HAYWARD.JPG', 'publishedAt': '2018-10-17T14:37:39Z', 'content': "(Reuters) - Glencore Plc said its chairman Tony Hayward will no longer be attending the Future Investment Initiative conference in Saudi Arabia, confirming a report in the Financial Times. He is the latest top executive to pull out of next week's high profile… [+583 chars]"}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Guardian staff', 'title': "John Oliver: Trump and Bin Salman are 'similar in some of the worst ways'", 'description': 'The Last Week Tonight host took aim at America’s ‘long and morally compromised history’ with Saudi Arabia John Oliver laid out the problematic relationship that Donald Trump shares with the Saudi prince Mohammed bin Salman, calling out their similarities. On …', 'url': 'https://www.theguardian.com/tv-and-radio/2018/oct/15/john-oliver-last-week-tonight-recap-trump-saudi-arabia-khashoggi', 'urlToImage': 'https://i.guim.co.uk/img/media/45581bf46b844d9368d9e9e2e1b06676e4dd2d9b/81_0_1618_971/master/1618.png?width=1200&height=630&quality=85&auto=format&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZDM1ODZhNWVmNTc4MTc1NmQyMWEzYjYzNWU1MTcxNDEvdGctZGVmYXVsdC5wbmc&s=137ad9ff5ea439c5e630d776dfe805ee', 'publishedAt': '2018-10-15T15:26:06Z', 'content': 'John Oliver laid out the problematic relationship that Donald Trump shares with the Saudi prince Mohammed bin Salman, calling out their similarities. On his HBO show Last Week Tonight, the comic talked about the absolutely horrific reports of the alleged murd… [+2709 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'John Haltiwanger', 'title': 'Trump doubts Turkish officials and touts arms deal with Saudi Arabia when asked about Khashoggi disappearance', 'description': 'President Donald Trump expressed doubts that Turkish officials have audio and video recordings proving Saudi journalist Jamal Khashoggi was killed on orders from the government. "We have asked for it, if it exists. We have asked," Trump told reporters. Trump …', 'url': 'https://www.businessinsider.com/trump-jamal-khashoggi-killing-turkey-saudi-arabia-2018-10', 'urlToImage': 'https://amp.businessinsider.com/images/5bc796c9a97774080c5d3801-1920-960.jpg', 'publishedAt': '2018-10-17T20:51:57Z', 'content': 'President Donald Trump on Wednesday expressed doubts that Turkish officials have audio and video recordings proving Saudi journalist Jamal Khashoggi was killed by his government. Trump said the US has requested access to audio and video pertaining to the alle… [+1651 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'John Haltiwanger', 'title': 'A top Senate Republican says he believes Saudi Arabia killed Saudi journalist Jamal Khashoggi, putting more pressure on Trump to act', 'description': 'Republican Sen. Bob Corker on Thursday said "there is no question" that Saudi Arabia killed Saudi journalist Jamal Khashoggi. "I think they did it and unfortunately I think he is deceased," Corker said. Corker is the chairman of the Senate Foreign Relations C…', 'url': 'https://www.businessinsider.com/republican-sen-bob-corker-believes-saudi-arabia-killed-jamal-khashoggi-2018-10', 'urlToImage': 'https://amp.businessinsider.com/images/5bbf71da76545354b57ede16-1920-960.jpg', 'publishedAt': '2018-10-11T16:02:02Z', 'content': 'Republican Sen. Bob Corker on Thursday said that "there is no question" Saudi Arabia killed Saudi journalist Jamal Khashoggi. Corker, the chairman of the Senate Foreign Relations Committee, told CNN reporter Manu Raju that "intel points directly" to the Saudi… [+1914 chars]'}, {'source': {'id': 'the-washington-post', 'name': 'The Washington Post'}, 'author': None, 'title': 'Mnuchin still plans to attend Saudi investment conference as others pull out in response to missing journalist - Washington Post', 'description': 'Washington Post Mnuchin still plans to attend Saudi investment conference as others pull out in response to missing journalist Washington Post Treasury Secretary Steven Mnuchin said Friday that he still plans to attend a major investment conference in Saudi A…', 'url': 'https://www.washingtonpost.com/politics/mnuchin-still-plans-to-attend-saudi-investment-conference-as-others-pull-out-in-response-to-missing-journalist/2018/10/12/d2f43d0a-ce1a-11e8-920f-dd52e1ae4570_story.html', 'urlToImage': 'https://www.washingtonpost.com/resizer/rQJpK13TNi8GhjBH6X2NIQNlqgc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LQF5F3GOEAI6REQP3VJODLSFOA.jpg', 'publishedAt': '2018-10-12T13:41:15Z', 'content': 'Treasury Secretary Steven Mnuchin said Friday that he still plans to attend a major investment conference in Saudi Arabia this month despite mounting evidence that Washington Post columnist Jamal Khashoggi was killed inside the Saudi consulate in Istanbul. We… [+3314 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Caitlin Foster', 'title': "Saudi Arabia doesn't officially recognize Israel, but its hackers are reportedly using Israeli spyware to target dissidents in foreign countries", 'description': 'Canadian research laboratory Citizen Lab says it found Israeli spyware on the phone belonging to a Saudi dissident and Canadian asylee. Pegasus, the invasive spyware developed by the Israeli company NSO Group, uses "exploit links" to infiltrate targets\' phone…', 'url': 'https://www.businessinsider.com/saudi-operators-using-israeli-nso-group-spyware-target-dissidents-2018-10', 'urlToImage': 'https://amp.businessinsider.com/images/5bbbbf4149aa850f5712a563-960-480.jpg', 'publishedAt': '2018-10-08T21:06:18Z', 'content': 'Canadian research laboratory Citizen Lab says its uncovered forensic evidence that Saudi Arabian operators used Israeli technology to spy on dissidents in foreign countries. In a report published in early October, lab researchers outlined how they discovered … [+1671 chars]'}, {'source': {'id': None, 'name': 'Npr.org'}, 'author': 'Greg Myre', 'title': "Saudi Arabia's Crown Prince Faces Increasing Scrutiny As Crises Mount", 'description': 'Mohammed bin Salman was initially seen as a leader who could modernize the kingdom. But critics now say he is being repressive at home and reckless abroad.', 'url': 'https://www.npr.org/2018/10/11/656532151/saudi-arabias-crown-prince-faces-increasing-scrutiny-as-crises-mount', 'urlToImage': 'https://media.npr.org/assets/img/2018/10/11/mohammed-bin-salman_wide-e24aa67f796c652577b88e46c3555c2d58c0e273.jpg?s=1400', 'publishedAt': '2018-10-11T21:32:03Z', 'content': "Saudi Arabia's Crown Prince Mohammed bin Salman is shown during a visit to Spain in April. At 33, Mohammed is the kingdom's de facto ruler, and he faces increasing criticism for his handling of issues ranging from the Saudi role in Yemen's war to the recent d… [+6079 chars]"}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Mark Sweney and Hugh Miles', 'title': "Bloomberg's Arabic news network contract gives it strict controls", 'description': 'US firm’s deal with Saudi media group for news service gives it right to kill deal if its brand is brought into disrepute Bloomberg’s $90m (£69m) deal with a Saudi media firm to launch an Arabic financial news network gives the US firm the right to terminate …', 'url': 'https://www.theguardian.com/media/2018/oct/09/bloombergs-arabic-news-network-contract-gives-it-strict-controls', 'urlToImage': 'https://i.guim.co.uk/img/media/a12d05ba5f94fcaa6e043bc8c495eecba7009e02/0_116_4288_2573/master/4288.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZDM1ODZhNWVmNTc4MTc1NmQyMWEzYjYzNWU1MTcxNDEvdGctZGVmYXVsdC5wbmc&s=71c8f2fa490fc3e9c0382d371885a23b', 'publishedAt': '2018-10-09T05:00:26Z', 'content': 'Bloombergs $90m (£69m) deal with a Saudi media firm to launch an Arabic financial news network gives the US firm the right to terminate the contract if its brand is brought into disrepute. Bloomberg struck a content and licensing deal with Saudi Research and … [+2277 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'John Haltiwanger', 'title': 'Missing journalist Jamal Khashoggi had a complicated past involving interviews with Osama bin Laden and close ties to the Saudi royal family', 'description': 'Saudi journalist Jamal Khashoggi had a long, complicated career before he went missing in early October after entering the Saudi consulate in Istanbul. Khashoggi went from interviewing Osama bin Laden in the 1980s to becoming one of the most prominent journal…', 'url': 'https://www.businessinsider.com/missing-saudi-journalist-jamal-khashoggi-ties-to-osama-bin-laden-islamists-2018-10', 'urlToImage': 'https://amp.businessinsider.com/images/5bc031198053836302721556-2732-1366.jpg', 'publishedAt': '2018-10-15T21:22:33Z', 'content': 'Saudi journalist Jamal Khashoggi had a long, complicated career before he went missing in early October. Khashoggi, who was a US resident and wrote for The Washington Post, disappeared on October 2 after entering the Saudi consulate in Istanbul to obtain docu… [+6432 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Turkish daily names Saudis in Khashoggi case, raising pressure on Riyadh', 'description': 'A pro-government Turkish daily on Wednesday published preliminary evidence from investigators it said identified a 15-member Saudi intelligence team involved in the unexplained disappearance of journalist Jamal Khashoggi.', 'url': 'https://www.reuters.com/article/us-saudi-politics-dissident-turkey/turkish-daily-names-saudis-in-khashoggi-case-raising-pressure-on-riyadh-idUSKCN1MK0J0', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20181010&t=2&i=1313129755&w=1200&r=LYNXNPEE990DT', 'publishedAt': '2018-10-10T14:56:45Z', 'content': 'ISTANBUL (Reuters) - A pro-government Turkish daily on Wednesday published preliminary evidence from investigators it said identified a 15-member Saudi intelligence team involved in the unexplained disappearance of journalist Jamal Khashoggi. The move added p… [+4700 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Rosie Perper', 'title': 'Report indicates the Saudi crown prince Mohammed bin Salman ordered operation to lure missing journalist Jamal Khashoggi into Saudi Arabia', 'description': 'Saudi crown prince Mohammed bin Salman may have been involved in a plot to lure journalist and prominent Saudi critic Jamal Khashoggi from his home in Virginia to Saudi Arabia, The Washington Post reported on Tuesday night, citing US intelligence intercepts. …', 'url': 'https://www.businessinsider.com/saudi-crown-prince-mohammed-bin-salman-jamal-khashoggi-disappearance-2018-10', 'urlToImage': 'https://amp.businessinsider.com/images/5bbdb9e119090733e7216494-1136-568.jpg', 'publishedAt': '2018-10-11T05:27:45Z', 'content': 'New reports published on Wednesday indicate that the Saudi crown prince Mohammed bin Salman may have been involved in a plot to lure journalist and prominent Saudi critic Jamal Khashoggi from Virginia back to Saudi Arabia. Khashoggi, a former adviser to senio… [+2943 chars]'}, {'source': {'id': None, 'name': 'Boingboing.net'}, 'author': 'Xeni Jardin', 'title': 'U.S. got $100 million from Saudi Arabia on the same day Pompeo was in Riyadh', 'description': 'No wonder he was smiling. The United States received $100 million from Saudi Arabia on Tuesday, which coincidentally, so weird!, was the same day Secty. of State Mike Pompeo landed in Riyadh to laugh and smile with Saudi Crown Prince Muhammad bin Salman about…', 'url': 'https://boingboing.net/2018/10/17/u-s-got-100-million-from-sau.html', 'urlToImage': 'https://media.boingboing.net/wp-content/uploads/2018/10/EDE08EC1-7E34-44F7-BA84-BD6C1D865E3F_cx0_cy10_cw0_w1023_r1_s.jpg', 'publishedAt': '2018-10-17T21:45:55Z', 'content': 'No wonder he was smiling. The United States received $100 million from Saudi Arabia on Tuesday, which coincidentally, so weird!, was the same day Secty. of State Mike Pompeo landed in Riyadh to laugh and smile with Saudi Crown Prince Muhammad bin Salman about… [+3861 chars]'}, {'source': {'id': 'the-huffington-post', 'name': 'The Huffington Post'}, 'author': 'AP', 'title': 'Saudi Arabia Rejects Trump Comments, Threatens Retaliation', 'description': 'The comments come the day after Trump warned of "severe punishment."', 'url': 'https://www.huffingtonpost.com/entry/saudi-arabia-rejects-trump-comments-threatens-retaliation_us_5bc34ec2e4b040bb4e832b03', 'urlToImage': 'https://img.huffingtonpost.com/asset/5bc35003250000df013a7443.jpeg?ops=1910_1000', 'publishedAt': '2018-10-14T14:23:18Z', 'content': 'DUBAI, United Arab Emirates (AP) Saudi Arabia warned Sunday it will respond to any threats against it as its stock market plunged following President Donald Trumps warning of severe punishment over the disappearance of Washington Post contributor Jamal Khasho… [+4128 chars]'}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Reuters', 'title': "Saudi journalist 'killed inside consulate' – Turkish sources", 'description': 'Jamal Khashoggi, a critic of Riyadh, had gone to the building in Istanbul seeking documents for his marriage Turkish authorities believe that the prominent Saudi journalist Jamal Khashoggi, who disappeared four days ago after entering Saudi Arabia’s consulate…', 'url': 'https://www.theguardian.com/world/2018/oct/06/saudi-journalist-killed-inside-consulate-turkish-sources', 'urlToImage': 'https://i.guim.co.uk/img/media/9bd36d3d840da4ec7366b2617ff1711eee4c6dfc/0_40_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZDM1ODZhNWVmNTc4MTc1NmQyMWEzYjYzNWU1MTcxNDEvdGctZGVmYXVsdC5wbmc&s=1ad6946094902197e4fe8c604017983e', 'publishedAt': '2018-10-06T21:35:20Z', 'content': 'Turkish authorities believe that the prominent Saudi journalist Jamal Khashoggi, who disappeared four days ago after entering Saudi Arabias consulate in Istanbul, was killed inside the consulate, two Turkish sources said on Saturday. The initial assessment of… [+1355 chars]'}]}