{'status': 'ok', 'totalResults': 37612, 'articles': [{'source': {'id': None, 'name': 'Slate.com'}, 'author': 'Emily Bazelon, David Plotz, Emily Bazelon, David Plotz', 'title': 'The “Kavanaugh in Crisis” Edition', 'description': 'Listen to Slate’s Political Gabfest via Apple Podcasts, Overcast, Spotify, Stitcher, or Google Play. D.C. Circuit Judge Brett Kavanaugh is now facing a ...', 'url': 'http://www.slate.com/articles/podcasts/gabfest/2018/09/in_a_special_bonus_episode_of_the_political_gabfest_an_analysis_of_the_sexual.html', 'urlToImage': 'http://www.slate.com/content/dam/slate/articles/podcasts/gabfest/2018/09/in_a_special_bonus_episode_of_the_political_gabfest_an_analysis_of_the_sexual/451378d8e5f14ca1b35aefd979cf41a3.jpeg.CROP.promo-large.jpeg', 'publishedAt': '2018-09-17T22:58:57Z', 'content': 'Supreme Court nominee Judge Brett Kavanaugh testifies before the Senate Judiciary Committee on the third day of his Supreme Court confirmation hearing on Capitol Hill Sept. 6 in Washington. Chip Somodevilla/Getty Images Listen to Slate’s Political Gabfest via… [+1177 chars]'}, {'source': {'id': 'the-new-york-times', 'name': 'The New York Times'}, 'author': 'JULIE HIRSCHFELD DAVIS', 'title': 'Putting Aside Grudge, Trump Backs Ex-Rival in Tight Nevada Race', 'description': 'The president dispensed with some of his usual bravado on Thursday and instead told an audience in a cavernous convention center in Las Vegas that the Republican majority was on a razor’s edge.', 'url': 'https://www.nytimes.com/2018/09/21/us/politics/trump-heller-nevada-rally.html', 'urlToImage': 'https://static01.nyt.com/images/2018/09/21/us/politics/21dc-trump/21dc-trump-facebookJumbo.jpg', 'publishedAt': '2018-09-21T04:46:27Z', 'content': '“Now, I have to say this,” Mr. Trump said. “We weren’t friends — I didn’t like him, he didn’t like me, and as we fought and fought and fought, believe it or not, we started to respect each other, then we started to like each other, then we started to love eac… [+1972 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': "Michael Avenatti Warns Trump, Kavanaugh: 'Be Very, Very Careful' About What You Do Next", 'description': 'Attorney Michael Avenatti has issued a stark warning to those attempting to', 'url': 'https://www.yahoo.com/news/michael-avenatti-warns-trump-kavanaugh-073826240.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/6NMCOfkk83dIppJ987sVmQ--~B/aD03MTU7dz0xMjc2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/the_huffington_post_584/7c18b6cac87e1650d8f7a7674b674018', 'publishedAt': '2018-09-25T07:38:26Z', 'content': 'Attorney Michael Avenatti has issued a stark warning to those attempting to discredit a new accuser of Judge Brett Kavanaugh. On Monday night, Stormy Daniels lawyer told CNNs Chris Cuomo that the woman was both a witness and a victim of Kavanaughs who had a n… [+1531 chars]'}, {'source': {'id': None, 'name': 'Slate.com'}, 'author': 'Rebecca Onion, Rebecca Onion', 'title': 'The Angle: No Help There Edition', 'description': 'A ship of fools: Bob Woodward’s book is too kind to the Donald Trump staffers it depicts as bulwarks against madness, and far too optimistic about our situation, Isaac Chotiner writes in a review. Altogether, reading Fear left Isaac confused: “Woodward obviou…', 'url': 'https://slate.com/news-and-politics/2018/09/kaepernicks-nike-ads-bob-woodward-fear-book-review-and-the-questions-kavanaugh-isnt-answering-in-slates-daily-newsletter.html', 'urlToImage': 'https://compote.slate.com/images/b21d117e-e39b-45c5-8a9f-987c09ed4b56.jpeg?width=780&height=520&rect=5178x3452&offset=90x0', 'publishedAt': '2018-09-10T21:26:04Z', 'content': 'This guy’s not so great, either. A ship of fools: Bob Woodward’s book is too kind to the Donald Trump staffers it depicts as bulwarks against madness, and far too optimistic about our situation, Isaac Chotiner writes in a review. Altogether, reading Fear left… [+1282 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Sen. Ted Cruz Heckled Out Of DC Restaurant By Anti-Kavanaugh Activists', 'description': 'Sen. Ted Cruz (R-Texas) was heckled out of a Washington, D.C., restaurant by', 'url': 'https://www.yahoo.com/news/sen-ted-cruz-heckled-dc-041357238.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/13.Sma2a78gy5XIAk413eA--~B/aD0xNjgxO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/the_huffington_post_584/8a77ed93193475d6680a5a6b4e60c81e', 'publishedAt': '2018-09-25T04:13:57Z', 'content': 'Sen. Ted Cruz (R-Texas) was heckled out of a Washington, D.C., restaurant by activists opposed to Supreme Court nominee Brett Kavanaugh as they chanted, We believe survivors! on Monday night. The incident, which was documented and posted by an account called … [+1210 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'David Choi', 'title': "'There are multiple witnesses who should be included': A lawyer for the woman accusing Brett Kavanaugh of sexual assault raises the stakes ahead of planned hearing", 'description': 'The attorney for Christine Blasey Ford, a 51-year-old research psychologist and professor who accused Judge Brett Kavanaugh of sexually assaulting her in the 1980s, called for additional witnesses to testify at a hearing planned for Monday. Attorney Lisa Bank…', 'url': 'https://www.businessinsider.com/brett-kavanaugh-allegation-multiple-witnesses-christine-ford-2018-9', 'urlToImage': 'https://amp.businessinsider.com/images/5ba2cc86dcee30ab0c8b581a-1920-960.jpg', 'publishedAt': '2018-09-20T00:05:55Z', 'content': "The attorney for Christine Blasey Ford, a 51-year-old research psychologist and professor who accused Judge Brett Kavanaugh of sexually assaulting her in the 1980s, claimed that the Senate Judiciary Committee's hearing scheduled for Monday felt rushed and cal… [+2909 chars]"}, {'source': {'id': 'the-new-york-times', 'name': 'The New York Times'}, 'author': 'CHARLIE SAVAGE', 'title': 'Legal Experts Urge Release of Watergate Report to Offer Mueller a Road Map', 'description': 'Robert S. Mueller III, the special counsel in the Russia inquiry, is expected to most likely write a report for his supervisor at the Justice Department when the investigation concludes. But it is not his only option.', 'url': 'https://www.nytimes.com/2018/09/14/us/politics/mueller-report-grand-jury-watergate.html', 'urlToImage': 'https://static01.nyt.com/images/2018/09/14/us/politics/14dc-watergate2/14dc-watergate2-facebookJumbo.jpg', 'publishedAt': '2018-09-14T16:14:43Z', 'content': 'Unlike Mr. Jaworski in 1974 and Mr. Mueller today, Mr. Starr was operating under a law — enacted after Watergate, and since lapsed — that clearly gave him the authority to send a report directly to Congress. In his 1976 memoir, “The Right and the Power: The P… [+2278 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Sinéad Baker', 'title': "Cartoon depicting Kavanaugh's accuser demanding roses, M&Ms for her testimony draws outrage, apology", 'description': 'The Indianapolis Star has apologized for a cartoon that shows Kavanaugh accuser Blasey Ford demand trivial things like roses and M&Ms when testifying about her accusations. Ford, through her lawyers, has called for conditions that will make for a fair hearing…', 'url': 'https://www.businessinsider.com/newspaper-apologises-blasey-ford-cartoon-demanding-roses-mms-2018-9', 'urlToImage': 'https://amp.businessinsider.com/images/5b9019fddcee301c008b5c96-2732-1366.jpg', 'publishedAt': '2018-09-25T12:01:50Z', 'content': 'A newspaper has apologized for publishing a cartoon that showed Christine Blasey Ford, who is accusing Supreme Court nominee Brett Kavanaugh of sexual assault, of making unreasonable demands like roses and M&amp;Ms as she publicly testifies. Ford, who is due … [+1930 chars]'}, {'source': {'id': None, 'name': 'Yahoo.com'}, 'author': None, 'title': 'Christine Blasey Ford Offers Senate 4 Affidavits Backing Her Claim Against Kavanaugh', 'description': 'Attorneys for Christine Blasey Ford on Wednesday submitted to the Senate', 'url': 'https://www.yahoo.com/news/christine-blasey-ford-offers-senate-133620764.html', 'urlToImage': 'https://s.yimg.com/uu/api/res/1.2/rf6oRjjgKdJbAGt_pAiQ.w--~B/aD0zMzc7dz02MDA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/the_huffington_post_584/203e86071ec4e5762763424f35804fa5', 'publishedAt': '2018-09-26T13:36:20Z', 'content': 'Attorneys for Christine Blasey Ford on Wednesday submitted to the Senate Judiciary Committee sworn affidavits from four people they say corroborate her sexual assault claim against Supreme Court nominee Brett Kavanaugh. Blaseys husband, Russell Ford, and thre… [+5082 chars]'}, {'source': {'id': None, 'name': 'Slate.com'}, 'author': 'Matthew Zeitlin, Matthew Zeitlin', 'title': 'Kavanaugh’s Summer 1982 Calendars Show Months of Hanging Out, Partying, Sports', 'description': 'Brett Kavanaugh’s calendars from the summer of 1982, when Christine Blasey Ford has said her alleged assault most likely happened, show a few months filled with trips, sports camps, haircuts, parties, movies, “beach week,” and even being grounded for a few we…', 'url': 'https://slate.com/news-and-politics/2018/09/kavanaugh-summer-1982-calendars-parties-sports-beach-week-mark-judge.html', 'urlToImage': 'https://compote.slate.com/images/3fde3387-ff22-46fa-ba85-174cf5cd26a5.jpeg?width=780&height=520&rect=3000x2000&offset=0x0', 'publishedAt': '2018-09-26T15:44:35Z', 'content': 'Supreme Court nominee Brett Kavanaugh, with his handwritten notes, testifying before the Senate Judiciary Committee on Sept. 6. Brett Kavanaugh and the Cruelty of Male Bonding Kavanaughs Drinking Needs Investigating Newly Uncovered Memo Suggests Kirstjen Niel… [+2039 chars]'}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'Alana Abramson', 'title': 'Read the Letter From Christine Blasey Ford’s Lawyers Requesting an FBI Inquiry Into Kavanaugh Allegations', 'description': 'Christine Blasey Ford has requested that the FBI investigate allegations that Supreme Court nominee Brett Kavanaugh sexually assaulted her', 'url': 'http://time.com/5400239/christine-blasey-ford-investigation-letter/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/09/gettyimages-1026663206.jpg?quality=85', 'publishedAt': '2018-09-19T02:16:40Z', 'content': 'Dear Senator Grassley: Thank you for reaching out yesterday afternoon. Dr. Christine Blasey Ford looks forward to working with you and the Committee. As you know, earlier this summer, Dr. Ford sought to tell her story, in confidence, so that lawmakers would h… [+1908 chars]'}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'Bob Schiff, Kristine Lucius, Jeff Berman and Lisa Graves', 'title': 'Brett Kavanaugh Can’t Be Trusted. We Know Because We Worked as Counsel to Senators When He Was in the Bush White House', 'description': 'Four former counsels to Democratic Senators write that there are two questions about whether Judge Brett Kavanaugh misled Congress', 'url': 'http://time.com/5398191/brett-kavanaugh-supreme-court-senators/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/09/kavanaugh-brett-supreme-court-nominee.jpg?quality=85', 'publishedAt': '2018-09-17T15:34:28Z', 'content': 'We watched the testimony of Judge Brett Kavanaugh before the Senate Judiciary Committee with dismay and disbelief. His many misleading and false statements cast serious doubt on whether he should be confirmed to a seat on the U.S. Supreme Court. The events of… [+8322 chars]'}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'Gina Martinez', 'title': 'Bill Cosby And Brett Kavanaugh Are Both Victims of ‘Sex War,’ Publicist Says', 'description': "Bill Cosby's publicist compared the his conviction to the misconduct allegations against Supreme Court nominee Brett Kavanaugh", 'url': 'http://time.com/5406267/bill-cosby-brett-kavanaugh/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/09/bill-cosby-handcuffs.jpg?quality=85', 'publishedAt': '2018-09-25T23:07:48Z', 'content': 'Bill Cosby’s publicist compared the 81-year-old comedian’s conviction Tuesday to the misconduct allegations against Supreme Court nominee Brett Kavanaugh, saying that were both part of a “sex war.” Andrew Wyatt proclaimed that Cosby’s conviction was the resul… [+1824 chars]'}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'Gina Martinez', 'title': 'Christine Blasey Ford Confirms Intent to Testify Against Kavanaugh for Judiciary Committee', 'description': 'Christine Blasey Ford has agreed to testify against nominee Brett Kavanaugh this Thursday in front of the Senate Judiciary Committee.', 'url': 'http://time.com/5403937/christine-blasey-ford-testify-thursday-judiciary-committee/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/09/grassley-questions-timing-kavanaugh-sexual-assault-accusations.jpg?quality=85', 'publishedAt': '2018-09-22T19:42:05Z', 'content': 'Christine Blasey Ford, the woman accusing Supreme Court nominee Brett Kavanaugh of sexual assault, has agreed to testify this Thursday in front of the Senate Judiciary Committee. Ford’s attorney Debra Katz confirmed Ford’s testimony in an email Saturday, meet… [+1563 chars]'}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'Gina Martinez', 'title': 'Kavanaugh’s Second Accuser Is Willing to Testify If There Is an FBI Probe, Her Attorney Says', 'description': "Deborah Ramirez's lawyer has requested an FBI investigation into her allegations against Supreme Court nominee Brett Kavanaugh", 'url': 'http://time.com/5406497/deborah-ramirez-fbi-investigation-brett-kavanaugh/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/09/brett-kavanaugh-senate-vote.jpg?quality=85', 'publishedAt': '2018-09-26T02:30:25Z', 'content': 'Deborah Ramirez, the second woman to publicly accuse Supreme Court Justice nominee Brett Kavanaugh of sexual misconduct, is willing to testify if the FBI investigates her allegation, her lawyer said Tuesday night. Speaking with CNN’s Anderson Cooper, attorney… [+1564 chars]'}, {'source': {'id': 'time', 'name': 'Time'}, 'author': 'Associated Press', 'title': 'Christine Blasey Ford Provides Polygraph Results to Senate Judiciary Committee', 'description': "Christine Blasey Ford's lawyers have given the Senate Judiciary Committee results of a polygraph test on her allegations against Kavanaugh.", 'url': 'http://time.com/5407449/christine-blasey-ford-kavanaugh-polygraph-test/', 'urlToImage': 'https://timedotcom.files.wordpress.com/2018/09/gettyimages-1026739858.jpg?quality=85', 'publishedAt': '2018-09-26T19:58:57Z', 'content': '(WASHINGTON) — Lawyers for Christine Blasey Ford have provided the Senate Judiciary Committee with the results of a polygraph test on her accusation that Supreme Court nominee Brett Kavanaugh sexually assaulted her when they were teens. The documents indicate… [+689 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Sinéad Baker', 'title': "Why Democrats brought up the Kavanaugh accusations at the last minute when they've known since July", 'description': "Democratic Senator Dianne Feinstein got a letter from professor Christine Blasey Ford accusing Supreme Court nominee Brett Kavanaugh of sexual assault in July, but did not mention it until the final stages of Kavanaugh's confirmation in September. Feinstein c…", 'url': 'https://www.businessinsider.com/why-democrats-waited-coming-forward-kavanaugh-accusations-2018-9', 'urlToImage': 'https://amp.businessinsider.com/images/5ba8bef0be2012b93d8b4568-1536-768.jpg', 'publishedAt': '2018-09-24T10:39:50Z', 'content': 'The Democratic senator who has known about the sexual assault allegations against Supreme Court nominee Brett Kavanaugh since July said that she held off on making the allegations public because the accuser had asked her to keep them confidential. Democratic … [+2618 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Alexandra Ma', 'title': "Tucker Carlson says rape survivors must immediately report their rapist or they are 'part of the problem'", 'description': 'Tucker Carlson discussed the sexual assault allegation against Supreme Court nominee Brett Kavanaugh on his show Tuesday night. The Fox News host suggested that rape survivors had an "obligation" to immediately report their attackers. He said: "If Bernie Mado…', 'url': 'https://www.businessinsider.com/tucker-carlson-rape-survivors-who-dont-report-are-part-of-the-problem-2018-9', 'urlToImage': 'https://amp.businessinsider.com/images/5bab74334fe807f66c8b4568-1136-568.jpg', 'publishedAt': '2018-09-26T12:37:05Z', 'content': 'Tucker Carlson suggested that rape survivors have an "obligation" to immediately report their rapists, and that they are "part of the problem" if they don\'t. The Fox News host on Tuesday night likened surviving rape to losing money on an investment scheme, an… [+2861 chars]'}, {'source': {'id': None, 'name': 'Thisisinsider.com'}, 'author': 'Gabrielle Sorto', 'title': 'Alumnae of Kavanaugh accuser’s high school are circulating a letter in support of her', 'description': "Alumnae of Kavanaugh accuser’s high school are circulating a letter of support. More than 200 women from the classes of 1967-2018 have signed the letter as of late Monday morning. Kavanaugh has denied the allegation and said he'd be willing to testify on the …", 'url': 'https://www.thisisinsider.com/christine-blasey-ford-high-school-classmates-letter-of-support-2018-9', 'urlToImage': 'https://amp.businessinsider.com/images/5b9fe7de2badb908ae1e0dfc-2732-1366.jpg', 'publishedAt': '2018-09-17T17:41:35Z', 'content': "A group of women who went to Christine Blasey Ford's high school are circulating a letter of support for her after she came forward with sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh. Ford, who is a California professor, came for… [+1759 chars]"}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Michelle Mark', 'title': "Ronald Reagan's daughter Patti Davis says she was sexually assaulted and can’t remember certain details — just like Christine Blasey Ford", 'description': 'Patti Davis, the daughter of former President Ronald Reagan, wrote in a Washington Post op-ed Friday that she was sexually assaulted decades ago and forgets certain details — just like Christine Blasey Ford. Ford has accused Supreme Court nominee Brett Kavana…', 'url': 'https://www.businessinsider.com/patti-davis-sexual-assault-defends-christine-blasey-ford-kavanaugh-accuser-2018-9', 'urlToImage': 'https://amp.businessinsider.com/images/5ba553c227ca7494208b4567-1920-960.jpg', 'publishedAt': '2018-09-21T21:29:25Z', 'content': 'Patti Davis, the daughter of former President Ronald Reagan, described in a Washington Post op-ed her own sexual assault 40 years ago, and why she remembers certain details perfectly, and others not at all. Her revelation comes amid a national debate over Sup… [+2050 chars]'}]}