{'status': 'ok', 'totalResults': 17466, 'articles': [{'source': {'id': 'wired', 'name': 'Wired'}, 'author': 'Lydia Horne', 'title': "Kremlin's Kids: Giant Family Portraits With Vladimir Putin", 'description': "Every year, Russia's president presents the Order of Parental Glory to parents who raise seven or more children. The photos are ... something to behold.", 'url': 'https://www.wired.com/story/kremlin-family-photos-gallery/', 'urlToImage': 'https://media.wired.com/photos/5b883d9df8da0b35c874a607/191:100/pass/Kremlin_1.jpg', 'publishedAt': '2018-09-05T17:03:43Z', 'content': 'Hey there, mother of that squabbling brood of eight menacing Russian children: Vladimir Putin wants to take a group photo. In fact, he wants to bestow upon you the Order of Parental Glory, an award given to parents who raise seven or more children (biological… [+2371 chars]'}, {'source': {'id': 'bbc-news', 'name': 'BBC News'}, 'author': 'https://www.facebook.com/bbcnews', 'title': 'Putin softens pension reforms after outcry', 'description': 'After facing protests and slumping approval ratings, Russian President Vladimir Putin softens reforms to pensions', 'url': 'https://www.bbc.co.uk/news/world-europe-45342721', 'urlToImage': 'https://ichef.bbci.co.uk/news/1024/branded_news/34BD/production/_103210531_mediaitem103210530.jpg', 'publishedAt': '2018-08-29T09:33:42Z', 'content': 'Image copyright EPA Image caption Protests have taken place across Russia Russian President Vladimir Putin has softened plans to reform pensions following angry protests and a slump in his approval rating. He said the retirement age for women would be increas… [+454 chars]'}, {'source': {'id': 'wired', 'name': 'Wired'}, 'author': 'Emily Dreyfuss', 'title': "'The Americans' Deserves an Emmy For Its Look Inside Putin's Mind", 'description': "For five seasons, the spy drama gave American viewers a grasp of Soviet thinking—one that's shockingly relevant today.", 'url': 'https://www.wired.com/story/emmy-endorsement-the-americans-writing/', 'urlToImage': 'https://media.wired.com/photos/5b96ad67eeaf330b6fd5a419/191:100/pass/Americans_610_FINAL_DNx175.Sub.46.jpg', 'publishedAt': '2018-09-13T13:00:00Z', 'content': "All week, WIRED's Culture team will be writing endorsement letters for various Emmy nominees in advance of next Monday's awards ceremony. Today: senior writer and amateur Soviet historian Emily Dreyfuss. Before he was president of Russia, Vladimir Putin was a… [+8049 chars]"}, {'source': {'id': 'the-new-york-times', 'name': 'The New York Times'}, 'author': 'DAVID LEONHARDT', 'title': 'The Urgent Question of Trump and Money Laundering', 'description': 'President Trump with President Putin in Helsinki in July. Trump’s odd affinity for Russia continues to cause him trouble.', 'url': 'https://www.nytimes.com/2018/09/09/opinion/trump-money-laundering-russia-mueller.html', 'urlToImage': 'https://static01.nyt.com/images/2018/09/07/opinion/00leonhardtWeb/00leonhardtWeb-facebookJumbo.jpg', 'publishedAt': '2018-09-09T23:00:03Z', 'content': 'Trump also had a habit of selling real estate to Russians in all-cash deals. Money launderers like such deals, because they can turn illegally earned cash into a legitimate asset, usually at an inflated price that rewards the seller for the risk. One especial… [+1928 chars]'}, {'source': {'id': 'cnn', 'name': 'CNN'}, 'author': None, 'title': 'Kremlin releases video of Putin vacationing', 'description': "The Kremlin has released video of Vladimir Putin vacationing in Siberia. CNN's Fred Pleitgen explains what the Russian president was up to.", 'url': 'https://www.cnn.com/videos/world/2018/08/28/kremlin-releases-video-putin-vacation-siberia-pleitgen-tsr-vpx.cnn', 'urlToImage': 'https://cdn.cnn.com/cnnnext/dam/assets/180827174012-putin-vacays-siberia-super-tease.jpg', 'publishedAt': '2018-08-28T22:55:02Z', 'content': "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {'source': {'id': 'the-new-york-times', 'name': 'The New York Times'}, 'author': 'MICHAEL SCHWIRTZ and ELLEN BARRY', 'title': 'A Spy Story: Sergei Skripal Was a Little Fish. He Had a Big Enemy.', 'description': 'Sergei Skripal and Vladimir Putin, Soviet men of the same age, were raised to wage war against the West. After the Soviet Union collapsed, one rose. And one fell.', 'url': 'https://www.nytimes.com/2018/09/09/world/europe/sergei-skripal-russian-spy-poisoning.html', 'urlToImage': 'https://static01.nyt.com/images/2018/09/06/world/europe/Skripal1/Skripal1-facebookJumbo.jpg', 'publishedAt': '2018-09-10T02:45:13Z', 'content': '“He missed Russia,” said Ross Cassidy, a burly former submariner who became one of his closest friends. Lisa Carey, another neighbor, observed the Russian on his daily rounds, walking to the Bargain Stop in his tracksuit to buy scratch tickets. “He used to bo… [+1808 chars]'}, {'source': {'id': None, 'name': 'Gizmodo.com'}, 'author': 'Tom McKay', 'title': "Google Complies With Russian Order to Take Down Opposition Leader's YouTube Ad", 'description': 'Google took down a YouTube ad for Russian opposition leader Alexei Navalny before a vote for regional governors on Sunday and amid protests over President Vladimir Putin’s plans to raise the retirement age for state pensions, the Guardian reported. Read more.…', 'url': 'https://gizmodo.com/google-complies-with-russian-order-to-take-down-opposit-1828921301', 'urlToImage': 'https://i.kinja-img.com/gawker-media/image/upload/s--2q11jtM9--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/bspb7vjujqvcfjubrhjc.jpg', 'publishedAt': '2018-09-09T17:30:00Z', 'content': 'Google took down a series of YouTube ads for Russian opposition leader Alexei Navalny before a vote for regional governors on Sunday and amid protests over President Vladimir Putin’s plans to raise the retirement age for state pensions, the Guardian reported.… [+3300 chars]'}, {'source': {'id': 'the-new-york-times', 'name': 'The New York Times'}, 'author': 'ROGER COHEN', 'title': 'Democracy Will Still Surprise Us', 'description': 'Of late, Western democracy has concentrated rather than spread wealth, suggesting it serves injustice. But it is stubborn and adaptable.', 'url': 'https://www.nytimes.com/2018/09/21/opinion/western-democracy-trump-challenges.html', 'urlToImage': 'https://static01.nyt.com/images/2018/09/21/opinion/21cohenWeb/21cohenWeb-facebookJumbo.jpg', 'publishedAt': '2018-09-21T10:23:23Z', 'content': 'Yascha Mounk, a lecturer on government at Harvard University, said the anti-democratic fires raging should not be underestimated. Each civic act, he suggested, is a glass of water that may help extinguish the flames. Which brings me to President Trump, the fl… [+1629 chars]'}, {'source': {'id': 'the-guardian-au', 'name': 'The Guardian (AU)'}, 'author': 'Reuters in Moscow', 'title': 'Thousands protest in Russia against plans to hike pension age', 'description': 'Vladimir Putin has called the reform a financial necessity as Communist party leader brands move ‘cannibalistic’ Thousands of people across Russia joined protests on Sunday against government plans to raise the pension age, despite recent promises by Presiden…', 'url': 'https://www.theguardian.com/world/2018/sep/02/thousands-protest-in-russia-against-plans-to-hike-retirement-age', 'urlToImage': 'https://i.guim.co.uk/img/media/7c08a238b3acd6feff280a97ab37be264b9b1f7e/0_133_5224_3134/master/5224.jpg?width=1200&height=630&quality=85&auto=format&usm=12&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly9hc3NldHMuZ3VpbS5jby51ay9pbWFnZXMvb3ZlcmxheXMvZDM1ODZhNWVmNTc4MTc1NmQyMWEzYjYzNWU1MTcxNDEvdGctZGVmYXVsdC5wbmc&s=a9a8d700c9d6373021b7b5fa636bf315', 'publishedAt': '2018-09-02T16:08:32Z', 'content': 'Thousands of people across Russia joined protests on Sunday against government plans to raise the pension age, despite recent promises by President Vladimir Putin to soften the unpopular measure. The protests show that the proposed policy remains a politicall… [+2797 chars]'}, {'source': {'id': 'cnn', 'name': 'CNN'}, 'author': None, 'title': "Papadopoulos contradicts Sessions' testimony", 'description': "Convicted former Trump campaign adviser George Papadopoulos has publicly contradicted Attorney General Jeff Sessions' sworn testimony to Congress, saying both Sessions and President Trump apparently supported his proposal that Trump meet with Vladimir Putin d…", 'url': 'https://www.cnn.com/videos/politics/2018/09/03/george-papadopoulos-jeff-sessions-trump-tower-meeting-claim-wolf-vpx.cnn', 'urlToImage': 'https://cdn.cnn.com/cnnnext/dam/assets/171030172858-papadopoulos-thumbnail-super-tease.jpg', 'publishedAt': '2018-09-03T18:02:22Z', 'content': "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {'source': {'id': 'bbc-news', 'name': 'BBC News'}, 'author': 'https://www.facebook.com/bbcnews', 'title': 'Russia to hold biggest war games since Cold War', 'description': "Next month's military exercise in eastern Russia will involve 300,000 personnel and Chinese troops.", 'url': 'https://www.bbc.co.uk/news/world-europe-45330161', 'urlToImage': 'https://ichef.bbci.co.uk/news/1024/branded_news/1AE9/production/_103198860_rushowitzerreut23aug18.jpg', 'publishedAt': '2018-08-28T11:36:34Z', 'content': 'Image copyright Reuters Image caption A Russian howitzer: Military modernisation is a priority for President Putin Russia plans to hold massive war games involving 300,000 personnel next month - its biggest military manoeuvres since the Cold War. Defence Mini… [+1036 chars]'}, {'source': {'id': 'cnn', 'name': 'CNN'}, 'author': 'David Volodzko', 'title': "What makes a leader's support suddenly collapse", 'description': 'Once the home of free-market capitalism and a hawkish view of our adversaries, the Republican Party continues to support President Donald Trump despite his protectionist trade war with China and dovish bond with Russian President Vladimir Putin. One eventuall…', 'url': 'https://www.cnn.com/2018/09/25/opinions/south-korea-lesson-for-republican-party-volodzko/index.html', 'urlToImage': 'https://cdn.cnn.com/cnnnext/dam/assets/180925152950-park-trump-split-super-tease.jpg', 'publishedAt': '2018-09-25T16:11:06Z', 'content': 'David Volodzko is the former national editor of the Korea JoongAng Daily, the sister paper for The New York Times in South Korea. His writing has also appeared in The Wall Street Journal, The New Republic, Bloomberg, Slate, Vice and The Diplomat. He has spent… [+9127 chars]'}, {'source': {'id': 'fox-news', 'name': 'Fox News'}, 'author': 'Gregg Re', 'title': 'Convicted ex-Trump aide George Papadopoulos suggests Sessions lied to Congress about Putin summit - Fox News', 'description': 'Fox News Convicted ex-Trump aide George Papadopoulos suggests Sessions lied to Congress about Putin summit Fox News Former Trump campaign foreign policy adviser George Papadopoulos on Sunday claimed Attorney General Jeff Sessions was "enthusiastic" about a po…', 'url': 'http://www.foxnews.com/politics/2018/09/09/convicted-ex-trump-aide-george-papadopoulos-suggests-sessions-lied-to-congress-about-putin-summit.html', 'urlToImage': 'http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2018/09/08/0/0/694940094001_5832439986001_5832438117001-vs.jpg?ve=1', 'publishedAt': '2018-09-09T16:57:16Z', 'content': 'Former Trump campaign foreign policy adviser George Papadopoulos on Sunday claimed Attorney General Jeff Sessions was "enthusiastic" about a potential meeting between then-candidate Trump and Russian President Vladimir Putin, contradicting Sessions\' sworn con… [+4590 chars]'}, {'source': {'id': 'bbc-news', 'name': 'BBC News'}, 'author': 'https://www.facebook.com/bbcnews', 'title': 'Iosif Kobzon: Russians mourn controversial crooner', 'description': 'Iosif Kobzon was the soundtrack to the lives of many Russians but led a controversial life.', 'url': 'https://www.bbc.co.uk/news/world-europe-45354090', 'urlToImage': 'https://ichef.bbci.co.uk/news/1024/branded_news/8357/production/_103232633_gettyimages-516339544.jpg', 'publishedAt': '2018-08-30T16:08:08Z', 'content': 'Image copyright Getty Images Image caption Kobzon, a staunch supporter of the annexation of Crimea, sang in this 2016 celebration concert The crooner, Soviet icon and later Russian MP Iosif Kobzon has died at the age of 80. The death of the singer, who had lo… [+3626 chars]'}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Putin says chance circumstances were behind downing of Russian plane', 'description': 'President Vladimir Putin said on Tuesday that the shooting down of a Russian military plane near Syria was the result of a chain of tragic and chance circumstances.', 'url': 'https://www.reuters.com/article/us-mideast-crisis-syria-russia-putin/putin-says-chance-circumstances-were-behind-downing-of-russian-plane-idUSKCN1LY21R', 'urlToImage': 'https://s4.reutersmedia.net/resources/r/?m=02&d=20180918&t=2&i=1305638849&w=1200&r=LYNXNPEE8H1DS', 'publishedAt': '2018-09-18T13:31:52Z', 'content': 'MOSCOW (Reuters) - President Vladimir Putin said on Tuesday that the shooting down of a Russian military plane near Syria was the result of a chain of tragic and chance circumstances. The Russian Ministry of Defence said earlier on Tuesday that the aircraft w… [+634 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'John Haltiwanger', 'title': "The Kremlin released photos of Putin's summer vacation to Siberia, and he has his shirt on this time", 'description': 'The Kremlin released new photos on Monday of Russian president Vladimir Putin taking a break from his official duties to go hiking in Siberia with his top security chiefs, Reuters reports. In the past, the 65-year-old leader often posed shirtless in his offic…', 'url': 'https://www.businessinsider.com/putin-summer-vacation-photos-shirt-on-siberia-2018-8', 'urlToImage': 'https://amp.businessinsider.com/images/5b85ac78e199f319008b570e-1920-960.jpg', 'publishedAt': '2018-08-28T21:02:54Z', 'content': 'Russian President Vladimir Putin recently took a break from his official duties for a brief vacation in Siberia. Alexei Nikolsky/AP The Kremlin released new photos on Monday of Russian president Vladimir Putin taking a break from his official duties to go hik… [+484 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Alexandra Ma', 'title': 'Russian TV has a new show dedicated to fawning over Putin, and it said even bears are afraid of him', 'description': 'The state-run Rossiya-1 TV channel started broadcasting a show that fawns over Russian President Vladimir Putin. The "Moscow. Kremlin. Putin." show aired clips of Putin hiking and of his associates praising his physical fitness and personality. The series com…', 'url': 'https://www.businessinsider.com/russia-tv-launches-new-show-dedicated-to-praising-putin-2018-9', 'urlToImage': 'https://amp.businessinsider.com/images/5b8e5298b354cdb8228b4c10-1920-960.jpg', 'publishedAt': '2018-09-04T10:25:02Z', 'content': "Russia's state-run Rossiya-1 TV channel is running a new TV program to glorify Vladimir Putin. Alexei Nikolsky/AP Russian state TV has dedicated an entire show to documenting Vladimir Putin's activities and praising him. In the first episode of Rossiya-1's ne… [+3168 chars]"}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': "Israel's Netanyahu to speak to Russia's Putin: Israeli diplomatic source", 'description': 'Israeli Prime Minister Benjamin Netanyahu was expected to speak with Russian President Vladimir Putin, an Israeli diplomatic source said on Tuesday, following the downing of a Russian plane over Syria.', 'url': 'https://www.reuters.com/article/us-mideast-crisis-syria-russia-netanyahu/israels-netanyahu-to-speak-to-russias-putin-israeli-diplomatic-source-idUSKCN1LY1VK', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20180918&t=2&i=1305621037&w=1200&r=LYNXNPEE8H197', 'publishedAt': '2018-09-18T12:25:59Z', 'content': 'JERUSALEM (Reuters) - Israeli Prime Minister Benjamin Netanyahu was expected to speak with Russian President Vladimir Putin, an Israeli diplomatic source said on Tuesday, following the downing of a Russian plane over Syria. The official, who declined to be na… [+511 chars]'}, {'source': {'id': 'business-insider', 'name': 'Business Insider'}, 'author': 'Alex Lockie', 'title': "Putin made a telling blunder in a shouting match with Ukraine's president, France's Hollande says", 'description': 'Russian President Vladimir Putin became enraged and conspicuously blundered during the 2015 Minsk Agreement talks with Ukraine, according to a book by former French President Francois Hollande. Russia illegally annexed Crimea from Ukraine in 2014. The US, EU,…', 'url': 'https://www.businessinsider.com/putin-blundered-shoutingat-ukraines-poroshenko-france-hollande-book-2018-9', 'urlToImage': 'https://amp.businessinsider.com/images/545ce69a6da811d14ef5a007-2732-1366.jpg', 'publishedAt': '2018-09-03T11:47:42Z', 'content': "Russian President Vladimir Putin became so enraged during a shouting match with Ukrainian President Petro Poroshenko that he revealed he was lying about Russia's role in a military uprising in eastern Ukraine, former French President Francois Hollande wrote i… [+2451 chars]"}, {'source': {'id': 'reuters', 'name': 'Reuters'}, 'author': 'Reuters Editorial', 'title': 'Kremlin says too early to speak about Putin-Trump meeting in Paris', 'description': 'The Kremlin spokesman said it was too early to talk about any meeting between the President Vladimir Putin and U.S. President Donald Trump at a World War I anniversary event due to be marked in Paris in November, TASS news agency reported.', 'url': 'https://www.reuters.com/article/us-usa-russia-putin-trump/kremlin-says-too-early-to-speak-about-putin-trump-meeting-in-paris-idUSKCN1LH3GC', 'urlToImage': 'https://s3.reutersmedia.net/resources/r/?m=02&d=20180901&t=2&i=1299618091&w=1200&r=LYNXNPEE802CO', 'publishedAt': '2018-09-01T12:43:27Z', 'content': 'MOSCOW (Reuters) - The Kremlin spokesman said it was too early to talk about any meeting between the President Vladimir Putin and U.S. President Donald Trump at a World War I anniversary event due to be marked in Paris in November, TASS news agency reported. … [+413 chars]'}]}